[Survived] ObjectLiteral
src/insurance/allowed_claims_registry.ts:88:53
   enableFileLoad?: boolean;
 }
 
-const DEFAULT_CONFIG: AllowedClaimsRegistryConfig = {
-  claims: [],
-  disallowedPatterns: [],
-  partialMatchThreshold: 0.6,
-  enableFileLoad: true,
-};
+const DEFAULT_CONFIG: AllowedClaimsRegistryConfig = {};
 
 export class AllowedClaimsRegistry {

[Survived] ArrayDeclaration
src/insurance/allowed_claims_registry.ts:90:23
 
 const DEFAULT_CONFIG: AllowedClaimsRegistryConfig = {
   claims: [],
-  disallowedPatterns: [],
+  disallowedPatterns: ["Stryker was here"],
   partialMatchThreshold: 0.6,
   enableFileLoad: true,

[Survived] BooleanLiteral
src/insurance/allowed_claims_registry.ts:92:19
   claims: [],
   disallowedPatterns: [],
   partialMatchThreshold: 0.6,
-  enableFileLoad: true,
+  enableFileLoad: false,
 };
 

[Survived] ArrayDeclaration
src/insurance/allowed_claims_registry.ts:105:45
 
   // Dense embedding fields (N-15). Populated by initialize().
   private embeddingPipeline: FeaturePipelineFn | null = null;
-  private claimEmbeddings: Float32Array[] = [];
+  private claimEmbeddings: Float32Array[] = ["Stryker was here"];
   private embeddingInitialized = false;
 

[Killed] BooleanLiteral
src/insurance/allowed_claims_registry.ts:106:34
   // Dense embedding fields (N-15). Populated by initialize().
   private embeddingPipeline: FeaturePipelineFn | null = null;
   private claimEmbeddings: Float32Array[] = [];
-  private embeddingInitialized = false;
+  private embeddingInitialized = true;
 
   constructor(config: Partial<AllowedClaimsRegistryConfig> = {}) {
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[NoCoverage] ArrayDeclaration
src/insurance/allowed_claims_registry.ts:114:75
     this.claimTexts = [];
     this.vectorStore = new VectorStore<ApprovedClaim>();
 
-    let claims = Array.isArray(this.config.claims) ? this.config.claims : [];
+    let claims = Array.isArray(this.config.claims) ? this.config.claims : ["Stryker was here"];
     let disallowedPatterns = Array.isArray(this.config.disallowedPatterns)
       ? this.config.disallowedPatterns

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:120:7
       : [];
 
     if (
-      this.config.enableFileLoad &&
-      (claims.length === 0 || disallowedPatterns.length === 0)
+      true
     ) {
       const loaded = loadClaimsCatalog(this.config);
killedBy: TenantPolicyIsolation — OpaClaimsCheck ctx.tenantId flow ctx.tenantId flows from OpaClaimsCheck.evaluate() to evaluateClaimsCheck()
statusReason: TypeError: (0 , fs_1.existsSync) is not a function

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:120:7
       : [];
 
     if (
-      this.config.enableFileLoad &&
-      (claims.length === 0 || disallowedPatterns.length === 0)
+      false
     ) {
       const loaded = loadClaimsCatalog(this.config);
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] LogicalOperator
src/insurance/allowed_claims_registry.ts:121:8
 
     if (
       this.config.enableFileLoad &&
-      (claims.length === 0 || disallowedPatterns.length === 0)
+      (claims.length === 0 && disallowedPatterns.length === 0)
     ) {
       const loaded = loadClaimsCatalog(this.config);
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true merges file disallowed_patterns with injected patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:121:8
 
     if (
       this.config.enableFileLoad &&
-      (claims.length === 0 || disallowedPatterns.length === 0)
+      (false || disallowedPatterns.length === 0)
     ) {
       const loaded = loadClaimsCatalog(this.config);
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true merges file disallowed_patterns with injected patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:122:7
     if (
       this.config.enableFileLoad &&
       (claims.length === 0 || disallowedPatterns.length === 0)
-    ) {
-      const loaded = loadClaimsCatalog(this.config);
-      if (claims.length === 0 && loaded.claims.length > 0) {
-        claims = loaded.claims;
-      }
-      if (loaded.disallowedPatterns.length > 0) {
-        disallowedPatterns = Array.from(
-          new Set([...loaded.disallowedPatterns, ...disallowedPatterns]),
-        );
-      }
-    }
+    ) {}
 
     this.disallowedPatterns = disallowedPatterns;
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:124:11
       (claims.length === 0 || disallowedPatterns.length === 0)
     ) {
       const loaded = loadClaimsCatalog(this.config);
-      if (claims.length === 0 && loaded.claims.length > 0) {
+      if (true) {
         claims = loaded.claims;
       }
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true prefers injected claims over file when claims array is non-empty
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:124:11
       (claims.length === 0 || disallowedPatterns.length === 0)
     ) {
       const loaded = loadClaimsCatalog(this.config);
-      if (claims.length === 0 && loaded.claims.length > 0) {
+      if (true && loaded.claims.length > 0) {
         claims = loaded.claims;
       }
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true prefers injected claims over file when claims array is non-empty
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:127:11
       if (claims.length === 0 && loaded.claims.length > 0) {
         claims = loaded.claims;
       }
-      if (loaded.disallowedPatterns.length > 0) {
+      if (false) {
         disallowedPatterns = Array.from(
           new Set([...loaded.disallowedPatterns, ...disallowedPatterns]),
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads disallowed_patterns from file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:127:11
       if (claims.length === 0 && loaded.claims.length > 0) {
         claims = loaded.claims;
       }
-      if (loaded.disallowedPatterns.length > 0) {
+      if (loaded.disallowedPatterns.length <= 0) {
         disallowedPatterns = Array.from(
           new Set([...loaded.disallowedPatterns, ...disallowedPatterns]),
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads disallowed_patterns from file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrayDeclaration
src/insurance/allowed_claims_registry.ts:129:19
       }
       if (loaded.disallowedPatterns.length > 0) {
         disallowedPatterns = Array.from(
-          new Set([...loaded.disallowedPatterns, ...disallowedPatterns]),
+          new Set([]),
         );
       }
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads disallowed_patterns from file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ArrowFunction
src/insurance/allowed_claims_registry.ts:135:59
     }
 
     this.disallowedPatterns = disallowedPatterns;
-    this.disallowedPatternsLower = disallowedPatterns.map((pattern) =>
-      pattern.toLowerCase(),
+    this.disallowedPatternsLower = disallowedPatterns.map(() => undefined,
     );
 
killedBy: Full Pipeline E2E Smoke Test (N-12 + N-13 + N-14) Alpha tenant — OPA claims refuse path (medical) '100% effective' disallowed pattern → refuse
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "refuse"
Received: "allow"

[Killed] MethodExpression
src/insurance/allowed_claims_registry.ts:136:7
 
     this.disallowedPatterns = disallowedPatterns;
     this.disallowedPatternsLower = disallowedPatterns.map((pattern) =>
-      pattern.toLowerCase(),
+      pattern.toUpperCase(),
     );
 
killedBy: AllowedClaimsRegistry matchDisallowedPatterns should detect matching disallowed pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:139:33
       pattern.toLowerCase(),
     );
 
-    for (const claim of claims) {
-      this.claims.set(claim.id, claim);
-      this.claimTexts.push(claim);
-    }
+    for (const claim of claims) {}
 
     // Index claims into VectorStore for TF-IDF cosine similarity matching.
killedBy: Full Pipeline E2E Smoke Test (N-12 + N-13 + N-14) Alpha tenant — OPA claims allow path (medical) exact registered claim → allow decision
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "refuse"

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:146:37
 
     // Index claims into VectorStore for TF-IDF cosine similarity matching.
     // Replaces the word-overlap heuristic in matchText() Pass 2.
-    if (this.claimTexts.length > 0) {
-      this.vectorStore.index(
-        this.claimTexts.map((c) => ({ id: c.id, text: c.text, metadata: c })),
-      );
-    }
+    if (this.claimTexts.length > 0) {}
   }
 
killedBy: Full Pipeline E2E Smoke Test (N-12 + N-13 + N-14) Alpha tenant — OPA claims allow path (medical) exact registered claim → allow decision
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "refuse"

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:146:9
 
     // Index claims into VectorStore for TF-IDF cosine similarity matching.
     // Replaces the word-overlap heuristic in matchText() Pass 2.
-    if (this.claimTexts.length > 0) {
+    if (false) {
       this.vectorStore.index(
         this.claimTexts.map((c) => ({ id: c.id, text: c.text, metadata: c })),
killedBy: Full Pipeline E2E Smoke Test (N-12 + N-13 + N-14) Alpha tenant — OPA claims allow path (medical) exact registered claim → allow decision
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "refuse"

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:156:50
   /**
    * Look up a claim by its canonical ID.
    */
-  getById(claimId: string): ApprovedClaim | null {
-    return this.claims.get(claimId) ?? null;
-  }
+  getById(claimId: string): ApprovedClaim | null {}
 
   /**
killedBy: AllowedClaimsRegistry getById should return a claim by its ID
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] LogicalOperator
src/insurance/allowed_claims_registry.ts:157:12
    * Look up a claim by its canonical ID.
    */
   getById(claimId: string): ApprovedClaim | null {
-    return this.claims.get(claimId) ?? null;
+    return this.claims.get(claimId) && null;
   }
 
killedBy: AllowedClaimsRegistry getById should return a claim by its ID
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:163:65
   /**
    * Check whether text contains any disallowed patterns.
    */
-  matchDisallowedPatterns(text: string): DisallowedPatternMatch {
-    if (!text) {
-      return { matched: false, patterns: [] };
-    }
-
-    const lowered = text.toLowerCase();
-    const matches: string[] = [];
-
-    for (let i = 0; i < this.disallowedPatternsLower.length; i++) {
-      const patternLower = this.disallowedPatternsLower[i];
-      if (patternLower && lowered.includes(patternLower)) {
-        matches.push(this.disallowedPatterns[i]);
-      }
-    }
-
-    return { matched: matches.length > 0, patterns: matches };
-  }
+  matchDisallowedPatterns(text: string): DisallowedPatternMatch {}
 
   /**
killedBy: AllowedClaimsRegistry matchDisallowedPatterns should detect matching disallowed pattern
statusReason: TypeError: Cannot read properties of undefined (reading 'matched')

[Killed] BooleanLiteral
src/insurance/allowed_claims_registry.ts:164:9
    * Check whether text contains any disallowed patterns.
    */
   matchDisallowedPatterns(text: string): DisallowedPatternMatch {
-    if (!text) {
+    if (text) {
       return { matched: false, patterns: [] };
     }
killedBy: AllowedClaimsRegistry matchDisallowedPatterns should detect matching disallowed pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:164:9
    * Check whether text contains any disallowed patterns.
    */
   matchDisallowedPatterns(text: string): DisallowedPatternMatch {
-    if (!text) {
+    if (true) {
       return { matched: false, patterns: [] };
     }
killedBy: ControlEngine evaluate() with assistant text matching disallowed claim pattern should return rewrite for text containing a disallowed pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] BooleanLiteral
src/insurance/allowed_claims_registry.ts:165:25
    */
   matchDisallowedPatterns(text: string): DisallowedPatternMatch {
     if (!text) {
-      return { matched: false, patterns: [] };
+      return { matched: true, patterns: [] };
     }
 
killedBy: AllowedClaimsRegistry matchDisallowedPatterns should return no match for empty text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] MethodExpression
src/insurance/allowed_claims_registry.ts:168:21
       return { matched: false, patterns: [] };
     }
 
-    const lowered = text.toLowerCase();
+    const lowered = text.toUpperCase();
     const matches: string[] = [];
 
killedBy: ControlEngine evaluate() with assistant text matching disallowed claim pattern should return rewrite for text containing a disallowed pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:171:21
     const lowered = text.toLowerCase();
     const matches: string[] = [];
 
-    for (let i = 0; i < this.disallowedPatternsLower.length; i++) {
+    for (let i = 0; false; i++) {
       const patternLower = this.disallowedPatternsLower[i];
       if (patternLower && lowered.includes(patternLower)) {
killedBy: ControlEngine evaluate() with assistant text matching disallowed claim pattern should return rewrite for text containing a disallowed pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:171:67
     const lowered = text.toLowerCase();
     const matches: string[] = [];
 
-    for (let i = 0; i < this.disallowedPatternsLower.length; i++) {
-      const patternLower = this.disallowedPatternsLower[i];
-      if (patternLower && lowered.includes(patternLower)) {
-        matches.push(this.disallowedPatterns[i]);
-      }
-    }
+    for (let i = 0; i < this.disallowedPatternsLower.length; i++) {}
 
     return { matched: matches.length > 0, patterns: matches };
killedBy: Full Pipeline E2E Smoke Test (N-12 + N-13 + N-14) Alpha tenant — OPA claims refuse path (medical) '100% effective' disallowed pattern → refuse
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "refuse"
Received: "allow"

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:173:11
 
     for (let i = 0; i < this.disallowedPatternsLower.length; i++) {
       const patternLower = this.disallowedPatternsLower[i];
-      if (patternLower && lowered.includes(patternLower)) {
+      if (true) {
         matches.push(this.disallowedPatterns[i]);
       }
killedBy: Full Pipeline E2E Smoke Test (N-12 + N-13 + N-14) Alpha tenant — OPA claims allow path (medical) exact registered claim → allow decision
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "refuse"

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:173:11
 
     for (let i = 0; i < this.disallowedPatternsLower.length; i++) {
       const patternLower = this.disallowedPatternsLower[i];
-      if (patternLower && lowered.includes(patternLower)) {
+      if (false) {
         matches.push(this.disallowedPatterns[i]);
       }
killedBy: ControlEngine evaluate() with assistant text matching disallowed claim pattern should return rewrite for text containing a disallowed pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:178:23
       }
     }
 
-    return { matched: matches.length > 0, patterns: matches };
+    return { matched: false, patterns: matches };
   }
 
killedBy: Full Pipeline E2E Smoke Test (N-12 + N-13 + N-14) Alpha tenant — OPA claims refuse path (medical) '100% effective' disallowed pattern → refuse
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "refuse"
Received: "allow"

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:178:23
       }
     }
 
-    return { matched: matches.length > 0, patterns: matches };
+    return { matched: true, patterns: matches };
   }
 
killedBy: ControlEngine evaluate() with assistant text matching disallowed claim pattern should allow exact-match approved claims for assistant text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "rewrite"

[Killed] MethodExpression
src/insurance/allowed_claims_registry.ts:188:24
    * Production: replace with embedding cosine-similarity search.
    */
   matchText(proposedText: string): ClaimMatchResult {
-    const normalised = proposedText.toLowerCase().trim();
+    const normalised = proposedText.toLowerCase();
 
     // Pass 1: exact match (normalised)
killedBy: AllowedClaimsRegistry matchText exact match should trim whitespace for exact match
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "exact"
Received: "partial"

[Killed] MethodExpression
src/insurance/allowed_claims_registry.ts:188:24
    * Production: replace with embedding cosine-similarity search.
    */
   matchText(proposedText: string): ClaimMatchResult {
-    const normalised = proposedText.toLowerCase().trim();
+    const normalised = proposedText.toUpperCase().trim();
 
     // Pass 1: exact match (normalised)
killedBy: ClaimsCheck exact match should allow text that exactly matches an approved claim
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "UNVERIFIED_CLAIM",

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:191:42
     const normalised = proposedText.toLowerCase().trim();
 
     // Pass 1: exact match (normalised)
-    for (const claim of this.claimTexts) {
-      if (claim.text.toLowerCase().trim() === normalised) {
-        return {
-          matched: true,
-          claimId: claim.id,
-          confidence: 1.0,
-          requiredDisclaimerId: claim.requiredDisclaimerId ?? null,
-          matchType: "exact",
-        };
-      }
-    }
+    for (const claim of this.claimTexts) {}
 
     // Pass 2: partial containment (word-overlap heuristic — preserved for backward compat)
killedBy: AllowedClaimsRegistry matchText exact match should return exact match with confidence 1.0 for identical text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "exact"
Received: "partial"

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:192:59
 
     // Pass 1: exact match (normalised)
     for (const claim of this.claimTexts) {
-      if (claim.text.toLowerCase().trim() === normalised) {
-        return {
-          matched: true,
-          claimId: claim.id,
-          confidence: 1.0,
-          requiredDisclaimerId: claim.requiredDisclaimerId ?? null,
-          matchType: "exact",
-        };
-      }
+      if (claim.text.toLowerCase().trim() === normalised) {}
     }
 
killedBy: ClaimsCheck exact match should allow text that exactly matches an approved claim
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "rewrite"

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:192:11
 
     // Pass 1: exact match (normalised)
     for (const claim of this.claimTexts) {
-      if (claim.text.toLowerCase().trim() === normalised) {
+      if (false) {
         return {
           matched: true,
killedBy: AllowedClaimsRegistry matchText exact match should return exact match with confidence 1.0 for identical text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "exact"
Received: "partial"

[Killed] ObjectLiteral
src/insurance/allowed_claims_registry.ts:193:16
     // Pass 1: exact match (normalised)
     for (const claim of this.claimTexts) {
       if (claim.text.toLowerCase().trim() === normalised) {
-        return {
-          matched: true,
-          claimId: claim.id,
-          confidence: 1.0,
-          requiredDisclaimerId: claim.requiredDisclaimerId ?? null,
-          matchType: "exact",
-        };
+        return {};
       }
     }
killedBy: AllowedClaimsRegistry matchText exact match should return exact match with confidence 1.0 for identical text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BooleanLiteral
src/insurance/allowed_claims_registry.ts:194:20
     for (const claim of this.claimTexts) {
       if (claim.text.toLowerCase().trim() === normalised) {
         return {
-          matched: true,
+          matched: false,
           claimId: claim.id,
           confidence: 1.0,
killedBy: AllowedClaimsRegistry matchText exact match should return exact match with confidence 1.0 for identical text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] LogicalOperator
src/insurance/allowed_claims_registry.ts:197:33
           matched: true,
           claimId: claim.id,
           confidence: 1.0,
-          requiredDisclaimerId: claim.requiredDisclaimerId ?? null,
+          requiredDisclaimerId: claim.requiredDisclaimerId && null,
           matchType: "exact",
         };
killedBy: AllowedClaimsRegistry matchText exact match should return requiredDisclaimerId on exact match when present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "DISC-001"
Received: null

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:207:42
     let bestMatch: ApprovedClaim | null = null;
     let bestScore = 0;
 
-    for (const claim of this.claimTexts) {
-      const claimLower = claim.text.toLowerCase();
-      const proposedWords = new Set(normalised.split(/\s+/));
-      const claimWords = claimLower.split(/\s+/);
-      const overlapCount = claimWords.filter((w) =>
-        proposedWords.has(w),
-      ).length;
-      const score = claimWords.length > 0 ? overlapCount / claimWords.length : 0;
-
-      if (score > bestScore) {
-        bestScore = score;
-        bestMatch = claim;
-      }
-    }
+    for (const claim of this.claimTexts) {}
 
     if (bestMatch && bestScore >= (this.config.partialMatchThreshold ?? 0.6)) {
killedBy: ClaimsCheck partial match should rewrite text that partially matches an approved claim
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] MethodExpression
src/insurance/allowed_claims_registry.ts:208:26
     let bestScore = 0;
 
     for (const claim of this.claimTexts) {
-      const claimLower = claim.text.toLowerCase();
+      const claimLower = claim.text.toUpperCase();
       const proposedWords = new Set(normalised.split(/\s+/));
       const claimWords = claimLower.split(/\s+/);
killedBy: AllowedClaimsRegistry matchText partial match should return partial match when word overlap exceeds threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] Regex
src/insurance/allowed_claims_registry.ts:209:54
 
     for (const claim of this.claimTexts) {
       const claimLower = claim.text.toLowerCase();
-      const proposedWords = new Set(normalised.split(/\s+/));
+      const proposedWords = new Set(normalised.split(/\s/));
       const claimWords = claimLower.split(/\s+/);
       const overlapCount = claimWords.filter((w) =>

[Killed] MethodExpression
src/insurance/allowed_claims_registry.ts:211:28
       const claimLower = claim.text.toLowerCase();
       const proposedWords = new Set(normalised.split(/\s+/));
       const claimWords = claimLower.split(/\s+/);
-      const overlapCount = claimWords.filter((w) =>
-        proposedWords.has(w),
-      ).length;
+      const overlapCount = claimWords.length;
       const score = claimWords.length > 0 ? overlapCount / claimWords.length : 0;
 
killedBy: ClaimsCheck no match (unverified claim) should flag unverified claim when registry is non-empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "rewrite"

[Killed] ArrowFunction
src/insurance/allowed_claims_registry.ts:211:46
       const claimLower = claim.text.toLowerCase();
       const proposedWords = new Set(normalised.split(/\s+/));
       const claimWords = claimLower.split(/\s+/);
-      const overlapCount = claimWords.filter((w) =>
-        proposedWords.has(w),
+      const overlapCount = claimWords.filter(() => undefined,
       ).length;
       const score = claimWords.length > 0 ? overlapCount / claimWords.length : 0;
killedBy: ClaimsCheck partial match should rewrite text that partially matches an approved claim
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:214:21
       const overlapCount = claimWords.filter((w) =>
         proposedWords.has(w),
       ).length;
-      const score = claimWords.length > 0 ? overlapCount / claimWords.length : 0;
+      const score = claimWords.length <= 0 ? overlapCount / claimWords.length : 0;
 
       if (score > bestScore) {
killedBy: ClaimsCheck partial match should rewrite text that partially matches an approved claim
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:214:21
       const overlapCount = claimWords.filter((w) =>
         proposedWords.has(w),
       ).length;
-      const score = claimWords.length > 0 ? overlapCount / claimWords.length : 0;
+      const score = false ? overlapCount / claimWords.length : 0;
 
       if (score > bestScore) {
killedBy: ClaimsCheck partial match should rewrite text that partially matches an approved claim
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:216:11
       ).length;
       const score = claimWords.length > 0 ? overlapCount / claimWords.length : 0;
 
-      if (score > bestScore) {
+      if (score <= bestScore) {
         bestScore = score;
         bestMatch = claim;
killedBy: ClaimsCheck partial match should rewrite text that partially matches an approved claim
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:216:11
       ).length;
       const score = claimWords.length > 0 ? overlapCount / claimWords.length : 0;
 
-      if (score > bestScore) {
+      if (false) {
         bestScore = score;
         bestMatch = claim;
killedBy: AllowedClaimsRegistry matchText partial match should return partial match when word overlap exceeds threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:222:9
       }
     }
 
-    if (bestMatch && bestScore >= (this.config.partialMatchThreshold ?? 0.6)) {
+    if (true) {
       return {
         matched: true,
killedBy: ClaimsCheck no match (unverified claim) should flag unverified claim when registry is non-empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "rewrite"
