[Killed] LogicalOperator
src/insurance/allowed_claims_registry.ts:222:36
       }
     }
 
-    if (bestMatch && bestScore >= (this.config.partialMatchThreshold ?? 0.6)) {
+    if (bestMatch && bestScore >= (this.config.partialMatchThreshold && 0.6)) {
       return {
         matched: true,
killedBy: AllowedClaimsRegistry matchText partial match should return partial match when word overlap exceeds threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ObjectLiteral
src/insurance/allowed_claims_registry.ts:223:14
     }
 
     if (bestMatch && bestScore >= (this.config.partialMatchThreshold ?? 0.6)) {
-      return {
-        matched: true,
-        claimId: bestMatch.id,
-        confidence: bestScore,
-        requiredDisclaimerId: bestMatch.requiredDisclaimerId ?? null,
-        matchType: "partial",
-      };
+      return {};
     }
 
killedBy: ClaimsCheck partial match should rewrite text that partially matches an approved claim
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] LogicalOperator
src/insurance/allowed_claims_registry.ts:227:31
         matched: true,
         claimId: bestMatch.id,
         confidence: bestScore,
-        requiredDisclaimerId: bestMatch.requiredDisclaimerId ?? null,
+        requiredDisclaimerId: bestMatch.requiredDisclaimerId && null,
         matchType: "partial",
       };
killedBy: ClaimsCheck partial match should include requiredDisclaimerId on partial match when present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "DISC-001"
Received: undefined

[Killed] BooleanLiteral
src/insurance/allowed_claims_registry.ts:233:16
     }
 
     return {
-      matched: false,
+      matched: true,
       claimId: null,
       confidence: bestScore,
killedBy: AllowedClaimsRegistry matchText partial match should not match when word overlap is below threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] StringLiteral
src/insurance/allowed_claims_registry.ts:237:18
       claimId: null,
       confidence: bestScore,
       requiredDisclaimerId: null,
-      matchType: "none",
+      matchType: "",
     };
   }
killedBy: AllowedClaimsRegistry matchText partial match should not match when word overlap is below threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "none"
Received: ""

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:248:52
    * Synchronous. Used by OpaClaimsCheck (via the synchronous PolicyCheck.evaluate()
    * call chain). Does NOT affect matchText() semantics.
    */
-  getSimilarityScore(proposedText: string): number {
-    if (this.claimTexts.length === 0) return 0;
-    const results = this.vectorStore.search(proposedText, 1);
-    return results.length > 0 && results[0] ? results[0].score : 0;
-  }
+  getSimilarityScore(proposedText: string): number {}
 
   /**
killedBy: Full Pipeline E2E Smoke Test (N-12 + N-13 + N-14) Alpha tenant — OPA claims allow path (medical) exact registered claim → allow decision
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "refuse"

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:249:9
    * call chain). Does NOT affect matchText() semantics.
    */
   getSimilarityScore(proposedText: string): number {
-    if (this.claimTexts.length === 0) return 0;
+    if (true) return 0;
     const results = this.vectorStore.search(proposedText, 1);
     return results.length > 0 && results[0] ? results[0].score : 0;
killedBy: Full Pipeline E2E Smoke Test (N-12 + N-13 + N-14) Alpha tenant — OPA claims allow path (medical) exact registered claim → allow decision
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "refuse"

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:249:9
    * call chain). Does NOT affect matchText() semantics.
    */
   getSimilarityScore(proposedText: string): number {
-    if (this.claimTexts.length === 0) return 0;
+    if (this.claimTexts.length !== 0) return 0;
     const results = this.vectorStore.search(proposedText, 1);
     return results.length > 0 && results[0] ? results[0].score : 0;
killedBy: Full Pipeline E2E Smoke Test (N-12 + N-13 + N-14) Alpha tenant — OPA claims allow path (medical) exact registered claim → allow decision
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "refuse"

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:251:12
   getSimilarityScore(proposedText: string): number {
     if (this.claimTexts.length === 0) return 0;
     const results = this.vectorStore.search(proposedText, 1);
-    return results.length > 0 && results[0] ? results[0].score : 0;
+    return results.length <= 0 && results[0] ? results[0].score : 0;
   }
 
killedBy: Full Pipeline E2E Smoke Test (N-12 + N-13 + N-14) Alpha tenant — OPA claims allow path (medical) exact registered claim → allow decision
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "refuse"

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:251:12
   getSimilarityScore(proposedText: string): number {
     if (this.claimTexts.length === 0) return 0;
     const results = this.vectorStore.search(proposedText, 1);
-    return results.length > 0 && results[0] ? results[0].score : 0;
+    return false ? results[0].score : 0;
   }
 
killedBy: Full Pipeline E2E Smoke Test (N-12 + N-13 + N-14) Alpha tenant — OPA claims allow path (medical) exact registered claim → allow decision
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "refuse"

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:265:9
    * (see scripts/download-model.sh). Dynamic import allows Jest to mock cleanly.
    */
   async initialize(): Promise<void> {
-    if (this.embeddingInitialized) return;
+    if (true) return;
 
     // Dynamic import so Jest can mock the module cleanly (mirrors OpaEvaluator pattern).
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:265:9
    * (see scripts/download-model.sh). Dynamic import allows Jest to mock cleanly.
    */
   async initialize(): Promise<void> {
-    if (this.embeddingInitialized) return;
+    if (false) return;
 
     // Dynamic import so Jest can mock the module cleanly (mirrors OpaEvaluator pattern).
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should not call pipeline again on second initialize() call (idempotent)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Survived] LogicalOperator
src/insurance/allowed_claims_registry.ts:276:21
       ) => Promise<FeaturePipelineFn>;
     };
 
-    const modelId = process.env.EMBEDDING_MODEL ?? "Xenova/all-MiniLM-L6-v2";
+    const modelId = process.env.EMBEDDING_MODEL && "Xenova/all-MiniLM-L6-v2";
     this.embeddingPipeline = await hf.pipeline("feature-extraction", modelId, {
       dtype: "fp32",

[Survived] StringLiteral
src/insurance/allowed_claims_registry.ts:276:52
       ) => Promise<FeaturePipelineFn>;
     };
 
-    const modelId = process.env.EMBEDDING_MODEL ?? "Xenova/all-MiniLM-L6-v2";
+    const modelId = process.env.EMBEDDING_MODEL ?? "";
     this.embeddingPipeline = await hf.pipeline("feature-extraction", modelId, {
       dtype: "fp32",

[Killed] StringLiteral
src/insurance/allowed_claims_registry.ts:277:48
     };
 
     const modelId = process.env.EMBEDDING_MODEL ?? "Xenova/all-MiniLM-L6-v2";
-    this.embeddingPipeline = await hf.pipeline("feature-extraction", modelId, {
+    this.embeddingPipeline = await hf.pipeline("", modelId, {
       dtype: "fp32",
     });
killedBy: OpaModeratorCheck — ControlEngine integration ControlEngine.initialize() calls OpaEvaluator.initialize() when not initialized

[Survived] ObjectLiteral
src/insurance/allowed_claims_registry.ts:277:79
     };
 
     const modelId = process.env.EMBEDDING_MODEL ?? "Xenova/all-MiniLM-L6-v2";
-    this.embeddingPipeline = await hf.pipeline("feature-extraction", modelId, {
-      dtype: "fp32",
-    });
+    this.embeddingPipeline = await hf.pipeline("feature-extraction", modelId, {});
 
     if (this.claimTexts.length > 0) {

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:281:37
       dtype: "fp32",
     });
 
-    if (this.claimTexts.length > 0) {
-      const output = await this.embeddingPipeline(
-        this.claimTexts.map((c) => c.text),
-        { pooling: "mean", normalize: true },
-      );
-      const embDim = output.dims[1] ?? 0;
-      this.claimEmbeddings = this.claimTexts.map((_, i) => {
-        const start = i * embDim;
-        // output.data may be a TypedArray or plain Array; slice works on both.
-        return new Float32Array(
-          Array.from(output.data).slice(start, start + embDim) as number[],
-        );
-      });
-    }
+    if (this.claimTexts.length > 0) {}
 
     this.embeddingInitialized = true;
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:281:9
       dtype: "fp32",
     });
 
-    if (this.claimTexts.length > 0) {
+    if (this.claimTexts.length >= 0) {
       const output = await this.embeddingPipeline(
         this.claimTexts.map((c) => c.text),
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should complete initialize() without computing embeddings when registry is empty
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: [], {"normalize": true, "pooling": "mean"}

[Killed] ArrowFunction
src/insurance/allowed_claims_registry.ts:283:29
 
     if (this.claimTexts.length > 0) {
       const output = await this.embeddingPipeline(
-        this.claimTexts.map((c) => c.text),
+        this.claimTexts.map(() => undefined),
         { pooling: "mean", normalize: true },
       );
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0.8
Received:   0.7071067811865476

[Survived] BooleanLiteral
src/insurance/allowed_claims_registry.ts:284:39
     if (this.claimTexts.length > 0) {
       const output = await this.embeddingPipeline(
         this.claimTexts.map((c) => c.text),
-        { pooling: "mean", normalize: true },
+        { pooling: "mean", normalize: false },
       );
       const embDim = output.dims[1] ?? 0;

[Killed] LogicalOperator
src/insurance/allowed_claims_registry.ts:286:22
         this.claimTexts.map((c) => c.text),
         { pooling: "mean", normalize: true },
       );
-      const embDim = output.dims[1] ?? 0;
+      const embDim = output.dims[1] && 0;
       this.claimEmbeddings = this.claimTexts.map((_, i) => {
         const start = i * embDim;
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:287:60
         { pooling: "mean", normalize: true },
       );
       const embDim = output.dims[1] ?? 0;
-      this.claimEmbeddings = this.claimTexts.map((_, i) => {
-        const start = i * embDim;
-        // output.data may be a TypedArray or plain Array; slice works on both.
-        return new Float32Array(
-          Array.from(output.data).slice(start, start + embDim) as number[],
-        );
-      });
+      this.claimEmbeddings = this.claimTexts.map((_, i) => {});
     }
 
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Survived] ArithmeticOperator
src/insurance/allowed_claims_registry.ts:288:23
       );
       const embDim = output.dims[1] ?? 0;
       this.claimEmbeddings = this.claimTexts.map((_, i) => {
-        const start = i * embDim;
+        const start = i / embDim;
         // output.data may be a TypedArray or plain Array; slice works on both.
         return new Float32Array(

[Killed] BooleanLiteral
src/insurance/allowed_claims_registry.ts:296:33
       });
     }
 
-    this.embeddingInitialized = true;
+    this.embeddingInitialized = false;
   }
 
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:300:41
   }
 
   /** True after initialize() has completed successfully. */
-  get isEmbeddingInitialized(): boolean {
-    return this.embeddingInitialized;
-  }
+  get isEmbeddingInitialized(): boolean {}
 
   /**
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:315:76
    * Note: wiring this into OpaClaimsCheck requires PolicyCheck.evaluate() to
    * become async — tracked as N-15 Phase 2.
    */
-  async getEmbeddingSimilarityScore(proposedText: string): Promise<number> {
-    if (
-      !this.embeddingInitialized ||
-      !this.embeddingPipeline ||
-      this.claimEmbeddings.length === 0
-    ) {
-      return this.getSimilarityScore(proposedText);
-    }
-
-    const output = await this.embeddingPipeline(proposedText, {
-      pooling: "mean",
-      normalize: true,
-    });
-    const embDim = output.dims[1] ?? 0;
-    const queryVec = new Float32Array(
-      Array.from(output.data).slice(0, embDim) as number[],
-    );
-
-    let maxScore = 0;
-    for (const claimVec of this.claimEmbeddings) {
-      const score = cosineSimilarity(queryVec, claimVec);
-      if (score > maxScore) maxScore = score;
-    }
-    return Math.max(0, Math.min(1, maxScore));
-  }
+  async getEmbeddingSimilarityScore(proposedText: string): Promise<number> {}
 
   /**
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should return TF-IDF score when not initialized (fallback)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BooleanLiteral
src/insurance/allowed_claims_registry.ts:317:7
    */
   async getEmbeddingSimilarityScore(proposedText: string): Promise<number> {
     if (
-      !this.embeddingInitialized ||
+      this.embeddingInitialized ||
       !this.embeddingPipeline ||
       this.claimEmbeddings.length === 0
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:317:7
    */
   async getEmbeddingSimilarityScore(proposedText: string): Promise<number> {
     if (
-      !this.embeddingInitialized ||
-      !this.embeddingPipeline ||
-      this.claimEmbeddings.length === 0
+      false
     ) {
       return this.getSimilarityScore(proposedText);
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should return TF-IDF score when not initialized (fallback)
statusReason: TypeError: this.embeddingPipeline is not a function

[Killed] BooleanLiteral
src/insurance/allowed_claims_registry.ts:318:7
   async getEmbeddingSimilarityScore(proposedText: string): Promise<number> {
     if (
       !this.embeddingInitialized ||
-      !this.embeddingPipeline ||
+      this.embeddingPipeline ||
       this.claimEmbeddings.length === 0
     ) {
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:319:7
     if (
       !this.embeddingInitialized ||
       !this.embeddingPipeline ||
-      this.claimEmbeddings.length === 0
+      this.claimEmbeddings.length !== 0
     ) {
       return this.getSimilarityScore(proposedText);
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Survived] ConditionalExpression
src/insurance/allowed_claims_registry.ts:319:7
     if (
       !this.embeddingInitialized ||
       !this.embeddingPipeline ||
-      this.claimEmbeddings.length === 0
+      false
     ) {
       return this.getSimilarityScore(proposedText);

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:320:7
       !this.embeddingInitialized ||
       !this.embeddingPipeline ||
       this.claimEmbeddings.length === 0
-    ) {
-      return this.getSimilarityScore(proposedText);
-    }
+    ) {}
 
     const output = await this.embeddingPipeline(proposedText, {
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should return TF-IDF score when not initialized (fallback)
statusReason: TypeError: this.embeddingPipeline is not a function

[Survived] BooleanLiteral
src/insurance/allowed_claims_registry.ts:326:18
 
     const output = await this.embeddingPipeline(proposedText, {
       pooling: "mean",
-      normalize: true,
+      normalize: false,
     });
     const embDim = output.dims[1] ?? 0;

[Killed] LogicalOperator
src/insurance/allowed_claims_registry.ts:328:20
       pooling: "mean",
       normalize: true,
     });
-    const embDim = output.dims[1] ?? 0;
+    const embDim = output.dims[1] && 0;
     const queryVec = new Float32Array(
       Array.from(output.data).slice(0, embDim) as number[],
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:334:50
     );
 
     let maxScore = 0;
-    for (const claimVec of this.claimEmbeddings) {
-      const score = cosineSimilarity(queryVec, claimVec);
-      if (score > maxScore) maxScore = score;
-    }
+    for (const claimVec of this.claimEmbeddings) {}
     return Math.max(0, Math.min(1, maxScore));
   }
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:336:11
     let maxScore = 0;
     for (const claimVec of this.claimEmbeddings) {
       const score = cosineSimilarity(queryVec, claimVec);
-      if (score > maxScore) maxScore = score;
+      if (false) maxScore = score;
     }
     return Math.max(0, Math.min(1, maxScore));
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:336:11
     let maxScore = 0;
     for (const claimVec of this.claimEmbeddings) {
       const score = cosineSimilarity(queryVec, claimVec);
-      if (score > maxScore) maxScore = score;
+      if (true) maxScore = score;
     }
     return Math.max(0, Math.min(1, maxScore));
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should return the max score across multiple claims
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0.8
Received:   0

[Killed] MethodExpression
src/insurance/allowed_claims_registry.ts:338:12
       const score = cosineSimilarity(queryVec, claimVec);
       if (score > maxScore) maxScore = score;
     }
-    return Math.max(0, Math.min(1, maxScore));
+    return Math.min(0, Math.min(1, maxScore));
   }
 
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] MethodExpression
src/insurance/allowed_claims_registry.ts:338:24
       const score = cosineSimilarity(queryVec, claimVec);
       if (score > maxScore) maxScore = score;
     }
-    return Math.max(0, Math.min(1, maxScore));
+    return Math.max(0, Math.max(1, maxScore));
   }
 
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically unrelated text near zero
statusReason: Error: expect(received).toBeLessThan(expected)

Expected: < 0.1
Received:   1

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:344:35
   /**
    * Return all registered claims (for diagnostics / audit).
    */
-  getAllClaims(): ApprovedClaim[] {
-    return [...this.claimTexts];
-  }
+  getAllClaims(): ApprovedClaim[] {}
 
   /**
killedBy: AllowedClaimsRegistry constructor should create an empty registry with no config
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:351:37
   /**
    * Return all disallowed claim patterns.
    */
-  getDisallowedPatterns(): string[] {
-    return [...this.disallowedPatterns];
-  }
+  getDisallowedPatterns(): string[] {}
 
   /**
killedBy: AllowedClaimsRegistry constructor should create an empty registry with no config
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: []
Received: undefined

[Killed] ArrayDeclaration
src/insurance/allowed_claims_registry.ts:352:12
    * Return all disallowed claim patterns.
    */
   getDisallowedPatterns(): string[] {
-    return [...this.disallowedPatterns];
+    return [];
   }
 
killedBy: AllowedClaimsRegistry constructor should create a registry with disallowed patterns
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "guaranteed cure",
-   "100% safe",

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:358:22
   /**
    * Number of registered claims.
    */
-  get size(): number {
-    return this.claims.size;
-  }
+  get size(): number {}
 }
 
killedBy: AllowedClaimsRegistry constructor should create an empty registry with no config
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:364:69
 }
 
 /** Cosine similarity between two equal-length vectors. Returns 0 for zero vectors. */
-function cosineSimilarity(a: Float32Array, b: Float32Array): number {
-  if (a.length === 0 || a.length !== b.length) return 0;
-  let dot = 0;
-  let normA = 0;
-  let normB = 0;
-  for (let i = 0; i < a.length; i++) {
-    dot += a[i] * b[i];
-    normA += a[i] * a[i];
-    normB += b[i] * b[i];
-  }
-  if (normA === 0 || normB === 0) return 0;
-  return dot / (Math.sqrt(normA) * Math.sqrt(normB));
-}
+function cosineSimilarity(a: Float32Array, b: Float32Array): number {}
 
 function loadClaimsCatalog(
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:365:7
 
 /** Cosine similarity between two equal-length vectors. Returns 0 for zero vectors. */
 function cosineSimilarity(a: Float32Array, b: Float32Array): number {
-  if (a.length === 0 || a.length !== b.length) return 0;
+  if (a.length !== 0 || a.length !== b.length) return 0;
   let dot = 0;
   let normA = 0;
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:365:7
 
 /** Cosine similarity between two equal-length vectors. Returns 0 for zero vectors. */
 function cosineSimilarity(a: Float32Array, b: Float32Array): number {
-  if (a.length === 0 || a.length !== b.length) return 0;
+  if (true) return 0;
   let dot = 0;
   let normA = 0;
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:369:19
   let dot = 0;
   let normA = 0;
   let normB = 0;
-  for (let i = 0; i < a.length; i++) {
+  for (let i = 0; i >= a.length; i++) {
     dot += a[i] * b[i];
     normA += a[i] * a[i];
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:369:19
   let dot = 0;
   let normA = 0;
   let normB = 0;
-  for (let i = 0; i < a.length; i++) {
+  for (let i = 0; false; i++) {
     dot += a[i] * b[i];
     normA += a[i] * a[i];
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ArithmeticOperator
src/insurance/allowed_claims_registry.ts:370:12
   let normA = 0;
   let normB = 0;
   for (let i = 0; i < a.length; i++) {
-    dot += a[i] * b[i];
+    dot += a[i] / b[i];
     normA += a[i] * a[i];
     normB += b[i] * b[i];
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] AssignmentOperator
src/insurance/allowed_claims_registry.ts:370:5
   let normA = 0;
   let normB = 0;
   for (let i = 0; i < a.length; i++) {
-    dot += a[i] * b[i];
+    dot -= a[i] * b[i];
     normA += a[i] * a[i];
     normB += b[i] * b[i];
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] AssignmentOperator
src/insurance/allowed_claims_registry.ts:371:5
   let normB = 0;
   for (let i = 0; i < a.length; i++) {
     dot += a[i] * b[i];
-    normA += a[i] * a[i];
+    normA -= a[i] * a[i];
     normB += b[i] * b[i];
   }
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ArithmeticOperator
src/insurance/allowed_claims_registry.ts:371:14
   let normB = 0;
   for (let i = 0; i < a.length; i++) {
     dot += a[i] * b[i];
-    normA += a[i] * a[i];
+    normA += a[i] / a[i];
     normB += b[i] * b[i];
   }
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ArithmeticOperator
src/insurance/allowed_claims_registry.ts:372:14
   for (let i = 0; i < a.length; i++) {
     dot += a[i] * b[i];
     normA += a[i] * a[i];
-    normB += b[i] * b[i];
+    normB += b[i] / b[i];
   }
   if (normA === 0 || normB === 0) return 0;
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] AssignmentOperator
src/insurance/allowed_claims_registry.ts:372:5
   for (let i = 0; i < a.length; i++) {
     dot += a[i] * b[i];
     normA += a[i] * a[i];
-    normB += b[i] * b[i];
+    normB -= b[i] * b[i];
   }
   if (normA === 0 || normB === 0) return 0;
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0
