[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:374:7
     normA += a[i] * a[i];
     normB += b[i] * b[i];
   }
-  if (normA === 0 || normB === 0) return 0;
+  if (normA !== 0 || normB === 0) return 0;
   return dot / (Math.sqrt(normA) * Math.sqrt(normB));
 }
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:374:7
     normA += a[i] * a[i];
     normB += b[i] * b[i];
   }
-  if (normA === 0 || normB === 0) return 0;
+  if (true) return 0;
   return dot / (Math.sqrt(normA) * Math.sqrt(normB));
 }
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Survived] ArithmeticOperator
src/insurance/allowed_claims_registry.ts:375:10
     normB += b[i] * b[i];
   }
   if (normA === 0 || normB === 0) return 0;
-  return dot / (Math.sqrt(normA) * Math.sqrt(normB));
+  return dot * (Math.sqrt(normA) * Math.sqrt(normB));
 }
 

[Survived] ArithmeticOperator
src/insurance/allowed_claims_registry.ts:375:17
     normB += b[i] * b[i];
   }
   if (normA === 0 || normB === 0) return 0;
-  return dot / (Math.sqrt(normA) * Math.sqrt(normB));
+  return dot / (Math.sqrt(normA) / Math.sqrt(normB));
 }
 

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:382:7
   config: AllowedClaimsRegistryConfig,
 ): { claims: ApprovedClaim[]; disallowedPatterns: string[] } {
   const catalogPath = resolveClaimsPath(config);
-  if (!catalogPath) {
+  if (true) {
     return { claims: [], disallowedPatterns: [] };
   }
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BooleanLiteral
src/insurance/allowed_claims_registry.ts:382:7
   config: AllowedClaimsRegistryConfig,
 ): { claims: ApprovedClaim[]; disallowedPatterns: string[] } {
   const catalogPath = resolveClaimsPath(config);
-  if (!catalogPath) {
+  if (catalogPath) {
     return { claims: [], disallowedPatterns: [] };
   }
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:386:7
     return { claims: [], disallowedPatterns: [] };
   }
 
-  try {
-    const raw = readFileSync(catalogPath, "utf-8");
-    const parsed = JSON.parse(raw) as AllowedClaimsCatalog;
-    const rawClaims = Array.isArray(parsed.allowed_claims)
-      ? parsed.allowed_claims
-      : Array.isArray(parsed.claims)
-        ? parsed.claims
-        : [];
-    const disallowedPatterns = toStringArray(parsed.disallowed_patterns);
-
-    const claims: ApprovedClaim[] = [];
-    for (const entry of rawClaims) {
-      const claim = normalizeClaimEntry(entry);
-      if (claim) {
-        claims.push(claim);
-      }
-    }
-
-    return { claims, disallowedPatterns };
-  } catch (error) {
+  try {} catch (error) {
     console.error("[AllowedClaimsRegistry] Failed to load claims:", error);
     return { claims: [], disallowedPatterns: [] };
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: TypeError: Cannot read properties of undefined (reading 'claims')

[Survived] StringLiteral
src/insurance/allowed_claims_registry.ts:387:43
   }
 
   try {
-    const raw = readFileSync(catalogPath, "utf-8");
+    const raw = readFileSync(catalogPath, "");
     const parsed = JSON.parse(raw) as AllowedClaimsCatalog;
     const rawClaims = Array.isArray(parsed.allowed_claims)

[Killed] ArrayDeclaration
src/insurance/allowed_claims_registry.ts:396:37
         : [];
     const disallowedPatterns = toStringArray(parsed.disallowed_patterns);
 
-    const claims: ApprovedClaim[] = [];
+    const claims: ApprovedClaim[] = ["Stryker was here"];
     for (const entry of rawClaims) {
       const claim = normalizeClaimEntry(entry);
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:397:36
     const disallowedPatterns = toStringArray(parsed.disallowed_patterns);
 
     const claims: ApprovedClaim[] = [];
-    for (const entry of rawClaims) {
-      const claim = normalizeClaimEntry(entry);
-      if (claim) {
-        claims.push(claim);
-      }
-    }
+    for (const entry of rawClaims) {}
 
     return { claims, disallowedPatterns };
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:399:11
     const claims: ApprovedClaim[] = [];
     for (const entry of rawClaims) {
       const claim = normalizeClaimEntry(entry);
-      if (claim) {
+      if (false) {
         claims.push(claim);
       }
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:399:18
     const claims: ApprovedClaim[] = [];
     for (const entry of rawClaims) {
       const claim = normalizeClaimEntry(entry);
-      if (claim) {
-        claims.push(claim);
-      }
+      if (claim) {}
     }
 
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ObjectLiteral
src/insurance/allowed_claims_registry.ts:404:12
       }
     }
 
-    return { claims, disallowedPatterns };
+    return {};
   } catch (error) {
     console.error("[AllowedClaimsRegistry] Failed to load claims:", error);
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:405:19
     }
 
     return { claims, disallowedPatterns };
-  } catch (error) {
-    console.error("[AllowedClaimsRegistry] Failed to load claims:", error);
-    return { claims: [], disallowedPatterns: [] };
-  }
+  } catch (error) {}
 }
 
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true returns empty registry on malformed JSON (error path)
statusReason: TypeError: Cannot read properties of undefined (reading 'claims')

[Killed] ArrayDeclaration
src/insurance/allowed_claims_registry.ts:407:22
     return { claims, disallowedPatterns };
   } catch (error) {
     console.error("[AllowedClaimsRegistry] Failed to load claims:", error);
-    return { claims: [], disallowedPatterns: [] };
+    return { claims: ["Stryker was here"], disallowedPatterns: [] };
   }
 }
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true returns empty registry on malformed JSON (error path)
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:416:7
 ): string | null {
   const candidates: string[] = [];
 
-  if (config.sourcePath) {
+  if (false) {
     candidates.push(config.sourcePath);
   }
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:416:26
 ): string | null {
   const candidates: string[] = [];
 
-  if (config.sourcePath) {
-    candidates.push(config.sourcePath);
-  }
+  if (config.sourcePath) {}
 
   const knowledgeDir = config.knowledgeDir || process.env.KNOWLEDGE_DIR;
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] ConditionalExpression
src/insurance/allowed_claims_registry.ts:420:24
     candidates.push(config.sourcePath);
   }
 
-  const knowledgeDir = config.knowledgeDir || process.env.KNOWLEDGE_DIR;
+  const knowledgeDir = false;
   if (knowledgeDir) {
     candidates.push(resolve(knowledgeDir, "allowed_claims.json"));

[Survived] LogicalOperator
src/insurance/allowed_claims_registry.ts:420:24
     candidates.push(config.sourcePath);
   }
 
-  const knowledgeDir = config.knowledgeDir || process.env.KNOWLEDGE_DIR;
+  const knowledgeDir = config.knowledgeDir && process.env.KNOWLEDGE_DIR;
   if (knowledgeDir) {
     candidates.push(resolve(knowledgeDir, "allowed_claims.json"));

[NoCoverage] BlockStatement
src/insurance/allowed_claims_registry.ts:421:21
   }
 
   const knowledgeDir = config.knowledgeDir || process.env.KNOWLEDGE_DIR;
-  if (knowledgeDir) {
-    candidates.push(resolve(knowledgeDir, "allowed_claims.json"));
-  }
+  if (knowledgeDir) {}
 
   const cwd = process.cwd();

[Survived] ConditionalExpression
src/insurance/allowed_claims_registry.ts:421:7
   }
 
   const knowledgeDir = config.knowledgeDir || process.env.KNOWLEDGE_DIR;
-  if (knowledgeDir) {
+  if (false) {
     candidates.push(resolve(knowledgeDir, "allowed_claims.json"));
   }

[Survived] StringLiteral
src/insurance/allowed_claims_registry.ts:426:45
   }
 
   const cwd = process.cwd();
-  candidates.push(resolve(cwd, "knowledge", "allowed_claims.json"));
+  candidates.push(resolve(cwd, "knowledge", ""));
   candidates.push(resolve(cwd, "..", "knowledge", "allowed_claims.json"));
 

[Survived] StringLiteral
src/insurance/allowed_claims_registry.ts:427:51
 
   const cwd = process.cwd();
   candidates.push(resolve(cwd, "knowledge", "allowed_claims.json"));
-  candidates.push(resolve(cwd, "..", "knowledge", "allowed_claims.json"));
+  candidates.push(resolve(cwd, "..", "knowledge", ""));
 
   for (const candidate of candidates) {

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:429:39
   candidates.push(resolve(cwd, "knowledge", "allowed_claims.json"));
   candidates.push(resolve(cwd, "..", "knowledge", "allowed_claims.json"));
 
-  for (const candidate of candidates) {
-    if (candidate && existsSync(candidate)) {
-      return candidate;
-    }
-  }
+  for (const candidate of candidates) {}
 
   console.warn(
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:430:9
   candidates.push(resolve(cwd, "..", "knowledge", "allowed_claims.json"));
 
   for (const candidate of candidates) {
-    if (candidate && existsSync(candidate)) {
+    if (false) {
       return candidate;
     }
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:430:45
   candidates.push(resolve(cwd, "..", "knowledge", "allowed_claims.json"));
 
   for (const candidate of candidates) {
-    if (candidate && existsSync(candidate)) {
-      return candidate;
-    }
+    if (candidate && existsSync(candidate)) {}
   }
 
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] StringLiteral
src/insurance/allowed_claims_registry.ts:437:7
 
   console.warn(
     `[AllowedClaimsRegistry] allowed_claims.json not found. Looked in: ${candidates.join(
-      ", ",
+      "",
     )}`,
   );

[Killed] BooleanLiteral
src/insurance/allowed_claims_registry.ts:445:7
 }
 
 function normalizeClaimEntry(entry: unknown): ApprovedClaim | null {
-  if (!entry || typeof entry !== "object") {
+  if (entry || typeof entry !== "object") {
     console.warn("[AllowedClaimsRegistry] Skipping invalid claim entry", entry);
     return null;
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:445:17
 }
 
 function normalizeClaimEntry(entry: unknown): ApprovedClaim | null {
-  if (!entry || typeof entry !== "object") {
+  if (!entry || typeof entry === "object") {
     console.warn("[AllowedClaimsRegistry] Skipping invalid claim entry", entry);
     return null;
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:452:5
 
   const record = entry as AllowedClaimsCatalogEntry;
   const id =
-    typeof record.id === "string" ? record.id.trim() : undefined;
+    typeof record.id !== "string" ? record.id.trim() : undefined;
   const textCandidate =
     typeof record.text === "string"
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:452:5
 
   const record = entry as AllowedClaimsCatalogEntry;
   const id =
-    typeof record.id === "string" ? record.id.trim() : undefined;
+    false ? record.id.trim() : undefined;
   const textCandidate =
     typeof record.text === "string"
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:454:5
   const id =
     typeof record.id === "string" ? record.id.trim() : undefined;
   const textCandidate =
-    typeof record.text === "string"
+    false
       ? record.text
       : typeof record.claim === "string"
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:454:5
   const id =
     typeof record.id === "string" ? record.id.trim() : undefined;
   const textCandidate =
-    typeof record.text === "string"
+    typeof record.text !== "string"
       ? record.text
       : typeof record.claim === "string"
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:456:9
   const textCandidate =
     typeof record.text === "string"
       ? record.text
-      : typeof record.claim === "string"
+      : false
         ? record.claim
         : undefined;
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true accepts claim entry with claim field instead of text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Uses claim field"
Received: undefined

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:456:9
   const textCandidate =
     typeof record.text === "string"
       ? record.text
-      : typeof record.claim === "string"
+      : typeof record.claim !== "string"
         ? record.claim
         : undefined;
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true accepts claim entry with claim field instead of text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Uses claim field"
Received: undefined

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:460:7
         ? record.claim
         : undefined;
 
-  if (!id || !textCandidate || textCandidate.trim().length === 0) {
+  if (false) {
     console.warn("[AllowedClaimsRegistry] Skipping invalid claim entry", entry);
     return null;
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true skips invalid entry missing id
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:460:7
         ? record.claim
         : undefined;
 
-  if (!id || !textCandidate || textCandidate.trim().length === 0) {
+  if (false || textCandidate.trim().length === 0) {
     console.warn("[AllowedClaimsRegistry] Skipping invalid claim entry", entry);
     return null;
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true skips invalid entry missing id
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Survived] StringLiteral
src/insurance/allowed_claims_registry.ts:461:18
         : undefined;
 
   if (!id || !textCandidate || textCandidate.trim().length === 0) {
-    console.warn("[AllowedClaimsRegistry] Skipping invalid claim entry", entry);
+    console.warn("", entry);
     return null;
   }

[Survived] LogicalOperator
src/insurance/allowed_claims_registry.ts:466:5
   }
 
   const disclaimerIds = toStringArray(
-    record.required_disclaimer_ids ?? record.disclaimer_ids,
+    record.required_disclaimer_ids && record.disclaimer_ids,
   );
   const requiredDisclaimerId =

[Survived] ConditionalExpression
src/insurance/allowed_claims_registry.ts:469:5
     record.required_disclaimer_ids ?? record.disclaimer_ids,
   );
   const requiredDisclaimerId =
-    typeof record.required_disclaimer_id === "string"
+    false
       ? record.required_disclaimer_id
       : disclaimerIds[0];

[Survived] EqualityOperator
src/insurance/allowed_claims_registry.ts:469:5
     record.required_disclaimer_ids ?? record.disclaimer_ids,
   );
   const requiredDisclaimerId =
-    typeof record.required_disclaimer_id === "string"
+    typeof record.required_disclaimer_id !== "string"
       ? record.required_disclaimer_id
       : disclaimerIds[0];

[Survived] EqualityOperator
src/insurance/allowed_claims_registry.ts:475:5
 
   const evidenceIds = toStringArray(record.evidence_ids);
   const approvedBy =
-    typeof record.approved_by === "string" ? record.approved_by : undefined;
+    typeof record.approved_by !== "string" ? record.approved_by : undefined;
   const source =
     typeof record.source === "string"

[Survived] ConditionalExpression
src/insurance/allowed_claims_registry.ts:475:5
 
   const evidenceIds = toStringArray(record.evidence_ids);
   const approvedBy =
-    typeof record.approved_by === "string" ? record.approved_by : undefined;
+    false ? record.approved_by : undefined;
   const source =
     typeof record.source === "string"

[Survived] EqualityOperator
src/insurance/allowed_claims_registry.ts:477:5
   const approvedBy =
     typeof record.approved_by === "string" ? record.approved_by : undefined;
   const source =
-    typeof record.source === "string"
+    typeof record.source !== "string"
       ? record.source
       : buildSource(evidenceIds, approvedBy);

[Survived] ConditionalExpression
src/insurance/allowed_claims_registry.ts:477:5
   const approvedBy =
     typeof record.approved_by === "string" ? record.approved_by : undefined;
   const source =
-    typeof record.source === "string"
+    false
       ? record.source
       : buildSource(evidenceIds, approvedBy);

[Survived] ConditionalExpression
src/insurance/allowed_claims_registry.ts:481:5
       ? record.source
       : buildSource(evidenceIds, approvedBy);
   const lastVerified =
-    typeof record.last_verified === "string"
+    false
       ? record.last_verified
       : typeof record.approved_date === "string"

[Survived] ConditionalExpression
src/insurance/allowed_claims_registry.ts:481:5
       ? record.source
       : buildSource(evidenceIds, approvedBy);
   const lastVerified =
-    typeof record.last_verified === "string"
+    true
       ? record.last_verified
       : typeof record.approved_date === "string"

[Survived] ConditionalExpression
src/insurance/allowed_claims_registry.ts:483:9
   const lastVerified =
     typeof record.last_verified === "string"
       ? record.last_verified
-      : typeof record.approved_date === "string"
+      : true
         ? record.approved_date
         : undefined;

[Survived] ConditionalExpression
src/insurance/allowed_claims_registry.ts:483:9
   const lastVerified =
     typeof record.last_verified === "string"
       ? record.last_verified
-      : typeof record.approved_date === "string"
+      : false
         ? record.approved_date
         : undefined;

[Survived] ConditionalExpression
src/insurance/allowed_claims_registry.ts:487:5
         ? record.approved_date
         : undefined;
   const category =
-    typeof record.category === "string" ? record.category : undefined;
+    true ? record.category : undefined;
 
   return {

[Survived] ConditionalExpression
src/insurance/allowed_claims_registry.ts:487:5
         ? record.approved_date
         : undefined;
   const category =
-    typeof record.category === "string" ? record.category : undefined;
+    false ? record.category : undefined;
 
   return {

[Survived] MethodExpression
src/insurance/allowed_claims_registry.ts:491:11
 
   return {
     id,
-    text: textCandidate.trim(),
+    text: textCandidate,
     source,
     category,

[Killed] OptionalChaining
src/insurance/allowed_claims_registry.ts:494:27
     text: textCandidate.trim(),
     source,
     category,
-    requiredDisclaimerId: requiredDisclaimerId?.trim() || undefined,
+    requiredDisclaimerId: requiredDisclaimerId.trim() || undefined,
     requiredDisclaimerIds: disclaimerIds,
     lastVerified,
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] LogicalOperator
src/insurance/allowed_claims_registry.ts:494:27
     text: textCandidate.trim(),
     source,
     category,
-    requiredDisclaimerId: requiredDisclaimerId?.trim() || undefined,
+    requiredDisclaimerId: requiredDisclaimerId?.trim() && undefined,
     requiredDisclaimerIds: disclaimerIds,
     lastVerified,

[Survived] ObjectLiteral
src/insurance/allowed_claims_registry.ts:497:15
     requiredDisclaimerId: requiredDisclaimerId?.trim() || undefined,
     requiredDisclaimerIds: disclaimerIds,
     lastVerified,
-    metadata: {
-      evidence_ids: evidenceIds,
-      approved_by: approvedBy,
-      approved_date: record.approved_date,
-    },
+    metadata: {},
   };
 }

[Survived] BlockStatement
src/insurance/allowed_claims_registry.ts:505:74
   };
 }
 
-function buildSource(evidenceIds: string[], approvedBy?: string): string {
-  const tokens = [...evidenceIds];
-  if (approvedBy && approvedBy.trim().length > 0) {
-    tokens.push(approvedBy.trim());
-  }
-  if (tokens.length === 0) {
-    return "allowed_claims.json";
-  }
-  return tokens.join(", ");
-}
+function buildSource(evidenceIds: string[], approvedBy?: string): string {}
 
 function toStringArray(value: unknown): string[] {

[Killed] LogicalOperator
src/insurance/allowed_claims_registry.ts:507:7
 
 function buildSource(evidenceIds: string[], approvedBy?: string): string {
   const tokens = [...evidenceIds];
-  if (approvedBy && approvedBy.trim().length > 0) {
+  if (approvedBy || approvedBy.trim().length > 0) {
     tokens.push(approvedBy.trim());
   }
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:507:7
 
 function buildSource(evidenceIds: string[], approvedBy?: string): string {
   const tokens = [...evidenceIds];
-  if (approvedBy && approvedBy.trim().length > 0) {
+  if (true) {
     tokens.push(approvedBy.trim());
   }
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[NoCoverage] MethodExpression
src/insurance/allowed_claims_registry.ts:508:17
 function buildSource(evidenceIds: string[], approvedBy?: string): string {
   const tokens = [...evidenceIds];
   if (approvedBy && approvedBy.trim().length > 0) {
-    tokens.push(approvedBy.trim());
+    tokens.push(approvedBy);
   }
   if (tokens.length === 0) {

[Survived] EqualityOperator
src/insurance/allowed_claims_registry.ts:510:7
   if (approvedBy && approvedBy.trim().length > 0) {
     tokens.push(approvedBy.trim());
   }
-  if (tokens.length === 0) {
+  if (tokens.length !== 0) {
     return "allowed_claims.json";
   }

[Survived] ConditionalExpression
src/insurance/allowed_claims_registry.ts:510:7
   if (approvedBy && approvedBy.trim().length > 0) {
     tokens.push(approvedBy.trim());
   }
-  if (tokens.length === 0) {
+  if (true) {
     return "allowed_claims.json";
   }

[NoCoverage] StringLiteral
src/insurance/allowed_claims_registry.ts:513:22
   if (tokens.length === 0) {
     return "allowed_claims.json";
   }
-  return tokens.join(", ");
+  return tokens.join("");
 }
 

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:516:50
   return tokens.join(", ");
 }
 
-function toStringArray(value: unknown): string[] {
-  if (!Array.isArray(value)) {
-    return [];
-  }
-  return value
-    .filter((entry): entry is string => typeof entry === "string")
-    .map((entry) => entry.trim())
-    .filter((entry) => entry.length > 0);
-}
+function toStringArray(value: unknown): string[] {}
 
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:517:7
 }
 
 function toStringArray(value: unknown): string[] {
-  if (!Array.isArray(value)) {
+  if (true) {
     return [];
   }
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads disallowed_patterns from file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:517:7
 }
 
 function toStringArray(value: unknown): string[] {
-  if (!Array.isArray(value)) {
+  if (false) {
     return [];
   }
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] MethodExpression
src/insurance/allowed_claims_registry.ts:520:10
   if (!Array.isArray(value)) {
     return [];
   }
-  return value
-    .filter((entry): entry is string => typeof entry === "string")
-    .map((entry) => entry.trim())
-    .filter((entry) => entry.length > 0);
+  return value.filter((entry): entry is string => typeof entry === "string").map(entry => entry.trim());
 }
 

[Survived] MethodExpression
src/insurance/allowed_claims_registry.ts:520:10
   if (!Array.isArray(value)) {
     return [];
   }
-  return value
-    .filter((entry): entry is string => typeof entry === "string")
+  return value
     .map((entry) => entry.trim())
     .filter((entry) => entry.length > 0);

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:521:41
     return [];
   }
   return value
-    .filter((entry): entry is string => typeof entry === "string")
+    .filter((entry): entry is string => typeof entry !== "string")
     .map((entry) => entry.trim())
     .filter((entry) => entry.length > 0);
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads disallowed_patterns from file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:521:41
     return [];
   }
   return value
-    .filter((entry): entry is string => typeof entry === "string")
+    .filter((entry): entry is string => false)
     .map((entry) => entry.trim())
     .filter((entry) => entry.length > 0);
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads disallowed_patterns from file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
