[Killed] ArrowFunction
src/insurance/allowed_claims_registry.ts:522:10
   }
   return value
     .filter((entry): entry is string => typeof entry === "string")
-    .map((entry) => entry.trim())
+    .map(() => undefined)
     .filter((entry) => entry.length > 0);
 }
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads disallowed_patterns from file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] MethodExpression
src/insurance/allowed_claims_registry.ts:522:21
   }
   return value
     .filter((entry): entry is string => typeof entry === "string")
-    .map((entry) => entry.trim())
+    .map((entry) => entry)
     .filter((entry) => entry.length > 0);
 }

[Killed] ArrowFunction
src/insurance/allowed_claims_registry.ts:523:13
   return value
     .filter((entry): entry is string => typeof entry === "string")
     .map((entry) => entry.trim())
-    .filter((entry) => entry.length > 0);
+    .filter(() => undefined);
 }
 
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads disallowed_patterns from file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:523:24
   return value
     .filter((entry): entry is string => typeof entry === "string")
     .map((entry) => entry.trim())
-    .filter((entry) => entry.length > 0);
+    .filter((entry) => false);
 }
 
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads disallowed_patterns from file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
