[Killed] EqualityOperator
src/insurance/policy_gate.ts:229:9
     }
 
     // No match at all — if registry is non-empty, this is an unverified claim
-    if (this.registry.size > 0) {
+    if (this.registry.size >= 0) {
       return {
         decision: "allow", // Don't block; just flag for audit
killedBy: ClaimsCheck no match (unverified claim) should allow text without flag when registry is empty
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "UNVERIFIED_CLAIM",

[Killed] BlockStatement
src/insurance/policy_gate.ts:240:57
     return { decision: "allow", reasonCodes: [], severity: 0 };
   }
 
-  private evaluateClaimId(claimId: string): CheckResult {
-    if (!claimId) {
-      return { decision: "allow", reasonCodes: [], severity: 0 };
-    }
-
-    const approvedClaim = this.registry.getById(claimId);
-    if (approvedClaim) {
-      return {
-        decision: "allow",
-        reasonCodes: [],
-        severity: 0,
-        requiredDisclaimerId: approvedClaim.requiredDisclaimerId ?? undefined,
-      };
-    }
-
-    if (this.registry.size > 0) {
-      return {
-        decision: "allow",
-        reasonCodes: ["UNVERIFIED_CLAIM_ID"],
-        severity: 1,
-      };
-    }
-
-    return { decision: "allow", reasonCodes: [], severity: 0 };
-  }
+  private evaluateClaimId(claimId: string): CheckResult {}
 
   private collectClaimCandidates(ctx: EvaluationContext): {
killedBy: ClaimsCheck metadata claim extraction should extract claim IDs from metadata.claims array of objects
statusReason: TypeError: Cannot read properties of undefined (reading 'reasonCodes')

[Killed] BooleanLiteral
src/insurance/policy_gate.ts:241:9
   }
 
   private evaluateClaimId(claimId: string): CheckResult {
-    if (!claimId) {
+    if (claimId) {
       return { decision: "allow", reasonCodes: [], severity: 0 };
     }
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:241:9
   }
 
   private evaluateClaimId(claimId: string): CheckResult {
-    if (!claimId) {
+    if (true) {
       return { decision: "allow", reasonCodes: [], severity: 0 };
     }
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[NoCoverage] ObjectLiteral
src/insurance/policy_gate.ts:242:14
 
   private evaluateClaimId(claimId: string): CheckResult {
     if (!claimId) {
-      return { decision: "allow", reasonCodes: [], severity: 0 };
+      return {};
     }
 

[NoCoverage] StringLiteral
src/insurance/policy_gate.ts:242:26
 
   private evaluateClaimId(claimId: string): CheckResult {
     if (!claimId) {
-      return { decision: "allow", reasonCodes: [], severity: 0 };
+      return { decision: "", reasonCodes: [], severity: 0 };
     }
 

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:246:9
     }
 
     const approvedClaim = this.registry.getById(claimId);
-    if (approvedClaim) {
+    if (true) {
       return {
         decision: "allow",
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: TypeError: Cannot read properties of null (reading 'requiredDisclaimerId')

[Survived] BlockStatement
src/insurance/policy_gate.ts:246:24
     }
 
     const approvedClaim = this.registry.getById(claimId);
-    if (approvedClaim) {
-      return {
-        decision: "allow",
-        reasonCodes: [],
-        severity: 0,
-        requiredDisclaimerId: approvedClaim.requiredDisclaimerId ?? undefined,
-      };
-    }
+    if (approvedClaim) {}
 
     if (this.registry.size > 0) {

[Killed] ObjectLiteral
src/insurance/policy_gate.ts:247:14
 
     const approvedClaim = this.registry.getById(claimId);
     if (approvedClaim) {
-      return {
-        decision: "allow",
-        reasonCodes: [],
-        severity: 0,
-        requiredDisclaimerId: approvedClaim.requiredDisclaimerId ?? undefined,
-      };
+      return {};
     }
 
killedBy: ClaimsCheck metadata claim extraction should extract claim IDs from metadata.claims array of objects
statusReason: TypeError: result.reasonCodes is not iterable (cannot read property undefined)

[Survived] LogicalOperator
src/insurance/policy_gate.ts:251:31
         decision: "allow",
         reasonCodes: [],
         severity: 0,
-        requiredDisclaimerId: approvedClaim.requiredDisclaimerId ?? undefined,
+        requiredDisclaimerId: approvedClaim.requiredDisclaimerId && undefined,
       };
     }

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:255:9
       };
     }
 
-    if (this.registry.size > 0) {
+    if (true) {
       return {
         decision: "allow",
killedBy: ClaimsCheck edge cases (uncovered paths) should allow and return no reason codes when claim ID not found in empty registry (line 262)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "UNVERIFIED_CLAIM_ID",

[Killed] EqualityOperator
src/insurance/policy_gate.ts:255:9
       };
     }
 
-    if (this.registry.size > 0) {
+    if (this.registry.size >= 0) {
       return {
         decision: "allow",
killedBy: ClaimsCheck edge cases (uncovered paths) should allow and return no reason codes when claim ID not found in empty registry (line 262)
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "UNVERIFIED_CLAIM_ID",

[Killed] StringLiteral
src/insurance/policy_gate.ts:258:23
     if (this.registry.size > 0) {
       return {
         decision: "allow",
-        reasonCodes: ["UNVERIFIED_CLAIM_ID"],
+        reasonCodes: [""],
         severity: 1,
       };
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: [""]

[Killed] EqualityOperator
src/insurance/policy_gate.ts:272:21
     claimIds: string[];
   } {
     const transcriptTexts: string[] = [];
-    if (ctx.text && ctx.text.trim().length > 0) {
+    if (ctx.text && ctx.text.trim().length <= 0) {
       transcriptTexts.push(ctx.text.trim());
     }
killedBy: ClaimsCheck exact match should include requiredDisclaimerId on exact match when present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "DISC-001"
Received: undefined

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:272:9
     claimIds: string[];
   } {
     const transcriptTexts: string[] = [];
-    if (ctx.text && ctx.text.trim().length > 0) {
+    if (true) {
       transcriptTexts.push(ctx.text.trim());
     }
killedBy: ClaimsCheck metadata claim extraction should allow empty text with no metadata
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "UNVERIFIED_CLAIM",

[Survived] MethodExpression
src/insurance/policy_gate.ts:273:28
   } {
     const transcriptTexts: string[] = [];
     if (ctx.text && ctx.text.trim().length > 0) {
-      transcriptTexts.push(ctx.text.trim());
+      transcriptTexts.push(ctx.text);
     }
 

[Killed] ArrayDeclaration
src/insurance/policy_gate.ts:276:37
       transcriptTexts.push(ctx.text.trim());
     }
 
-    const metadataTexts: string[] = [];
+    const metadataTexts: string[] = ["Stryker was here"];
     const claimIds: string[] = [];
 
killedBy: ClaimsCheck exact match should allow text that exactly matches an approved claim
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "UNVERIFIED_CLAIM",

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:279:9
     const metadataTexts: string[] = [];
     const claimIds: string[] = [];
 
-    if (ctx.metadata && typeof ctx.metadata === "object") {
+    if (true) {
       const metadata = ctx.metadata as Record<string, unknown>;
       const sources: unknown[] = [
killedBy: ClaimsCheck exact match should allow text that exactly matches an approved claim
statusReason: TypeError: Cannot read properties of undefined (reading 'claims')

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:279:9
     const metadataTexts: string[] = [];
     const claimIds: string[] = [];
 
-    if (ctx.metadata && typeof ctx.metadata === "object") {
+    if (false) {
       const metadata = ctx.metadata as Record<string, unknown>;
       const sources: unknown[] = [
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Killed] ArrayDeclaration
src/insurance/policy_gate.ts:281:34
 
     if (ctx.metadata && typeof ctx.metadata === "object") {
       const metadata = ctx.metadata as Record<string, unknown>;
-      const sources: unknown[] = [
-        metadata.claims,
-        metadata.claim_ids,
-        metadata.response &&
-          typeof metadata.response === "object" &&
-          (metadata.response as Record<string, unknown>).claims,
-        metadata.response &&
-          typeof metadata.response === "object" &&
-          (metadata.response as Record<string, unknown>).claim_ids,
-      ].filter((value) => value !== undefined);
+      const sources: unknown[] = [].filter((value) => value !== undefined);
 
       for (const source of sources) {
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Killed] LogicalOperator
src/insurance/policy_gate.ts:284:9
       const sources: unknown[] = [
         metadata.claims,
         metadata.claim_ids,
-        metadata.response &&
-          typeof metadata.response === "object" &&
-          (metadata.response as Record<string, unknown>).claims,
+        metadata.response && typeof metadata.response === "object" || (metadata.response as Record<string, unknown>).claims,
         metadata.response &&
           typeof metadata.response === "object" &&
killedBy: ClaimsCheck metadata claim extraction should extract claim IDs from metadata.claims array of objects
statusReason: TypeError: Cannot read properties of undefined (reading 'claims')

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:284:9
       const sources: unknown[] = [
         metadata.claims,
         metadata.claim_ids,
-        metadata.response &&
-          typeof metadata.response === "object" &&
+        true &&
           (metadata.response as Record<string, unknown>).claims,
         metadata.response &&
killedBy: ClaimsCheck metadata claim extraction should extract claim IDs from metadata.claims array of objects
statusReason: TypeError: Cannot read properties of undefined (reading 'claims')

[Survived] EqualityOperator
src/insurance/policy_gate.ts:285:11
         metadata.claims,
         metadata.claim_ids,
         metadata.response &&
-          typeof metadata.response === "object" &&
+          typeof metadata.response !== "object" &&
           (metadata.response as Record<string, unknown>).claims,
         metadata.response &&

[Survived] ConditionalExpression
src/insurance/policy_gate.ts:285:11
         metadata.claims,
         metadata.claim_ids,
         metadata.response &&
-          typeof metadata.response === "object" &&
+          true &&
           (metadata.response as Record<string, unknown>).claims,
         metadata.response &&

[Killed] LogicalOperator
src/insurance/policy_gate.ts:287:9
         metadata.response &&
           typeof metadata.response === "object" &&
           (metadata.response as Record<string, unknown>).claims,
-        metadata.response &&
-          typeof metadata.response === "object" &&
-          (metadata.response as Record<string, unknown>).claim_ids,
+        metadata.response && typeof metadata.response === "object" || (metadata.response as Record<string, unknown>).claim_ids,
       ].filter((value) => value !== undefined);
 
killedBy: ClaimsCheck metadata claim extraction should extract claim IDs from metadata.claims array of objects
statusReason: TypeError: Cannot read properties of undefined (reading 'claim_ids')

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:287:9
         metadata.response &&
           typeof metadata.response === "object" &&
           (metadata.response as Record<string, unknown>).claims,
-        metadata.response &&
-          typeof metadata.response === "object" &&
+        true &&
           (metadata.response as Record<string, unknown>).claim_ids,
       ].filter((value) => value !== undefined);
killedBy: ClaimsCheck metadata claim extraction should extract claim IDs from metadata.claims array of objects
statusReason: TypeError: Cannot read properties of undefined (reading 'claim_ids')

[Killed] EqualityOperator
src/insurance/policy_gate.ts:290:27
         metadata.response &&
           typeof metadata.response === "object" &&
           (metadata.response as Record<string, unknown>).claim_ids,
-      ].filter((value) => value !== undefined);
+      ].filter((value) => value === undefined);
 
       for (const source of sources) {
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:290:27
         metadata.response &&
           typeof metadata.response === "object" &&
           (metadata.response as Record<string, unknown>).claim_ids,
-      ].filter((value) => value !== undefined);
+      ].filter((value) => false);
 
       for (const source of sources) {
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Killed] BlockStatement
src/insurance/policy_gate.ts:292:37
           (metadata.response as Record<string, unknown>).claim_ids,
       ].filter((value) => value !== undefined);
 
-      for (const source of sources) {
-        const { texts, ids } = this.parseClaimSource(source);
-        metadataTexts.push(...texts);
-        claimIds.push(...ids);
-      }
+      for (const source of sources) {}
     }
 
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Survived] ArrayDeclaration
src/insurance/policy_gate.ts:311:27
     ids: string[];
   } {
     const texts: string[] = [];
-    const ids: string[] = [];
+    const ids: string[] = ["Stryker was here"];
 
     if (Array.isArray(source)) {

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:313:9
     const texts: string[] = [];
     const ids: string[] = [];
 
-    if (Array.isArray(source)) {
+    if (false) {
       for (const entry of source) {
         const { texts: entryTexts, ids: entryIds } =
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Killed] BlockStatement
src/insurance/policy_gate.ts:313:32
     const texts: string[] = [];
     const ids: string[] = [];
 
-    if (Array.isArray(source)) {
-      for (const entry of source) {
-        const { texts: entryTexts, ids: entryIds } =
-          this.parseClaimSource(entry);
-        texts.push(...entryTexts);
-        ids.push(...entryIds);
-      }
-      return { texts, ids };
-    }
+    if (Array.isArray(source)) {}
 
     if (typeof source === "string") {
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Killed] BlockStatement
src/insurance/policy_gate.ts:314:35
     const ids: string[] = [];
 
     if (Array.isArray(source)) {
-      for (const entry of source) {
-        const { texts: entryTexts, ids: entryIds } =
-          this.parseClaimSource(entry);
-        texts.push(...entryTexts);
-        ids.push(...entryIds);
-      }
+      for (const entry of source) {}
       return { texts, ids };
     }
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:323:9
       return { texts, ids };
     }
 
-    if (typeof source === "string") {
+    if (false) {
       if (source.trim().length === 0) {
         return { texts, ids };
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Killed] EqualityOperator
src/insurance/policy_gate.ts:323:9
       return { texts, ids };
     }
 
-    if (typeof source === "string") {
+    if (typeof source !== "string") {
       if (source.trim().length === 0) {
         return { texts, ids };
killedBy: ClaimsCheck metadata claim extraction should extract claim IDs from metadata.claims array of objects
statusReason: TypeError: source.trim is not a function

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:324:11
     }
 
     if (typeof source === "string") {
-      if (source.trim().length === 0) {
+      if (true) {
         return { texts, ids };
       }
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Killed] EqualityOperator
src/insurance/policy_gate.ts:324:11
     }
 
     if (typeof source === "string") {
-      if (source.trim().length === 0) {
+      if (source.trim().length !== 0) {
         return { texts, ids };
       }
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Killed] ObjectLiteral
src/insurance/policy_gate.ts:325:16
 
     if (typeof source === "string") {
       if (source.trim().length === 0) {
-        return { texts, ids };
+        return {};
       }
       if (this.looksLikeClaimId(source)) {
killedBy: ClaimsCheck edge cases (uncovered paths) should handle empty string in claim_ids array (parseClaimSource empty string, line 324)
statusReason: TypeError: entryTexts is not iterable (cannot read property undefined)

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:327:11
       if (source.trim().length === 0) {
         return { texts, ids };
       }
-      if (this.looksLikeClaimId(source)) {
+      if (false) {
         ids.push(source.trim());
       } else {
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: ["UNVERIFIED_CLAIM"]

[Killed] BlockStatement
src/insurance/policy_gate.ts:327:42
       if (source.trim().length === 0) {
         return { texts, ids };
       }
-      if (this.looksLikeClaimId(source)) {
-        ids.push(source.trim());
-      } else {
+      if (this.looksLikeClaimId(source)) {} else {
         texts.push(source.trim());
       }
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Survived] MethodExpression
src/insurance/policy_gate.ts:328:18
         return { texts, ids };
       }
       if (this.looksLikeClaimId(source)) {
-        ids.push(source.trim());
+        ids.push(source);
       } else {
         texts.push(source.trim());

[Survived] BlockStatement
src/insurance/policy_gate.ts:329:14
       }
       if (this.looksLikeClaimId(source)) {
         ids.push(source.trim());
-      } else {
-        texts.push(source.trim());
-      }
+      } else {}
       return { texts, ids };
     }

[Survived] MethodExpression
src/insurance/policy_gate.ts:330:20
       if (this.looksLikeClaimId(source)) {
         ids.push(source.trim());
       } else {
-        texts.push(source.trim());
+        texts.push(source);
       }
       return { texts, ids };

[Killed] ObjectLiteral
src/insurance/policy_gate.ts:332:14
       } else {
         texts.push(source.trim());
       }
-      return { texts, ids };
+      return {};
     }
 
killedBy: ClaimsCheck metadata claim extraction should extract claim IDs from metadata.claim_ids string array
statusReason: TypeError: entryTexts is not iterable (cannot read property undefined)

[Killed] BlockStatement
src/insurance/policy_gate.ts:335:47
       return { texts, ids };
     }
 
-    if (source && typeof source === "object") {
-      const record = source as Record<string, unknown>;
-      const id =
-        typeof record.id === "string"
-          ? record.id
-          : typeof record.claim_id === "string"
-            ? record.claim_id
-            : undefined;
-      const text =
-        typeof record.text === "string"
-          ? record.text
-          : typeof record.claim === "string"
-            ? record.claim
-            : undefined;
-
-      if (id && id.trim().length > 0) {
-        ids.push(id.trim());
-      }
-      if (text && text.trim().length > 0) {
-        texts.push(text.trim());
-      }
-    }
+    if (source && typeof source === "object") {}
 
     return { texts, ids };
killedBy: ClaimsCheck metadata claim extraction should extract claim text from metadata claims
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] EqualityOperator
src/insurance/policy_gate.ts:335:19
       return { texts, ids };
     }
 
-    if (source && typeof source === "object") {
+    if (source && typeof source !== "object") {
       const record = source as Record<string, unknown>;
       const id =
killedBy: ClaimsCheck metadata claim extraction should extract claim text from metadata claims
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Survived] EqualityOperator
src/insurance/policy_gate.ts:338:9
     if (source && typeof source === "object") {
       const record = source as Record<string, unknown>;
       const id =
-        typeof record.id === "string"
+        typeof record.id !== "string"
           ? record.id
           : typeof record.claim_id === "string"

[Survived] ConditionalExpression
src/insurance/policy_gate.ts:338:9
     if (source && typeof source === "object") {
       const record = source as Record<string, unknown>;
       const id =
-        typeof record.id === "string"
+        false
           ? record.id
           : typeof record.claim_id === "string"

[Survived] EqualityOperator
src/insurance/policy_gate.ts:340:13
       const id =
         typeof record.id === "string"
           ? record.id
-          : typeof record.claim_id === "string"
+          : typeof record.claim_id !== "string"
             ? record.claim_id
             : undefined;

[Survived] ConditionalExpression
src/insurance/policy_gate.ts:340:13
       const id =
         typeof record.id === "string"
           ? record.id
-          : typeof record.claim_id === "string"
+          : false
             ? record.claim_id
             : undefined;

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:344:9
             ? record.claim_id
             : undefined;
       const text =
-        typeof record.text === "string"
+        false
           ? record.text
           : typeof record.claim === "string"
killedBy: ClaimsCheck metadata claim extraction should extract claim text from metadata claims
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] EqualityOperator
src/insurance/policy_gate.ts:344:9
             ? record.claim_id
             : undefined;
       const text =
-        typeof record.text === "string"
+        typeof record.text !== "string"
           ? record.text
           : typeof record.claim === "string"
killedBy: ClaimsCheck metadata claim extraction should extract claim text from metadata claims
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:350:11
             ? record.claim
             : undefined;
 
-      if (id && id.trim().length > 0) {
+      if (true) {
         ids.push(id.trim());
       }
killedBy: ClaimsCheck metadata claim extraction should extract claim text from metadata claims
statusReason: TypeError: Cannot read properties of undefined (reading 'trim')

[Killed] LogicalOperator
src/insurance/policy_gate.ts:350:11
             ? record.claim
             : undefined;
 
-      if (id && id.trim().length > 0) {
+      if (id || id.trim().length > 0) {
         ids.push(id.trim());
       }
killedBy: ClaimsCheck metadata claim extraction should extract claim text from metadata claims
statusReason: TypeError: Cannot read properties of undefined (reading 'trim')

[Survived] MethodExpression
src/insurance/policy_gate.ts:351:18
             : undefined;
 
       if (id && id.trim().length > 0) {
-        ids.push(id.trim());
+        ids.push(id);
       }
       if (text && text.trim().length > 0) {

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:353:11
       if (id && id.trim().length > 0) {
         ids.push(id.trim());
       }
-      if (text && text.trim().length > 0) {
+      if (true) {
         texts.push(text.trim());
       }
killedBy: ClaimsCheck metadata claim extraction should extract claim IDs from metadata.claims array of objects
statusReason: TypeError: Cannot read properties of undefined (reading 'trim')

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:353:11
       if (id && id.trim().length > 0) {
         ids.push(id.trim());
       }
-      if (text && text.trim().length > 0) {
+      if (false) {
         texts.push(text.trim());
       }
killedBy: ClaimsCheck metadata claim extraction should extract claim text from metadata claims
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Survived] MethodExpression
src/insurance/policy_gate.ts:354:20
         ids.push(id.trim());
       }
       if (text && text.trim().length > 0) {
-        texts.push(text.trim());
+        texts.push(text);
       }
     }

[Killed] BlockStatement
src/insurance/policy_gate.ts:361:52
     return { texts, ids };
   }
 
-  private looksLikeClaimId(value: string): boolean {
-    return /^CLAIM-\d{3,}$/i.test(value.trim());
-  }
+  private looksLikeClaimId(value: string): boolean {}
 
   private formatDisallowedPattern(pattern: string): string {
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: ["UNVERIFIED_CLAIM"]

[Survived] MethodExpression
src/insurance/policy_gate.ts:362:35
   }
 
   private looksLikeClaimId(value: string): boolean {
-    return /^CLAIM-\d{3,}$/i.test(value.trim());
+    return /^CLAIM-\d{3,}$/i.test(value);
   }
 

[Killed] Regex
src/insurance/policy_gate.ts:362:12
   }
 
   private looksLikeClaimId(value: string): boolean {
-    return /^CLAIM-\d{3,}$/i.test(value.trim());
+    return /^CLAIM-\D{3,}$/i.test(value.trim());
   }
 
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: ["UNVERIFIED_CLAIM"]

[Killed] BlockStatement
src/insurance/policy_gate.ts:365:60
     return /^CLAIM-\d{3,}$/i.test(value.trim());
   }
 
-  private formatDisallowedPattern(pattern: string): string {
-    const normalized = pattern
-      .toUpperCase()
-      .replace(/[^A-Z0-9]+/g, "_")
-      .replace(/^_+|_+$/g, "");
-    return `DISALLOWED_PATTERN:${normalized || "UNKNOWN"}`;
-  }
+  private formatDisallowedPattern(pattern: string): string {}
 
   private mergeResults(results: CheckResult[]): CheckResult {
killedBy: ClaimsCheck disallowed patterns should include formatted pattern name in reason codes
statusReason: TypeError: Cannot read properties of undefined (reading 'startsWith')
