[Killed] MethodExpression
src/insurance/policy_gate.ts:366:24
   }
 
   private formatDisallowedPattern(pattern: string): string {
-    const normalized = pattern
-      .toUpperCase()
+    const normalized = pattern.toLowerCase()
       .replace(/[^A-Z0-9]+/g, "_")
       .replace(/^_+|_+$/g, "");
killedBy: ClaimsCheck disallowed patterns should include formatted pattern name in reason codes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "DISALLOWED_PATTERN:GUARANTEED_CURE"
Received: "DISALLOWED_PATTERN:UNKNOWN"

[Survived] Regex
src/insurance/policy_gate.ts:368:16
   private formatDisallowedPattern(pattern: string): string {
     const normalized = pattern
       .toUpperCase()
-      .replace(/[^A-Z0-9]+/g, "_")
+      .replace(/[^A-Z0-9]/g, "_")
       .replace(/^_+|_+$/g, "");
     return `DISALLOWED_PATTERN:${normalized || "UNKNOWN"}`;

[Killed] Regex
src/insurance/policy_gate.ts:369:16
     const normalized = pattern
       .toUpperCase()
       .replace(/[^A-Z0-9]+/g, "_")
-      .replace(/^_+|_+$/g, "");
+      .replace(/^_+|_+/g, "");
     return `DISALLOWED_PATTERN:${normalized || "UNKNOWN"}`;
   }
killedBy: ClaimsCheck disallowed patterns should include formatted pattern name in reason codes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "DISALLOWED_PATTERN:GUARANTEED_CURE"
Received: "DISALLOWED_PATTERN:GUARANTEEDCURE"

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:370:34
       .toUpperCase()
       .replace(/[^A-Z0-9]+/g, "_")
       .replace(/^_+|_+$/g, "");
-    return `DISALLOWED_PATTERN:${normalized || "UNKNOWN"}`;
+    return `DISALLOWED_PATTERN:${false}`;
   }
 
killedBy: ClaimsCheck disallowed patterns should include formatted pattern name in reason codes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "DISALLOWED_PATTERN:GUARANTEED_CURE"
Received: "DISALLOWED_PATTERN:false"

[Killed] LogicalOperator
src/insurance/policy_gate.ts:370:34
       .toUpperCase()
       .replace(/[^A-Z0-9]+/g, "_")
       .replace(/^_+|_+$/g, "");
-    return `DISALLOWED_PATTERN:${normalized || "UNKNOWN"}`;
+    return `DISALLOWED_PATTERN:${normalized && "UNKNOWN"}`;
   }
 
killedBy: ClaimsCheck disallowed patterns should include formatted pattern name in reason codes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "DISALLOWED_PATTERN:GUARANTEED_CURE"
Received: "DISALLOWED_PATTERN:UNKNOWN"

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:374:9
   }
 
   private mergeResults(results: CheckResult[]): CheckResult {
-    if (results.length === 0) {
+    if (true) {
       return { decision: "allow", reasonCodes: [], severity: 0 };
     }
killedBy: ClaimsCheck exact match should include requiredDisclaimerId on exact match when present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "DISC-001"
Received: undefined

[Killed] EqualityOperator
src/insurance/policy_gate.ts:374:9
   }
 
   private mergeResults(results: CheckResult[]): CheckResult {
-    if (results.length === 0) {
+    if (results.length !== 0) {
       return { decision: "allow", reasonCodes: [], severity: 0 };
     }
killedBy: ClaimsCheck exact match should include requiredDisclaimerId on exact match when present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "DISC-001"
Received: undefined

[NoCoverage] ArrayDeclaration
src/insurance/policy_gate.ts:375:48
 
   private mergeResults(results: CheckResult[]): CheckResult {
     if (results.length === 0) {
-      return { decision: "allow", reasonCodes: [], severity: 0 };
+      return { decision: "allow", reasonCodes: ["Stryker was here"], severity: 0 };
     }
 

[NoCoverage] ObjectLiteral
src/insurance/policy_gate.ts:375:14
 
   private mergeResults(results: CheckResult[]): CheckResult {
     if (results.length === 0) {
-      return { decision: "allow", reasonCodes: [], severity: 0 };
+      return {};
     }
 

[Survived] ArrayDeclaration
src/insurance/policy_gate.ts:388:20
 
     let winningResult: CheckResult = {
       decision: "allow",
-      reasonCodes: [],
+      reasonCodes: ["Stryker was here"],
       severity: 0,
     };

[Killed] BlockStatement
src/insurance/policy_gate.ts:395:35
     const reasonCodes: string[] = [];
     let requiredDisclaimerId: string | undefined;
 
-    for (const result of results) {
-      reasonCodes.push(...result.reasonCodes);
-
-      if (!requiredDisclaimerId && result.requiredDisclaimerId) {
-        requiredDisclaimerId = result.requiredDisclaimerId;
-      }
-
-      const currentPriority = decisionPriority[winningResult.decision];
-      const newPriority = decisionPriority[result.decision];
-
-      if (
-        newPriority > currentPriority ||
-        (newPriority === currentPriority &&
-          result.severity > winningResult.severity)
-      ) {
-        winningResult = result;
-      }
-    }
+    for (const result of results) {}
 
     const dedupedReasonCodes = Array.from(new Set(reasonCodes));
killedBy: Multi-Tenant E2E: Complete Isolation (N-13 Phases 1+2+3) Combined isolation — all three phases two ControlEngines with different tenantIds use independent claim sets
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "CLAIMS_DISALLOWED"
Received array: []

[Killed] BlockStatement
src/insurance/policy_gate.ts:398:65
     for (const result of results) {
       reasonCodes.push(...result.reasonCodes);
 
-      if (!requiredDisclaimerId && result.requiredDisclaimerId) {
-        requiredDisclaimerId = result.requiredDisclaimerId;
-      }
+      if (!requiredDisclaimerId && result.requiredDisclaimerId) {}
 
       const currentPriority = decisionPriority[winningResult.decision];
killedBy: ClaimsCheck exact match should include requiredDisclaimerId on exact match when present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "DISC-001"
Received: undefined

[Killed] BooleanLiteral
src/insurance/policy_gate.ts:398:11
     for (const result of results) {
       reasonCodes.push(...result.reasonCodes);
 
-      if (!requiredDisclaimerId && result.requiredDisclaimerId) {
+      if (requiredDisclaimerId && result.requiredDisclaimerId) {
         requiredDisclaimerId = result.requiredDisclaimerId;
       }
killedBy: ClaimsCheck exact match should include requiredDisclaimerId on exact match when present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "DISC-001"
Received: undefined

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:406:9
       const newPriority = decisionPriority[result.decision];
 
       if (
-        newPriority > currentPriority ||
-        (newPriority === currentPriority &&
-          result.severity > winningResult.severity)
+        false
       ) {
         winningResult = result;
killedBy: ClaimsCheck partial match should rewrite text that partially matches an approved claim
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:406:9
       const newPriority = decisionPriority[result.decision];
 
       if (
-        newPriority > currentPriority ||
+        false ||
         (newPriority === currentPriority &&
           result.severity > winningResult.severity)
killedBy: ClaimsCheck partial match should rewrite text that partially matches an approved claim
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] EqualityOperator
src/insurance/policy_gate.ts:407:10
 
       if (
         newPriority > currentPriority ||
-        (newPriority === currentPriority &&
+        (newPriority !== currentPriority &&
           result.severity > winningResult.severity)
       ) {
killedBy: ClaimsCheck no match (unverified claim) should flag unverified claim when registry is non-empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:407:10
 
       if (
         newPriority > currentPriority ||
-        (newPriority === currentPriority &&
-          result.severity > winningResult.severity)
+        (false)
       ) {
         winningResult = result;
killedBy: ClaimsCheck no match (unverified claim) should flag unverified claim when registry is non-empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
src/insurance/policy_gate.ts:408:11
       if (
         newPriority > currentPriority ||
         (newPriority === currentPriority &&
-          result.severity > winningResult.severity)
+          result.severity <= winningResult.severity)
       ) {
         winningResult = result;
killedBy: ClaimsCheck no match (unverified claim) should flag unverified claim when registry is non-empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] EqualityOperator
src/insurance/policy_gate.ts:408:11
       if (
         newPriority > currentPriority ||
         (newPriority === currentPriority &&
-          result.severity > winningResult.severity)
+          result.severity >= winningResult.severity)
       ) {
         winningResult = result;

[Killed] BlockStatement
src/insurance/policy_gate.ts:409:9
         newPriority > currentPriority ||
         (newPriority === currentPriority &&
           result.severity > winningResult.severity)
-      ) {
-        winningResult = result;
-      }
+      ) {}
     }
 
killedBy: ControlEngine evaluate() with assistant text matching disallowed claim pattern should return rewrite for text containing a disallowed pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] LogicalOperator
src/insurance/policy_gate.ts:422:9
       severity: winningResult.severity,
       safeRewrite: winningResult.safeRewrite,
       requiredDisclaimerId:
-        winningResult.requiredDisclaimerId ?? requiredDisclaimerId,
+        winningResult.requiredDisclaimerId && requiredDisclaimerId,
     };
   }
killedBy: ClaimsCheck exact match should include requiredDisclaimerId on exact match when present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "DISC-001"
Received: undefined

[Killed] ArrayDeclaration
src/insurance/policy_gate.ts:443:29
   private maxMetadataDepth: number;
 
   constructor(config: PIIRedactorConfig = {}) {
-    const defaultPatterns = [
-      {
-        name: "phone_us",
-        regex: /\b\d{3}[-.]?\d{3}[-.]?\d{4}\b/g,
-        replacement: "[PHONE_REDACTED]",
-      },
-      {
-        name: "email",
-        regex: /\b[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Z|a-z]{2,}\b/g,
-        replacement: "[EMAIL_REDACTED]",
-      },
-      {
-        name: "ssn",
-        regex: /\b\d{3}-\d{2}-\d{4}\b/g,
-        replacement: "[SSN_REDACTED]",
-      },
-      {
-        name: "credit_card",
-        regex: /\b\d{4}[- ]?\d{4}[- ]?\d{4}[- ]?\d{4}\b/g,
-        replacement: "[CC_REDACTED]",
-      },
-    ];
+    const defaultPatterns = [];
 
     this.patterns = config.patterns ?? defaultPatterns;
killedBy: ControlEngine evaluate() with PII in text should return rewrite when a phone number is detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] StringLiteral
src/insurance/policy_gate.ts:445:15
   constructor(config: PIIRedactorConfig = {}) {
     const defaultPatterns = [
       {
-        name: "phone_us",
+        name: "",
         regex: /\b\d{3}[-.]?\d{3}[-.]?\d{4}\b/g,
         replacement: "[PHONE_REDACTED]",
killedBy: ControlEngine evaluate() with PII in text should return rewrite when a phone number is detected
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "PII_DETECTED:PHONE_US"
Received array: ["PII_DETECTED", "PII_DETECTED:"]

[Killed] Regex
src/insurance/policy_gate.ts:446:16
     const defaultPatterns = [
       {
         name: "phone_us",
-        regex: /\b\d{3}[-.]?\d{3}[-.]?\d{4}\b/g,
+        regex: /\b\d[-.]?\d{3}[-.]?\d{4}\b/g,
         replacement: "[PHONE_REDACTED]",
       },
killedBy: ControlEngine evaluate() with PII in text should return rewrite when a phone number is detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] Regex
src/insurance/policy_gate.ts:446:16
     const defaultPatterns = [
       {
         name: "phone_us",
-        regex: /\b\d{3}[-.]?\d{3}[-.]?\d{4}\b/g,
+        regex: /\b\d{3}[-.]?\d[-.]?\d{4}\b/g,
         replacement: "[PHONE_REDACTED]",
       },
killedBy: PIIRedactorCheck phone number detection should detect US phone number with dashes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] StringLiteral
src/insurance/policy_gate.ts:447:22
       {
         name: "phone_us",
         regex: /\b\d{3}[-.]?\d{3}[-.]?\d{4}\b/g,
-        replacement: "[PHONE_REDACTED]",
+        replacement: "",
       },
       {
killedBy: PIIRedactorCheck phone number detection should detect US phone number with dashes
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[PHONE_REDACTED]"
Received string:    "Call me at "

[Killed] Regex
src/insurance/policy_gate.ts:451:16
       },
       {
         name: "email",
-        regex: /\b[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Z|a-z]{2,}\b/g,
+        regex: /\b[A-Za-z0-9._%+-]+@[^A-Za-z0-9.-]+\.[A-Z|a-z]{2,}\b/g,
         replacement: "[EMAIL_REDACTED]",
       },
killedBy: ControlEngine evaluate() with PII in text should return rewrite when an email is detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] Regex
src/insurance/policy_gate.ts:451:16
       },
       {
         name: "email",
-        regex: /\b[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Z|a-z]{2,}\b/g,
+        regex: /\b[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[^A-Z|a-z]{2,}\b/g,
         replacement: "[EMAIL_REDACTED]",
       },
killedBy: ControlEngine evaluate() with PII in text should return rewrite when an email is detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] StringLiteral
src/insurance/policy_gate.ts:452:22
       {
         name: "email",
         regex: /\b[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Z|a-z]{2,}\b/g,
-        replacement: "[EMAIL_REDACTED]",
+        replacement: "",
       },
       {
killedBy: ControlEngine evaluate() with PII in text should return rewrite when an email is detected
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[EMAIL_REDACTED]"
Received string:    "Contact me at  please"

[Killed] Regex
src/insurance/policy_gate.ts:456:16
       },
       {
         name: "ssn",
-        regex: /\b\d{3}-\d{2}-\d{4}\b/g,
+        regex: /\b\d-\d{2}-\d{4}\b/g,
         replacement: "[SSN_REDACTED]",
       },
killedBy: ControlEngine evaluate() with PII in text should return rewrite when an SSN is detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] Regex
src/insurance/policy_gate.ts:456:16
       },
       {
         name: "ssn",
-        regex: /\b\d{3}-\d{2}-\d{4}\b/g,
+        regex: /\b\D{3}-\d{2}-\d{4}\b/g,
         replacement: "[SSN_REDACTED]",
       },
killedBy: ControlEngine evaluate() with PII in text should return rewrite when an SSN is detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] Regex
src/insurance/policy_gate.ts:461:16
       },
       {
         name: "credit_card",
-        regex: /\b\d{4}[- ]?\d{4}[- ]?\d{4}[- ]?\d{4}\b/g,
+        regex: /\b\d{4}[- ]?\d{4}[- ]?\d{4}[- ]?\D{4}\b/g,
         replacement: "[CC_REDACTED]",
       },
killedBy: PIIRedactorCheck credit card detection should detect credit card numbers with spaces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] Regex
src/insurance/policy_gate.ts:461:16
       },
       {
         name: "credit_card",
-        regex: /\b\d{4}[- ]?\d{4}[- ]?\d{4}[- ]?\d{4}\b/g,
+        regex: /\b\d{4}[- ]?\d{4}[^- ]?\d{4}[- ]?\d{4}\b/g,
         replacement: "[CC_REDACTED]",
       },
killedBy: PIIRedactorCheck credit card detection should detect credit card numbers with spaces
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] StringLiteral
src/insurance/policy_gate.ts:462:22
       {
         name: "credit_card",
         regex: /\b\d{4}[- ]?\d{4}[- ]?\d{4}[- ]?\d{4}\b/g,
-        replacement: "[CC_REDACTED]",
+        replacement: "",
       },
     ];
killedBy: PIIRedactorCheck credit card detection should detect credit card numbers with spaces
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "[CC_REDACTED]"
Received string:    "My card is "

[Killed] LogicalOperator
src/insurance/policy_gate.ts:466:21
       },
     ];
 
-    this.patterns = config.patterns ?? defaultPatterns;
+    this.patterns = config.patterns && defaultPatterns;
     this.mode = config.mode ?? "redact";
     this.includeMetadata = config.includeMetadata ?? true;
killedBy: PIIRedactorCheck phone number detection should detect US phone number with dashes
statusReason: TypeError: this.patterns is not iterable

[Killed] LogicalOperator
src/insurance/policy_gate.ts:467:17
     ];
 
     this.patterns = config.patterns ?? defaultPatterns;
-    this.mode = config.mode ?? "redact";
+    this.mode = config.mode && "redact";
     this.includeMetadata = config.includeMetadata ?? true;
     this.redactMetadata = config.redactMetadata ?? true;
killedBy: PIIRedactorCheck phone number detection should detect US phone number with dashes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] StringLiteral
src/insurance/policy_gate.ts:467:32
     ];
 
     this.patterns = config.patterns ?? defaultPatterns;
-    this.mode = config.mode ?? "redact";
+    this.mode = config.mode ?? "";
     this.includeMetadata = config.includeMetadata ?? true;
     this.redactMetadata = config.redactMetadata ?? true;
killedBy: PIIRedactorCheck phone number detection should detect US phone number with dashes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] LogicalOperator
src/insurance/policy_gate.ts:468:28
 
     this.patterns = config.patterns ?? defaultPatterns;
     this.mode = config.mode ?? "redact";
-    this.includeMetadata = config.includeMetadata ?? true;
+    this.includeMetadata = config.includeMetadata && true;
     this.redactMetadata = config.redactMetadata ?? true;
     this.maxMetadataDepth = config.maxMetadataDepth ?? 4;
killedBy: PIIRedactorCheck metadata scanning should detect PII in metadata string values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] BooleanLiteral
src/insurance/policy_gate.ts:468:54
 
     this.patterns = config.patterns ?? defaultPatterns;
     this.mode = config.mode ?? "redact";
-    this.includeMetadata = config.includeMetadata ?? true;
+    this.includeMetadata = config.includeMetadata ?? false;
     this.redactMetadata = config.redactMetadata ?? true;
     this.maxMetadataDepth = config.maxMetadataDepth ?? 4;
killedBy: PIIRedactorCheck metadata scanning should detect PII in metadata string values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Survived] BooleanLiteral
src/insurance/policy_gate.ts:469:52
     this.patterns = config.patterns ?? defaultPatterns;
     this.mode = config.mode ?? "redact";
     this.includeMetadata = config.includeMetadata ?? true;
-    this.redactMetadata = config.redactMetadata ?? true;
+    this.redactMetadata = config.redactMetadata ?? false;
     this.maxMetadataDepth = config.maxMetadataDepth ?? 4;
   }

[Survived] LogicalOperator
src/insurance/policy_gate.ts:469:27
     this.patterns = config.patterns ?? defaultPatterns;
     this.mode = config.mode ?? "redact";
     this.includeMetadata = config.includeMetadata ?? true;
-    this.redactMetadata = config.redactMetadata ?? true;
+    this.redactMetadata = config.redactMetadata && true;
     this.maxMetadataDepth = config.maxMetadataDepth ?? 4;
   }

[Killed] LogicalOperator
src/insurance/policy_gate.ts:470:29
     this.mode = config.mode ?? "redact";
     this.includeMetadata = config.includeMetadata ?? true;
     this.redactMetadata = config.redactMetadata ?? true;
-    this.maxMetadataDepth = config.maxMetadataDepth ?? 4;
+    this.maxMetadataDepth = config.maxMetadataDepth && 4;
   }
 
killedBy: PIIRedactorCheck metadata scanning should respect maxMetadataDepth and stop scanning deep objects
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not "PII_DETECTED:EMAIL"
Received array:     ["PII_DETECTED", "PII_DETECTED:EMAIL"]

[Killed] BlockStatement
src/insurance/policy_gate.ts:477:48
    * Redact PII from a single text string and return detected types.
    * This is safe to call for audit or tool-call sanitation.
    */
-  redactText(text: string): PIIRedactionResult {
-    let redacted = text;
-    const detectedTypes: string[] = [];
-
-    for (const { name, regex, replacement } of this.patterns) {
-      // Reset regex state for global patterns
-      regex.lastIndex = 0;
-      if (regex.test(redacted)) {
-        detectedTypes.push(name);
-        regex.lastIndex = 0;
-        redacted = redacted.replace(regex, replacement);
-      }
-    }
-
-    return {
-      redactedText: redacted,
-      detectedTypes: Array.from(new Set(detectedTypes)),
-    };
-  }
+  redactText(text: string): PIIRedactionResult {}
 
   async evaluate(ctx: EvaluationContext): Promise<CheckResult> {
killedBy: ControlEngine evaluate() with clean user text should return allow for innocuous user input
statusReason: TypeError: Cannot read properties of undefined (reading 'detectedTypes')

[Killed] BlockStatement
src/insurance/policy_gate.ts:481:63
     let redacted = text;
     const detectedTypes: string[] = [];
 
-    for (const { name, regex, replacement } of this.patterns) {
-      // Reset regex state for global patterns
-      regex.lastIndex = 0;
-      if (regex.test(redacted)) {
-        detectedTypes.push(name);
-        regex.lastIndex = 0;
-        redacted = redacted.replace(regex, replacement);
-      }
-    }
+    for (const { name, regex, replacement } of this.patterns) {}
 
     return {
killedBy: ControlEngine evaluate() with PII in text should return rewrite when a phone number is detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] BlockStatement
src/insurance/policy_gate.ts:484:33
     for (const { name, regex, replacement } of this.patterns) {
       // Reset regex state for global patterns
       regex.lastIndex = 0;
-      if (regex.test(redacted)) {
-        detectedTypes.push(name);
-        regex.lastIndex = 0;
-        redacted = redacted.replace(regex, replacement);
-      }
+      if (regex.test(redacted)) {}
     }
 
killedBy: ControlEngine evaluate() with PII in text should return rewrite when a phone number is detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:484:11
     for (const { name, regex, replacement } of this.patterns) {
       // Reset regex state for global patterns
       regex.lastIndex = 0;
-      if (regex.test(redacted)) {
+      if (false) {
         detectedTypes.push(name);
         regex.lastIndex = 0;
killedBy: ControlEngine evaluate() with PII in text should return rewrite when a phone number is detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] ObjectLiteral
src/insurance/policy_gate.ts:491:12
       }
     }
 
-    return {
-      redactedText: redacted,
-      detectedTypes: Array.from(new Set(detectedTypes)),
-    };
+    return {};
   }
 
killedBy: ControlEngine evaluate() with clean user text should return allow for innocuous user input
statusReason: TypeError: textResult.detectedTypes is not iterable

[Killed] ArrayDeclaration
src/insurance/policy_gate.ts:501:55
     const textResult = this.redactText(ctx.text);
     const metadataResult = this.includeMetadata
       ? this.redactMetadataValue(ctx.metadata, 0, new WeakSet())
-      : { redactedValue: ctx.metadata, detectedTypes: [] };
+      : { redactedValue: ctx.metadata, detectedTypes: ["Stryker was here"] };
 
     const detectedTypes = Array.from(
killedBy: PIIRedactorCheck metadata scanning should skip metadata scanning when includeMetadata is false
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "rewrite"

[Killed] ObjectLiteral
src/insurance/policy_gate.ts:501:9
     const textResult = this.redactText(ctx.text);
     const metadataResult = this.includeMetadata
       ? this.redactMetadataValue(ctx.metadata, 0, new WeakSet())
-      : { redactedValue: ctx.metadata, detectedTypes: [] };
+      : {};
 
     const detectedTypes = Array.from(
killedBy: PIIRedactorCheck metadata scanning should skip metadata scanning when includeMetadata is false
statusReason: TypeError: metadataResult.detectedTypes is not iterable

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:507:9
       new Set([...textResult.detectedTypes, ...metadataResult.detectedTypes]),
     );
 
-    if (detectedTypes.length > 0) {
+    if (true) {
       const reasonCodes = [
         "PII_DETECTED",
killedBy: ControlEngine evaluate() with clean user text should return allow for innocuous user input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "rewrite"

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:507:9
       new Set([...textResult.detectedTypes, ...metadataResult.detectedTypes]),
     );
 
-    if (detectedTypes.length > 0) {
+    if (false) {
       const reasonCodes = [
         "PII_DETECTED",
killedBy: ControlEngine evaluate() with PII in text should return rewrite when a phone number is detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] ArrayDeclaration
src/insurance/policy_gate.ts:508:27
     );
 
     if (detectedTypes.length > 0) {
-      const reasonCodes = [
-        "PII_DETECTED",
-        ...detectedTypes.map((t) => `PII_DETECTED:${t.toUpperCase()}`),
-      ];
+      const reasonCodes = [];
       const shouldRedact = this.mode === "redact";
       return {
killedBy: ControlEngine evaluate() with PII in text should return rewrite when a phone number is detected
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "PII_DETECTED"
Received array: []

[Killed] ArrowFunction
src/insurance/policy_gate.ts:510:30
     if (detectedTypes.length > 0) {
       const reasonCodes = [
         "PII_DETECTED",
-        ...detectedTypes.map((t) => `PII_DETECTED:${t.toUpperCase()}`),
+        ...detectedTypes.map(() => undefined),
       ];
       const shouldRedact = this.mode === "redact";
killedBy: PIIRedactorCheck phone number detection should detect US phone number with dashes
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "PII_DETECTED:PHONE_US"
Received array: ["PII_DETECTED", undefined]

[Killed] MethodExpression
src/insurance/policy_gate.ts:510:53
     if (detectedTypes.length > 0) {
       const reasonCodes = [
         "PII_DETECTED",
-        ...detectedTypes.map((t) => `PII_DETECTED:${t.toUpperCase()}`),
+        ...detectedTypes.map((t) => `PII_DETECTED:${t.toLowerCase()}`),
       ];
       const shouldRedact = this.mode === "redact";
killedBy: ControlEngine evaluate() with PII in text should return rewrite when a phone number is detected
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "PII_DETECTED:PHONE_US"
Received array: ["PII_DETECTED", "PII_DETECTED:phone_us"]

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:512:28
         "PII_DETECTED",
         ...detectedTypes.map((t) => `PII_DETECTED:${t.toUpperCase()}`),
       ];
-      const shouldRedact = this.mode === "redact";
+      const shouldRedact = false;
       return {
         decision: shouldRedact ? "rewrite" : "allow",
killedBy: ControlEngine evaluate() with PII in text should return rewrite when a phone number is detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] EqualityOperator
src/insurance/policy_gate.ts:512:28
         "PII_DETECTED",
         ...detectedTypes.map((t) => `PII_DETECTED:${t.toUpperCase()}`),
       ];
-      const shouldRedact = this.mode === "redact";
+      const shouldRedact = this.mode !== "redact";
       return {
         decision: shouldRedact ? "rewrite" : "allow",
killedBy: ControlEngine evaluate() with PII in text should return rewrite when a phone number is detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"
