[Killed] ObjectLiteral
src/insurance/policy_gate.ts:521:12
       };
     }
 
-    return { decision: "allow", reasonCodes: [], severity: 0 };
+    return {};
   }
 
killedBy: Full Pipeline E2E Smoke Test (N-12 + N-13 + N-14) Alpha tenant — OPA claims allow path (medical) exact registered claim → allow decision
statusReason: TypeError: result.reasonCodes is not iterable (cannot read property undefined)

[Killed] BlockStatement
src/insurance/policy_gate.ts:529:40
     depth: number,
     seen: WeakSet<object>,
   ): { redactedValue: unknown; detectedTypes: string[] } {
-    if (depth > this.maxMetadataDepth) {
-      return { redactedValue: value, detectedTypes: [] };
-    }
+    if (depth > this.maxMetadataDepth) {}
 
     if (typeof value === "string") {
killedBy: PIIRedactorCheck metadata scanning should respect maxMetadataDepth and stop scanning deep objects
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not "PII_DETECTED:EMAIL"
Received array:     ["PII_DETECTED", "PII_DETECTED:EMAIL"]

[Killed] EqualityOperator
src/insurance/policy_gate.ts:529:9
     depth: number,
     seen: WeakSet<object>,
   ): { redactedValue: unknown; detectedTypes: string[] } {
-    if (depth > this.maxMetadataDepth) {
+    if (depth <= this.maxMetadataDepth) {
       return { redactedValue: value, detectedTypes: [] };
     }
killedBy: PIIRedactorCheck metadata scanning should detect PII in metadata string values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] ObjectLiteral
src/insurance/policy_gate.ts:530:14
     seen: WeakSet<object>,
   ): { redactedValue: unknown; detectedTypes: string[] } {
     if (depth > this.maxMetadataDepth) {
-      return { redactedValue: value, detectedTypes: [] };
+      return {};
     }
 
killedBy: PIIRedactorCheck metadata scanning should respect maxMetadataDepth and stop scanning deep objects
statusReason: TypeError: result.detectedTypes is not iterable (cannot read property undefined)

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:533:9
       return { redactedValue: value, detectedTypes: [] };
     }
 
-    if (typeof value === "string") {
+    if (false) {
       const result = this.redactText(value);
       return {
killedBy: PIIRedactorCheck metadata scanning should detect PII in metadata string values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:533:9
       return { redactedValue: value, detectedTypes: [] };
     }
 
-    if (typeof value === "string") {
+    if (true) {
       const result = this.redactText(value);
       return {
killedBy: PIIRedactorCheck metadata scanning should detect PII in metadata string values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] ObjectLiteral
src/insurance/policy_gate.ts:535:14
 
     if (typeof value === "string") {
       const result = this.redactText(value);
-      return {
-        redactedValue: this.redactMetadata ? result.redactedText : value,
-        detectedTypes: result.detectedTypes,
-      };
+      return {};
     }
 
killedBy: PIIRedactorCheck metadata scanning should detect PII in metadata string values
statusReason: TypeError: result.detectedTypes is not iterable (cannot read property undefined)

[Killed] BlockStatement
src/insurance/policy_gate.ts:541:46
       };
     }
 
-    if (!value || typeof value !== "object") {
-      return { redactedValue: value, detectedTypes: [] };
-    }
+    if (!value || typeof value !== "object") {}
 
     if (seen.has(value)) {
killedBy: PIIRedactorCheck phone number detection should detect US phone number with dashes
statusReason: TypeError: Invalid value used in weak set

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:541:9
       };
     }
 
-    if (!value || typeof value !== "object") {
+    if (true) {
       return { redactedValue: value, detectedTypes: [] };
     }
killedBy: PIIRedactorCheck metadata scanning should detect PII in metadata string values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:545:9
       return { redactedValue: value, detectedTypes: [] };
     }
 
-    if (seen.has(value)) {
+    if (true) {
       return { redactedValue: value, detectedTypes: [] };
     }
killedBy: PIIRedactorCheck metadata scanning should detect PII in metadata string values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Survived] BlockStatement
src/insurance/policy_gate.ts:545:26
       return { redactedValue: value, detectedTypes: [] };
     }
 
-    if (seen.has(value)) {
-      return { redactedValue: value, detectedTypes: [] };
-    }
+    if (seen.has(value)) {}
     seen.add(value);
 

[Killed] ObjectLiteral
src/insurance/policy_gate.ts:546:14
     }
 
     if (seen.has(value)) {
-      return { redactedValue: value, detectedTypes: [] };
+      return {};
     }
     seen.add(value);
killedBy: PIIRedactorCheck edge cases (uncovered paths) should handle circular references in metadata without infinite loop (line 545)
statusReason: TypeError: result.detectedTypes is not iterable (cannot read property undefined)

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:550:9
     }
     seen.add(value);
 
-    if (Array.isArray(value)) {
+    if (true) {
       const redactedArray: unknown[] = [];
       const detectedTypes: string[] = [];
killedBy: PIIRedactorCheck metadata scanning should detect PII in metadata string values
statusReason: TypeError: value is not iterable

[Survived] BlockStatement
src/insurance/policy_gate.ts:550:31
     }
     seen.add(value);
 
-    if (Array.isArray(value)) {
-      const redactedArray: unknown[] = [];
-      const detectedTypes: string[] = [];
-
-      for (const entry of value) {
-        const result = this.redactMetadataValue(entry, depth + 1, seen);
-        detectedTypes.push(...result.detectedTypes);
-        if (this.redactMetadata) {
-          redactedArray.push(result.redactedValue);
-        }
-      }
-
-      return {
-        redactedValue: this.redactMetadata ? redactedArray : value,
-        detectedTypes: Array.from(new Set(detectedTypes)),
-      };
-    }
+    if (Array.isArray(value)) {}
 
     const record = value as Record<string, unknown>;

[Survived] ArrayDeclaration
src/insurance/policy_gate.ts:552:39
 
     if (Array.isArray(value)) {
       const redactedArray: unknown[] = [];
-      const detectedTypes: string[] = [];
+      const detectedTypes: string[] = ["Stryker was here"];
 
       for (const entry of value) {

[Killed] BlockStatement
src/insurance/policy_gate.ts:554:34
       const redactedArray: unknown[] = [];
       const detectedTypes: string[] = [];
 
-      for (const entry of value) {
-        const result = this.redactMetadataValue(entry, depth + 1, seen);
-        detectedTypes.push(...result.detectedTypes);
-        if (this.redactMetadata) {
-          redactedArray.push(result.redactedValue);
-        }
-      }
+      for (const entry of value) {}
 
       return {
killedBy: PIIRedactorCheck metadata scanning should detect PII in metadata arrays
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Survived] ArithmeticOperator
src/insurance/policy_gate.ts:555:56
       const detectedTypes: string[] = [];
 
       for (const entry of value) {
-        const result = this.redactMetadataValue(entry, depth + 1, seen);
+        const result = this.redactMetadataValue(entry, depth - 1, seen);
         detectedTypes.push(...result.detectedTypes);
         if (this.redactMetadata) {

[Survived] BlockStatement
src/insurance/policy_gate.ts:557:34
       for (const entry of value) {
         const result = this.redactMetadataValue(entry, depth + 1, seen);
         detectedTypes.push(...result.detectedTypes);
-        if (this.redactMetadata) {
-          redactedArray.push(result.redactedValue);
-        }
+        if (this.redactMetadata) {}
       }
 

[Survived] ConditionalExpression
src/insurance/policy_gate.ts:557:13
       for (const entry of value) {
         const result = this.redactMetadataValue(entry, depth + 1, seen);
         detectedTypes.push(...result.detectedTypes);
-        if (this.redactMetadata) {
+        if (true) {
           redactedArray.push(result.redactedValue);
         }

[Killed] BlockStatement
src/insurance/policy_gate.ts:572:56
     const redactedRecord: Record<string, unknown> = {};
     const detectedTypes: string[] = [];
 
-    for (const [key, entry] of Object.entries(record)) {
-      const result = this.redactMetadataValue(entry, depth + 1, seen);
-      detectedTypes.push(...result.detectedTypes);
-      if (this.redactMetadata) {
-        redactedRecord[key] = result.redactedValue;
-      }
-    }
+    for (const [key, entry] of Object.entries(record)) {}
 
     return {
killedBy: PIIRedactorCheck metadata scanning should detect PII in metadata string values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] ArithmeticOperator
src/insurance/policy_gate.ts:573:54
     const detectedTypes: string[] = [];
 
     for (const [key, entry] of Object.entries(record)) {
-      const result = this.redactMetadataValue(entry, depth + 1, seen);
+      const result = this.redactMetadataValue(entry, depth - 1, seen);
       detectedTypes.push(...result.detectedTypes);
       if (this.redactMetadata) {
killedBy: PIIRedactorCheck metadata scanning should respect maxMetadataDepth and stop scanning deep objects
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not "PII_DETECTED:EMAIL"
Received array:     ["PII_DETECTED", "PII_DETECTED:EMAIL"]

[Survived] ConditionalExpression
src/insurance/policy_gate.ts:575:11
     for (const [key, entry] of Object.entries(record)) {
       const result = this.redactMetadataValue(entry, depth + 1, seen);
       detectedTypes.push(...result.detectedTypes);
-      if (this.redactMetadata) {
+      if (false) {
         redactedRecord[key] = result.redactedValue;
       }

[Survived] BlockStatement
src/insurance/policy_gate.ts:575:32
     for (const [key, entry] of Object.entries(record)) {
       const result = this.redactMetadataValue(entry, depth + 1, seen);
       detectedTypes.push(...result.detectedTypes);
-      if (this.redactMetadata) {
-        redactedRecord[key] = result.redactedValue;
-      }
+      if (this.redactMetadata) {}
     }
 

[Killed] ObjectLiteral
src/insurance/policy_gate.ts:580:12
       }
     }
 
-    return {
-      redactedValue: this.redactMetadata ? redactedRecord : value,
-      detectedTypes: Array.from(new Set(detectedTypes)),
-    };
+    return {};
   }
 }
killedBy: ControlEngine handleEvent (event-driven path) should include response metadata in assistant evaluation context
statusReason: TypeError: result.detectedTypes is not iterable (cannot read property undefined)

[Killed] ObjectLiteral
src/insurance/policy_gate.ts:612:59
 
 // ── PolicyGate (aggregator) ────────────────────────────────────────────
 
-const DECISION_PRIORITY: Record<PolicyDecision, number> = {
-  allow: 0,
-  rewrite: 1,
-  refuse: 2,
-  escalate: 3,
-  cancel_output: 4,
-};
+const DECISION_PRIORITY: Record<PolicyDecision, number> = {};
 
 export class PolicyGate {
killedBy: PolicyGate should prefer higher-priority decision type even at lower severity
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "refuse"
Received: "rewrite"

[Killed] BlockStatement
src/insurance/policy_gate.ts:624:72
   private checks: PolicyCheck[];
   private opaEvaluator?: OpaEvaluator;
 
-  constructor(checks: PolicyCheck[] = [], opaEvaluator?: OpaEvaluator) {
-    this.checks = checks;
-    this.opaEvaluator = opaEvaluator;
-  }
+  constructor(checks: PolicyCheck[] = [], opaEvaluator?: OpaEvaluator) {}
 
   /**
killedBy: PolicyGate should return allow when no checks are configured
statusReason: TypeError: this.checks is not iterable

[Killed] ArrayDeclaration
src/insurance/policy_gate.ts:642:38
   async evaluate(ctx: EvaluationContext): Promise<GateResult> {
     const start = Date.now();
     const checksRun: string[] = [];
-    const allReasonCodes: string[] = [];
+    const allReasonCodes: string[] = ["Stryker was here"];
     const completedCheckInputs: OpaCheckInput[] = [];
 
killedBy: PolicyGate should return allow when no checks are configured
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:670:9
       const newPriority = DECISION_PRIORITY[result.decision];
 
       if (
-        newPriority > currentPriority ||
-        (newPriority === currentPriority &&
-          result.severity > winningResult.severity)
+        true
       ) {
         winningResult = result;
killedBy: ControlEngine evaluate() with PII in text should return rewrite when a phone number is detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] EqualityOperator
src/insurance/policy_gate.ts:670:9
       const newPriority = DECISION_PRIORITY[result.decision];
 
       if (
-        newPriority > currentPriority ||
+        newPriority <= currentPriority ||
         (newPriority === currentPriority &&
           result.severity > winningResult.severity)
killedBy: Full Pipeline E2E Smoke Test (N-12 + N-13 + N-14) Alpha tenant — OPA claims refuse path (medical) 'guaranteed cure' disallowed pattern → refuse
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "refuse"
Received: "allow"

[Survived] LogicalOperator
src/insurance/policy_gate.ts:671:10
 
       if (
         newPriority > currentPriority ||
-        (newPriority === currentPriority &&
-          result.severity > winningResult.severity)
+        (newPriority === currentPriority || result.severity > winningResult.severity)
       ) {
         winningResult = result;

[Killed] LogicalOperator
src/insurance/policy_gate.ts:680:9
       // Short-circuit: no check can override cancel_output, and critical
       // refuse/escalate will be upgraded to cancel_output by OverrideController
       if (
-        winningResult.decision === "cancel_output" ||
-        (winningResult.severity >= 4 &&
-          (winningResult.decision === "refuse" ||
-            winningResult.decision === "escalate"))
+        winningResult.decision === "cancel_output" && winningResult.severity >= 4 && (winningResult.decision === "refuse" || winningResult.decision === "escalate")
       ) {
         break;
killedBy: ControlEngine evaluate() with text matching moderation deny pattern should short-circuit and skip claims_checker after critical refuse
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not "claims_checker"
Received array:     ["pii_redactor", "moderator", "claims_checker"]

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:680:9
       // Short-circuit: no check can override cancel_output, and critical
       // refuse/escalate will be upgraded to cancel_output by OverrideController
       if (
-        winningResult.decision === "cancel_output" ||
-        (winningResult.severity >= 4 &&
-          (winningResult.decision === "refuse" ||
-            winningResult.decision === "escalate"))
+        false
       ) {
         break;
killedBy: ControlEngine evaluate() with text matching moderation deny pattern should short-circuit and skip claims_checker after critical refuse
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not "claims_checker"
Received array:     ["pii_redactor", "moderator", "claims_checker"]

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:681:10
       // refuse/escalate will be upgraded to cancel_output by OverrideController
       if (
         winningResult.decision === "cancel_output" ||
-        (winningResult.severity >= 4 &&
-          (winningResult.decision === "refuse" ||
-            winningResult.decision === "escalate"))
+        (false)
       ) {
         break;
killedBy: ControlEngine evaluate() with text matching moderation deny pattern should short-circuit and skip claims_checker after critical refuse
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not "claims_checker"
Received array:     ["pii_redactor", "moderator", "claims_checker"]

[Killed] EqualityOperator
src/insurance/policy_gate.ts:681:10
       // refuse/escalate will be upgraded to cancel_output by OverrideController
       if (
         winningResult.decision === "cancel_output" ||
-        (winningResult.severity >= 4 &&
+        (winningResult.severity > 4 &&
           (winningResult.decision === "refuse" ||
             winningResult.decision === "escalate"))
killedBy: ControlEngine evaluate() with text matching moderation deny pattern should short-circuit and skip claims_checker after critical refuse
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not "claims_checker"
Received array:     ["pii_redactor", "moderator", "claims_checker"]

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:682:12
       if (
         winningResult.decision === "cancel_output" ||
         (winningResult.severity >= 4 &&
-          (winningResult.decision === "refuse" ||
+          (false ||
             winningResult.decision === "escalate"))
       ) {
killedBy: ControlEngine evaluate() with text matching moderation deny pattern should short-circuit and skip claims_checker after critical refuse
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not "claims_checker"
Received array:     ["pii_redactor", "moderator", "claims_checker"]

[Killed] LogicalOperator
src/insurance/policy_gate.ts:682:12
       if (
         winningResult.decision === "cancel_output" ||
         (winningResult.severity >= 4 &&
-          (winningResult.decision === "refuse" ||
-            winningResult.decision === "escalate"))
+          (winningResult.decision === "refuse" && winningResult.decision === "escalate"))
       ) {
         break;
killedBy: ControlEngine evaluate() with text matching moderation deny pattern should short-circuit and skip claims_checker after critical refuse
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not "claims_checker"
Received array:     ["pii_redactor", "moderator", "claims_checker"]

[Survived] ConditionalExpression
src/insurance/policy_gate.ts:683:13
         winningResult.decision === "cancel_output" ||
         (winningResult.severity >= 4 &&
           (winningResult.decision === "refuse" ||
-            winningResult.decision === "escalate"))
+            false))
       ) {
         break;

[Survived] EqualityOperator
src/insurance/policy_gate.ts:683:13
         winningResult.decision === "cancel_output" ||
         (winningResult.severity >= 4 &&
           (winningResult.decision === "refuse" ||
-            winningResult.decision === "escalate"))
+            winningResult.decision !== "escalate"))
       ) {
         break;

[Killed] BlockStatement
src/insurance/policy_gate.ts:684:9
         (winningResult.severity >= 4 &&
           (winningResult.decision === "refuse" ||
             winningResult.decision === "escalate"))
-      ) {
-        break;
-      }
+      ) {}
     }
 
killedBy: ControlEngine evaluate() with text matching moderation deny pattern should short-circuit and skip claims_checker after critical refuse
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not "claims_checker"
Received array:     ["pii_redactor", "moderator", "claims_checker"]

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:689:9
       }
     }
 
-    if (this.opaEvaluator?.isInitialized) {
+    if (false) {
       const opaOutput = this.opaEvaluator.evaluate({
         checks: completedCheckInputs,
killedBy: PolicyGate + OpaEvaluator integration with initialized OpaEvaluator: uses OPA result for decision
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "cancel_output"
Received: "refuse"

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:689:9
       }
     }
 
-    if (this.opaEvaluator?.isInitialized) {
+    if (true) {
       const opaOutput = this.opaEvaluator.evaluate({
         checks: completedCheckInputs,
killedBy: Full Pipeline E2E Smoke Test (N-12 + N-13 + N-14) Alpha tenant — OPA claims allow path (medical) exact registered claim → allow decision
statusReason: TypeError: Cannot read properties of undefined (reading 'evaluate')

[Killed] LogicalOperator
src/insurance/policy_gate.ts:697:22
         decision: opaOutput.decision,
         reasonCodes: allReasonCodes,
         severity: opaOutput.severity,
-        safeRewrite: opaOutput.safeRewrite ?? undefined,
+        safeRewrite: opaOutput.safeRewrite && undefined,
         requiredDisclaimerId: opaOutput.requiredDisclaimerId ?? undefined,
         checkDurationMs: Date.now() - start,
killedBy: PolicyGate + OpaEvaluator integration safeRewrite from OPA output flows through to GateResult
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "safe text"
Received: undefined

[Killed] LogicalOperator
src/insurance/policy_gate.ts:698:31
         reasonCodes: allReasonCodes,
         severity: opaOutput.severity,
         safeRewrite: opaOutput.safeRewrite ?? undefined,
-        requiredDisclaimerId: opaOutput.requiredDisclaimerId ?? undefined,
+        requiredDisclaimerId: opaOutput.requiredDisclaimerId && undefined,
         checkDurationMs: Date.now() - start,
         checksRun,
killedBy: OpaEvaluator — edge cases OPA null safeRewrite maps to undefined in GateResult
statusReason: Error: expect(received).toBeUndefined()

Received: null

[Survived] ArithmeticOperator
src/insurance/policy_gate.ts:699:26
         severity: opaOutput.severity,
         safeRewrite: opaOutput.safeRewrite ?? undefined,
         requiredDisclaimerId: opaOutput.requiredDisclaimerId ?? undefined,
-        checkDurationMs: Date.now() - start,
+        checkDurationMs: Date.now() + start,
         checksRun,
       };

[Killed] ObjectLiteral
src/insurance/policy_gate.ts:704:12
       };
     }
 
-    return {
-      decision: winningResult.decision,
-      reasonCodes: allReasonCodes,
-      severity: winningResult.severity,
-      safeRewrite: winningResult.safeRewrite,
-      requiredDisclaimerId: winningResult.requiredDisclaimerId,
-      checkDurationMs: Date.now() - start,
-      checksRun,
-    };
+    return {};
   }
 }
killedBy: ControlEngine evaluate() with clean user text should return allow for innocuous user input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: undefined

[Survived] ArithmeticOperator
src/insurance/policy_gate.ts:710:24
       severity: winningResult.severity,
       safeRewrite: winningResult.safeRewrite,
       requiredDisclaimerId: winningResult.requiredDisclaimerId,
-      checkDurationMs: Date.now() - start,
+      checkDurationMs: Date.now() + start,
       checksRun,
     };
