[Killed] BooleanLiteral
src/orchestrator/LaneArbitrator.ts:59:17
 }
 
 const DEFAULT_CONFIG: LaneArbitratorConfig = {
-  laneAEnabled: true,
+  laneAEnabled: false,
   minDelayBeforeReflexMs: 100, // Min wait before triggering Lane A
   maxReflexDurationMs: 2000, // Max reflex duration before auto-cancel
killedBy: LaneArbitrator Configuration Options should respect minDelayBeforeReflexMs
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Timeout] BooleanLiteral
src/orchestrator/LaneArbitrator.ts:75:41
   private reflexTimeoutTimer: NodeJS.Timeout | null = null;
   private speechEndTime: number | null = null;
   private bReadyTime: number | null = null;
-  private responseInProgress: boolean = false; // Guards against overlapping response cycles
+  private responseInProgress: boolean = true; // Guards against overlapping response cycles
   private suppressLaneBDone: boolean = false; // Ignore next Lane B done after policy cancel
   private auditTrail?: AuditTrail;

[Killed] BooleanLiteral
src/orchestrator/LaneArbitrator.ts:76:40
   private speechEndTime: number | null = null;
   private bReadyTime: number | null = null;
   private responseInProgress: boolean = false; // Guards against overlapping response cycles
-  private suppressLaneBDone: boolean = false; // Ignore next Lane B done after policy cancel
+  private suppressLaneBDone: boolean = true; // Ignore next Lane B done after policy cancel
   private auditTrail?: AuditTrail;
 
killedBy: LaneArbitrator Lane B done flow should transition to LISTENING when Lane B is done
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LISTENING"
Received: "B_PLAYING"

[Killed] ObjectLiteral
src/orchestrator/LaneArbitrator.ts:82:19
   constructor(sessionId: string, config: Partial<LaneArbitratorConfig> = {}) {
     super();
     this.sessionId = sessionId;
-    this.config = { ...DEFAULT_CONFIG, ...config };
+    this.config = {};
     this.auditTrail = config.auditTrail;
   }
killedBy: LaneArbitrator initialization should have Lane A enabled by default
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:89:31
   /**
    * Get current state
    */
-  getState(): ArbitratorState {
-    return this.state;
-  }
+  getState(): ArbitratorState {}
 
   /**
killedBy: LaneArbitrator Initialization should initialize in IDLE state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "IDLE"
Received: undefined

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:96:27
   /**
    * Get current audio owner
    */
-  getCurrentOwner(): Lane {
-    switch (this.state) {
-      case "A_PLAYING":
-        return "A";
-      case "B_PLAYING":
-        return "B";
-      case "FALLBACK_PLAYING":
-        return "fallback";
-      default:
-        return "none";
-    }
-  }
+  getCurrentOwner(): Lane {}
 
   /**
killedBy: LaneArbitrator initialization should have no audio owner initially
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "none"
Received: undefined

[Survived] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:98:7
    */
   getCurrentOwner(): Lane {
     switch (this.state) {
-      case "A_PLAYING":
-        return "A";
+      case "A_PLAYING":
       case "B_PLAYING":
         return "B";

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:98:12
    */
   getCurrentOwner(): Lane {
     switch (this.state) {
-      case "A_PLAYING":
+      case "":
         return "A";
       case "B_PLAYING":

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:99:16
   getCurrentOwner(): Lane {
     switch (this.state) {
       case "A_PLAYING":
-        return "A";
+        return "";
       case "B_PLAYING":
         return "B";

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:100:7
     switch (this.state) {
       case "A_PLAYING":
         return "A";
-      case "B_PLAYING":
-        return "B";
+      case "B_PLAYING":
       case "FALLBACK_PLAYING":
         return "fallback";
killedBy: LaneArbitrator Lane B ready flow should set owner to B when Lane B is ready
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "B"
Received: "fallback"

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:102:7
         return "A";
       case "B_PLAYING":
         return "B";
-      case "FALLBACK_PLAYING":
-        return "fallback";
+      case "FALLBACK_PLAYING":
       default:
         return "none";
killedBy: Lane C Policy Cancel and Fallback Integration when Lane B is playing should stop Lane B, trigger fallback, and log audit events
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "fallback"
Received: "none"

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:104:7
         return "B";
       case "FALLBACK_PLAYING":
         return "fallback";
-      default:
-        return "none";
+      default:
     }
   }
killedBy: LaneArbitrator Initialization should have no current owner initially
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "none"
Received: undefined

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:112:29
   /**
    * Check if Lane A is enabled
    */
-  isLaneAEnabled(): boolean {
-    return this.config.laneAEnabled;
-  }
+  isLaneAEnabled(): boolean {}
 
   /**
killedBy: LaneArbitrator Initialization should respect laneAEnabled configuration
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: undefined

[Timeout] BlockStatement
src/orchestrator/LaneArbitrator.ts:119:24
   /**
    * Start the session (transition to LISTENING)
    */
-  startSession(): void {
-    this.transition("LISTENING", "session_start");
-    console.log(`[LaneArbitrator] Session started: ${this.sessionId}`);
-  }
+  startSession(): void {}
 
   /**

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:127:22
   /**
    * End the session
    */
-  endSession(): void {
-    this.clearTimers();
-    this.responseInProgress = false;
-
-    if (this.state === "FALLBACK_PLAYING") {
-      this.emit("stop_fallback");
-    }
-
-    this.transition("ENDED", "session_end");
-    console.log(`[LaneArbitrator] Session ended: ${this.sessionId}`);
-  }
+  endSession(): void {}
 
   /**
killedBy: Voice Pipeline Integration Edge Cases and Recovery should handle session end during active response
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ENDED"
Received: "B_PLAYING"

[Survived] BooleanLiteral
src/orchestrator/LaneArbitrator.ts:129:31
    */
   endSession(): void {
     this.clearTimers();
-    this.responseInProgress = false;
+    this.responseInProgress = true;
 
     if (this.state === "FALLBACK_PLAYING") {

[Survived] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:131:9
     this.clearTimers();
     this.responseInProgress = false;
 
-    if (this.state === "FALLBACK_PLAYING") {
+    if (true) {
       this.emit("stop_fallback");
     }

[Survived] EqualityOperator
src/orchestrator/LaneArbitrator.ts:131:9
     this.clearTimers();
     this.responseInProgress = false;
 
-    if (this.state === "FALLBACK_PLAYING") {
+    if (this.state !== "FALLBACK_PLAYING") {
       this.emit("stop_fallback");
     }

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:132:17
     this.responseInProgress = false;
 
     if (this.state === "FALLBACK_PLAYING") {
-      this.emit("stop_fallback");
+      this.emit("");
     }
 

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:135:30
       this.emit("stop_fallback");
     }
 
-    this.transition("ENDED", "session_end");
+    this.transition("ENDED", "");
     console.log(`[LaneArbitrator] Session ended: ${this.sessionId}`);
   }

[Timeout] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:144:9
    */
   onUserSpeechEnded(): void {
     // Guard against overlapping response cycles
-    if (this.responseInProgress) {
+    if (true) {
       console.log(
         `[LaneArbitrator] Ignoring speech end: response already in progress`,

[Survived] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:144:9
    */
   onUserSpeechEnded(): void {
     // Guard against overlapping response cycles
-    if (this.responseInProgress) {
+    if (false) {
       console.log(
         `[LaneArbitrator] Ignoring speech end: response already in progress`,

[NoCoverage] BlockStatement
src/orchestrator/LaneArbitrator.ts:151:37
       return;
     }
 
-    if (this.state !== "LISTENING") {
-      console.warn(
-        `[LaneArbitrator] Unexpected speech end in state: ${this.state}`,
-      );
-      return;
-    }
+    if (this.state !== "LISTENING") {}
 
     // Mark response cycle as in progress

[Timeout] EqualityOperator
src/orchestrator/LaneArbitrator.ts:151:9
       return;
     }
 
-    if (this.state !== "LISTENING") {
+    if (this.state === "LISTENING") {
       console.warn(
         `[LaneArbitrator] Unexpected speech end in state: ${this.state}`,

[NoCoverage] StringLiteral
src/orchestrator/LaneArbitrator.ts:153:9
 
     if (this.state !== "LISTENING") {
       console.warn(
-        `[LaneArbitrator] Unexpected speech end in state: ${this.state}`,
+        ``,
       );
       return;

[Killed] BooleanLiteral
src/orchestrator/LaneArbitrator.ts:159:31
     }
 
     // Mark response cycle as in progress
-    this.responseInProgress = true;
+    this.responseInProgress = false;
     this.speechEndTime = Date.now();
     console.log(`[LaneArbitrator] User speech ended at ${this.speechEndTime}`);
killedBy: Voice Pipeline Integration Error Handling Integration should handle commit failure gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LISTENING"
Received: "B_RESPONDING"

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:164:21
     console.log(`[LaneArbitrator] User speech ended at ${this.speechEndTime}`);
 
     // Transition to B_RESPONDING - Lane B is now working
-    this.transition("B_RESPONDING", "user_speech_ended");
+    this.transition("", "user_speech_ended");
 
     // If Lane A is enabled, schedule reflex after min delay
killedBy: Voice Pipeline Integration Complete Voice Interaction Flow should handle full user utterance → AI response cycle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "B_RESPONDING"
Received: ""

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:164:37
     console.log(`[LaneArbitrator] User speech ended at ${this.speechEndTime}`);
 
     // Transition to B_RESPONDING - Lane B is now working
-    this.transition("B_RESPONDING", "user_speech_ended");
+    this.transition("B_RESPONDING", "");
 
     // If Lane A is enabled, schedule reflex after min delay
killedBy: LaneArbitrator State Transitions should emit state_change event on transition
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "user_speech_ended"
Received: ""

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:167:35
     this.transition("B_RESPONDING", "user_speech_ended");
 
     // If Lane A is enabled, schedule reflex after min delay
-    if (this.config.laneAEnabled) {
-      this.reflexTimer = setTimeout(() => {
-        this.triggerLaneA();
-      }, this.config.minDelayBeforeReflexMs);
-    }
+    if (this.config.laneAEnabled) {}
   }
 
killedBy: LaneArbitrator user speech ended flow should emit play_reflex after delay when Lane A enabled
statusReason: Error: thrown: "Exceeded timeout of 500 ms for a test while waiting for `done()` to be called.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:167:9
     this.transition("B_RESPONDING", "user_speech_ended");
 
     // If Lane A is enabled, schedule reflex after min delay
-    if (this.config.laneAEnabled) {
+    if (false) {
       this.reflexTimer = setTimeout(() => {
         this.triggerLaneA();
killedBy: LaneArbitrator user speech ended flow should emit play_reflex after delay when Lane A enabled
statusReason: Error: thrown: "Exceeded timeout of 500 ms for a test while waiting for `done()` to be called.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:168:43
 
     // If Lane A is enabled, schedule reflex after min delay
     if (this.config.laneAEnabled) {
-      this.reflexTimer = setTimeout(() => {
-        this.triggerLaneA();
-      }, this.config.minDelayBeforeReflexMs);
+      this.reflexTimer = setTimeout(() => {}, this.config.minDelayBeforeReflexMs);
     }
   }
killedBy: LaneArbitrator Lane A Reflex Triggering should trigger Lane A after minDelayBeforeReflexMs
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:179:9
    */
   private triggerLaneA(): void {
     // Only trigger if still waiting for B
-    if (this.state !== "B_RESPONDING") {
+    if (true) {
       console.log(
         `[LaneArbitrator] Skipping Lane A: state is ${this.state}, not B_RESPONDING`,
killedBy: LaneArbitrator Lane A Reflex Triggering should trigger Lane A after minDelayBeforeReflexMs
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
src/orchestrator/LaneArbitrator.ts:179:9
    */
   private triggerLaneA(): void {
     // Only trigger if still waiting for B
-    if (this.state !== "B_RESPONDING") {
+    if (this.state === "B_RESPONDING") {
       console.log(
         `[LaneArbitrator] Skipping Lane A: state is ${this.state}, not B_RESPONDING`,
killedBy: Voice Pipeline Integration Complete Voice Interaction Flow should handle Lane A → Lane B preemption
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[NoCoverage] StringLiteral
src/orchestrator/LaneArbitrator.ts:181:9
     // Only trigger if still waiting for B
     if (this.state !== "B_RESPONDING") {
       console.log(
-        `[LaneArbitrator] Skipping Lane A: state is ${this.state}, not B_RESPONDING`,
+        ``,
       );
       return;

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:188:7
 
     // Transition to A_PLAYING
     this.transitionLaneOwner(
-      "none",
+      "",
       "A",
       "user_speech_ended" as LaneTransitionCause,

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:195:15
     this.transition("A_PLAYING", "user_speech_ended");
 
     // Emit event to trigger reflex audio
-    this.emit("play_reflex");
+    this.emit("");
     console.log(`[LaneArbitrator] Lane A reflex triggered`);
 
killedBy: Voice Pipeline Integration Complete Voice Interaction Flow should handle Lane A → Lane B preemption
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:199:48
     console.log(`[LaneArbitrator] Lane A reflex triggered`);
 
     // Set timeout to auto-cancel Lane A if B takes too long
-    this.reflexTimeoutTimer = setTimeout(() => {
-      if (this.state === "A_PLAYING") {
-        console.log(`[LaneArbitrator] Lane A timeout - auto-canceling`);
-        this.emit("stop_reflex");
-      }
-    }, this.config.maxReflexDurationMs);
+    this.reflexTimeoutTimer = setTimeout(() => {}, this.config.maxReflexDurationMs);
   }
 
killedBy: LaneArbitrator Lane A Reflex Triggering should auto-cancel Lane A after maxReflexDurationMs
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
src/orchestrator/LaneArbitrator.ts:200:11
 
     // Set timeout to auto-cancel Lane A if B takes too long
     this.reflexTimeoutTimer = setTimeout(() => {
-      if (this.state === "A_PLAYING") {
+      if (this.state !== "A_PLAYING") {
         console.log(`[LaneArbitrator] Lane A timeout - auto-canceling`);
         this.emit("stop_reflex");
killedBy: LaneArbitrator Lane A Reflex Triggering should auto-cancel Lane A after maxReflexDurationMs
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:200:11
 
     // Set timeout to auto-cancel Lane A if B takes too long
     this.reflexTimeoutTimer = setTimeout(() => {
-      if (this.state === "A_PLAYING") {
+      if (false) {
         console.log(`[LaneArbitrator] Lane A timeout - auto-canceling`);
         this.emit("stop_reflex");
killedBy: LaneArbitrator Lane A Reflex Triggering should auto-cancel Lane A after maxReflexDurationMs
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:201:21
     // Set timeout to auto-cancel Lane A if B takes too long
     this.reflexTimeoutTimer = setTimeout(() => {
       if (this.state === "A_PLAYING") {
-        console.log(`[LaneArbitrator] Lane A timeout - auto-canceling`);
+        console.log(``);
         this.emit("stop_reflex");
       }

[Survived] ArithmeticOperator
src/orchestrator/LaneArbitrator.ts:213:9
   onLaneBReady(): void {
     this.bReadyTime = Date.now();
     const latencyMs = this.speechEndTime
-      ? this.bReadyTime - this.speechEndTime
+      ? this.bReadyTime + this.speechEndTime
       : 0;
 

[Survived] ObjectLiteral
src/orchestrator/LaneArbitrator.ts:219:41
     console.log(`[LaneArbitrator] Lane B ready after ${latencyMs}ms`);
 
     // Emit lane.b_ready event
-    const readyEvent: LaneBReadyEvent = {
-      event_id: uuidv4(),
-      session_id: this.sessionId,
-      t_ms: Date.now(),
-      source: "laneB",
-      type: "lane.b_ready",
-      payload: { latency_ms: latencyMs },
-    };
+    const readyEvent: LaneBReadyEvent = {};
     eventBus.emit(readyEvent);
 

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:223:15
       event_id: uuidv4(),
       session_id: this.sessionId,
       t_ms: Date.now(),
-      source: "laneB",
+      source: "",
       type: "lane.b_ready",
       payload: { latency_ms: latencyMs },

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:233:37
     this.clearTimers();
 
     // If Lane A is playing, stop it immediately
-    if (this.state === "A_PLAYING") {
-      console.log(`[LaneArbitrator] Preempting Lane A with Lane B`);
-      this.emit("stop_reflex");
-
-      // Small gap to avoid audio click
-      setTimeout(() => {
-        this.transitionLaneOwner("A", "B", "b_first_audio_ready");
-        this.transition("B_PLAYING", "b_first_audio_ready");
-        this.emit("play_lane_b");
-      }, this.config.transitionGapMs);
-    } else if (this.state === "B_RESPONDING") {
+    if (this.state === "A_PLAYING") {} else if (this.state === "B_RESPONDING") {
       // Lane A wasn't triggered or skipped - go straight to B
       this.transitionLaneOwner("none", "B", "b_first_audio_ready");
killedBy: LaneArbitrator Lane B Preemption should preempt Lane A when Lane B ready
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:233:9
     this.clearTimers();
 
     // If Lane A is playing, stop it immediately
-    if (this.state === "A_PLAYING") {
+    if (true) {
       console.log(`[LaneArbitrator] Preempting Lane A with Lane B`);
       this.emit("stop_reflex");
killedBy: Voice Pipeline Integration Complete Voice Interaction Flow should handle full user utterance → AI response cycle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "B_PLAYING"
Received: "B_RESPONDING"

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:235:17
     // If Lane A is playing, stop it immediately
     if (this.state === "A_PLAYING") {
       console.log(`[LaneArbitrator] Preempting Lane A with Lane B`);
-      this.emit("stop_reflex");
+      this.emit("");
 
       // Small gap to avoid audio click
killedBy: Voice Pipeline Integration Complete Voice Interaction Flow should handle Lane A → Lane B preemption
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:238:24
       this.emit("stop_reflex");
 
       // Small gap to avoid audio click
-      setTimeout(() => {
-        this.transitionLaneOwner("A", "B", "b_first_audio_ready");
-        this.transition("B_PLAYING", "b_first_audio_ready");
-        this.emit("play_lane_b");
-      }, this.config.transitionGapMs);
+      setTimeout(() => {}, this.config.transitionGapMs);
     } else if (this.state === "B_RESPONDING") {
       // Lane A wasn't triggered or skipped - go straight to B
killedBy: Voice Pipeline Integration Complete Voice Interaction Flow should handle Lane A → Lane B preemption
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:239:44
 
       // Small gap to avoid audio click
       setTimeout(() => {
-        this.transitionLaneOwner("A", "B", "b_first_audio_ready");
+        this.transitionLaneOwner("A", "B", "");
         this.transition("B_PLAYING", "b_first_audio_ready");
         this.emit("play_lane_b");
killedBy: LaneArbitrator Lane B Preemption should emit owner_change event on preemption
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "b_first_audio_ready"
Received: ""

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:239:39
 
       // Small gap to avoid audio click
       setTimeout(() => {
-        this.transitionLaneOwner("A", "B", "b_first_audio_ready");
+        this.transitionLaneOwner("A", "", "b_first_audio_ready");
         this.transition("B_PLAYING", "b_first_audio_ready");
         this.emit("play_lane_b");
killedBy: LaneArbitrator Lane B Preemption should emit owner_change event on preemption
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test while waiting for `done()` to be called.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:240:38
       // Small gap to avoid audio click
       setTimeout(() => {
         this.transitionLaneOwner("A", "B", "b_first_audio_ready");
-        this.transition("B_PLAYING", "b_first_audio_ready");
+        this.transition("B_PLAYING", "");
         this.emit("play_lane_b");
       }, this.config.transitionGapMs);

[Killed] EqualityOperator
src/orchestrator/LaneArbitrator.ts:243:16
         this.transition("B_PLAYING", "b_first_audio_ready");
         this.emit("play_lane_b");
       }, this.config.transitionGapMs);
-    } else if (this.state === "B_RESPONDING") {
+    } else if (this.state !== "B_RESPONDING") {
       // Lane A wasn't triggered or skipped - go straight to B
       this.transitionLaneOwner("none", "B", "b_first_audio_ready");
killedBy: Voice Pipeline Integration Complete Voice Interaction Flow should handle full user utterance → AI response cycle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "B_PLAYING"
Received: "B_RESPONDING"

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:243:16
         this.transition("B_PLAYING", "b_first_audio_ready");
         this.emit("play_lane_b");
       }, this.config.transitionGapMs);
-    } else if (this.state === "B_RESPONDING") {
+    } else if (false) {
       // Lane A wasn't triggered or skipped - go straight to B
       this.transitionLaneOwner("none", "B", "b_first_audio_ready");
killedBy: Voice Pipeline Integration Complete Voice Interaction Flow should handle full user utterance → AI response cycle
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "B_PLAYING"
Received: "B_RESPONDING"

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:245:45
       }, this.config.transitionGapMs);
     } else if (this.state === "B_RESPONDING") {
       // Lane A wasn't triggered or skipped - go straight to B
-      this.transitionLaneOwner("none", "B", "b_first_audio_ready");
+      this.transitionLaneOwner("none", "B", "");
       this.transition("B_PLAYING", "b_first_audio_ready");
       this.emit("play_lane_b");
killedBy: LaneArbitrator Lane B ready flow should emit owner_change event
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "b_first_audio_ready"
Received: ""

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:246:36
     } else if (this.state === "B_RESPONDING") {
       // Lane A wasn't triggered or skipped - go straight to B
       this.transitionLaneOwner("none", "B", "b_first_audio_ready");
-      this.transition("B_PLAYING", "b_first_audio_ready");
+      this.transition("B_PLAYING", "");
       this.emit("play_lane_b");
     }

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:257:7
    */
   onLaneBDone(): void {
     console.log(
-      `[LaneArbitrator] Lane B done signal received ` +
+      `` +
         `(state: ${this.state}, responseInProgress: ${this.responseInProgress})`,
     );

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:258:9
   onLaneBDone(): void {
     console.log(
       `[LaneArbitrator] Lane B done signal received ` +
-        `(state: ${this.state}, responseInProgress: ${this.responseInProgress})`,
+        ``,
     );
 

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:261:9
         `(state: ${this.state}, responseInProgress: ${this.responseInProgress})`,
     );
 
-    if (this.suppressLaneBDone) {
+    if (true) {
       console.log(
         `[LaneArbitrator] Lane B done suppressed after policy cancel`,
killedBy: LaneArbitrator Response In-Progress Guard should clear response guard on Lane B done
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[NoCoverage] BlockStatement
src/orchestrator/LaneArbitrator.ts:261:33
         `(state: ${this.state}, responseInProgress: ${this.responseInProgress})`,
     );
 
-    if (this.suppressLaneBDone) {
-      console.log(
-        `[LaneArbitrator] Lane B done suppressed after policy cancel`,
-      );
-      this.suppressLaneBDone = false;
-      return;
-    }
+    if (this.suppressLaneBDone) {}
 
     if (this.state === "FALLBACK_PLAYING") {

[NoCoverage] BooleanLiteral
src/orchestrator/LaneArbitrator.ts:265:32
       console.log(
         `[LaneArbitrator] Lane B done suppressed after policy cancel`,
       );
-      this.suppressLaneBDone = false;
+      this.suppressLaneBDone = true;
       return;
     }

[NoCoverage] StringLiteral
src/orchestrator/LaneArbitrator.ts:271:9
 
     if (this.state === "FALLBACK_PLAYING") {
       console.log(
-        `[LaneArbitrator] Lane B done during fallback playback - ignoring`,
+        ``,
       );
       return;

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:277:37
     }
 
     // Case 1: Expected happy path - response completed while playing
-    if (this.state === "B_PLAYING") {
-      console.log(`[LaneArbitrator] Lane B response complete (normal flow)`);
-      this.transitionLaneOwner("B", "none", "response_done");
-      this.transition("LISTENING", "response_done");
-      this.responseInProgress = false;
-      this.emit("response_complete");
-      return;
-    }
+    if (this.state === "B_PLAYING") {}
 
     // Case 2: Response completed before audio started playing
killedBy: LaneArbitrator Event Bus Integration should emit lane.owner_changed events
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test while waiting for `done()` to be called.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] EqualityOperator
src/orchestrator/LaneArbitrator.ts:277:9
     }
 
     // Case 1: Expected happy path - response completed while playing
-    if (this.state === "B_PLAYING") {
+    if (this.state !== "B_PLAYING") {
       console.log(`[LaneArbitrator] Lane B response complete (normal flow)`);
       this.transitionLaneOwner("B", "none", "response_done");
killedBy: LaneArbitrator onLaneBDone - Case 3: Response Completes During A_PLAYING should stop Lane A when Lane B done before preemption
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:279:32
     // Case 1: Expected happy path - response completed while playing
     if (this.state === "B_PLAYING") {
       console.log(`[LaneArbitrator] Lane B response complete (normal flow)`);
-      this.transitionLaneOwner("B", "none", "response_done");
+      this.transitionLaneOwner("", "none", "response_done");
       this.transition("LISTENING", "response_done");
       this.responseInProgress = false;
