[Killed] BooleanLiteral
src/orchestrator/LaneArbitrator.ts:281:33
       console.log(`[LaneArbitrator] Lane B response complete (normal flow)`);
       this.transitionLaneOwner("B", "none", "response_done");
       this.transition("LISTENING", "response_done");
-      this.responseInProgress = false;
+      this.responseInProgress = true;
       this.emit("response_complete");
       return;
killedBy: LaneArbitrator Response In-Progress Guard should clear response guard on Lane B done
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/orchestrator/LaneArbitrator.ts:289:9
     // Case 2: Response completed before audio started playing
     // This happens when: buffer commit failed → no state transition →
     // but OpenAI sent response anyway (error recovery)
-    if (this.state === "LISTENING" || this.state === "B_RESPONDING") {
+    if (this.state !== "LISTENING" || this.state === "B_RESPONDING") {
       console.log(
         `[LaneArbitrator] Lane B done in ${this.state} ` +
killedBy: LaneArbitrator onLaneBDone - Case 3: Response Completes During A_PLAYING should stop Lane A when Lane B done before preemption
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
src/orchestrator/LaneArbitrator.ts:289:39
     // Case 2: Response completed before audio started playing
     // This happens when: buffer commit failed → no state transition →
     // but OpenAI sent response anyway (error recovery)
-    if (this.state === "LISTENING" || this.state === "B_RESPONDING") {
+    if (this.state === "LISTENING" || this.state !== "B_RESPONDING") {
       console.log(
         `[LaneArbitrator] Lane B done in ${this.state} ` +
killedBy: LaneArbitrator onLaneBDone - Case 3: Response Completes During A_PLAYING should stop Lane A when Lane B done before preemption
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:296:42
       );
 
       // Ensure we're in LISTENING state
-      if (this.state === "B_RESPONDING") {
-        this.transition("LISTENING", "response_done");
-      }
+      if (this.state === "B_RESPONDING") {}
 
       // Clear response guard to allow next utterance
killedBy: LaneArbitrator onLaneBDone - Case 2: Commit Failed / Fast Response should handle response complete in B_RESPONDING (fast response)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LISTENING"
Received: "B_RESPONDING"

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:296:11
       );
 
       // Ensure we're in LISTENING state
-      if (this.state === "B_RESPONDING") {
+      if (false) {
         this.transition("LISTENING", "response_done");
       }
killedBy: LaneArbitrator onLaneBDone - Case 2: Commit Failed / Fast Response should handle response complete in B_RESPONDING (fast response)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LISTENING"
Received: "B_RESPONDING"

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:297:38
 
       // Ensure we're in LISTENING state
       if (this.state === "B_RESPONDING") {
-        this.transition("LISTENING", "response_done");
+        this.transition("LISTENING", "");
       }
 

[Killed] BooleanLiteral
src/orchestrator/LaneArbitrator.ts:301:33
       }
 
       // Clear response guard to allow next utterance
-      this.responseInProgress = false;
+      this.responseInProgress = true;
 
       // Still emit completion for cleanup
killedBy: LaneArbitrator onLaneBDone - Case 2: Commit Failed / Fast Response should handle response complete in LISTENING (commit failed)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/orchestrator/LaneArbitrator.ts:309:9
     }
 
     // Case 3: Got done in A_PLAYING (B never took over)
-    if (this.state === "A_PLAYING") {
+    if (this.state !== "A_PLAYING") {
       console.log(
         `[LaneArbitrator] Lane B done while A playing ` +
killedBy: LaneArbitrator onLaneBDone - Case 3: Response Completes During A_PLAYING should stop Lane A when Lane B done before preemption
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:309:37
     }
 
     // Case 3: Got done in A_PLAYING (B never took over)
-    if (this.state === "A_PLAYING") {
-      console.log(
-        `[LaneArbitrator] Lane B done while A playing ` +
-          `(B completed before preempting A - unusual but valid)`,
-      );
-
-      // Stop Lane A since B is done
-      this.emit("stop_reflex");
-      this.transitionLaneOwner("A", "none", "response_done");
-      this.transition("LISTENING", "response_done");
-      this.responseInProgress = false;
-      this.emit("response_complete");
-      return;
-    }
+    if (this.state === "A_PLAYING") {}
 
     // Case 4: Unexpected states (defensive)
killedBy: LaneArbitrator onLaneBDone - Case 3: Response Completes During A_PLAYING should stop Lane A when Lane B done before preemption
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:317:32
 
       // Stop Lane A since B is done
       this.emit("stop_reflex");
-      this.transitionLaneOwner("A", "none", "response_done");
+      this.transitionLaneOwner("", "none", "response_done");
       this.transition("LISTENING", "response_done");
       this.responseInProgress = false;

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:318:36
       // Stop Lane A since B is done
       this.emit("stop_reflex");
       this.transitionLaneOwner("A", "none", "response_done");
-      this.transition("LISTENING", "response_done");
+      this.transition("LISTENING", "");
       this.responseInProgress = false;
       this.emit("response_complete");

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:326:7
 
     // Case 4: Unexpected states (defensive)
     console.warn(
-      `[LaneArbitrator] Lane B done in unexpected state: ${this.state} ` +
+      `` +
         `(forcing reset to LISTENING)`,
     );

[Killed] LogicalOperator
src/orchestrator/LaneArbitrator.ts:332:9
 
     // Force state to safe ground
     this.clearTimers();
-    if (this.state !== "IDLE" && this.state !== "ENDED") {
+    if (this.state !== "IDLE" || this.state !== "ENDED") {
       this.transition("LISTENING", "response_done");
     }
killedBy: LaneArbitrator onLaneBDone - Case 4: Defensive Reset should NOT reset ENDED state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ENDED"
Received: "LISTENING"

[Killed] EqualityOperator
src/orchestrator/LaneArbitrator.ts:332:34
 
     // Force state to safe ground
     this.clearTimers();
-    if (this.state !== "IDLE" && this.state !== "ENDED") {
+    if (this.state !== "IDLE" && this.state === "ENDED") {
       this.transition("LISTENING", "response_done");
     }
killedBy: LaneArbitrator onLaneBDone - Case 4: Defensive Reset should NOT reset ENDED state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ENDED"
Received: "LISTENING"

[NoCoverage] StringLiteral
src/orchestrator/LaneArbitrator.ts:333:36
     // Force state to safe ground
     this.clearTimers();
     if (this.state !== "IDLE" && this.state !== "ENDED") {
-      this.transition("LISTENING", "response_done");
+      this.transition("LISTENING", "");
     }
     this.responseInProgress = false;

[Survived] BooleanLiteral
src/orchestrator/LaneArbitrator.ts:335:31
     if (this.state !== "IDLE" && this.state !== "ENDED") {
       this.transition("LISTENING", "response_done");
     }
-    this.responseInProgress = false;
+    this.responseInProgress = true;
     this.emit("response_complete");
   }

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:343:35
    * Reset response in progress guard (for error recovery)
    * Called when commit fails and response won't happen
    */
-  resetResponseInProgress(): void {
-    if (this.responseInProgress) {
-      console.log(
-        `[LaneArbitrator] Resetting response cycle guard ` +
-          `(external trigger - commit likely failed)`,
-      );
-      this.responseInProgress = false;
-      this.clearTimers();
-
-      // Return to listening if not already there
-      if (this.state === "B_RESPONDING") {
-        this.transition("LISTENING", "user_speech_ended");
-      }
-    }
-  }
+  resetResponseInProgress(): void {}
 
   /**
killedBy: Voice Pipeline Integration Error Handling Integration should handle commit failure gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LISTENING"
Received: "B_RESPONDING"

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:344:34
    * Called when commit fails and response won't happen
    */
   resetResponseInProgress(): void {
-    if (this.responseInProgress) {
-      console.log(
-        `[LaneArbitrator] Resetting response cycle guard ` +
-          `(external trigger - commit likely failed)`,
-      );
-      this.responseInProgress = false;
-      this.clearTimers();
-
-      // Return to listening if not already there
-      if (this.state === "B_RESPONDING") {
-        this.transition("LISTENING", "user_speech_ended");
-      }
-    }
+    if (this.responseInProgress) {}
   }
 
killedBy: Voice Pipeline Integration Error Handling Integration should handle commit failure gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LISTENING"
Received: "B_RESPONDING"

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:344:9
    * Called when commit fails and response won't happen
    */
   resetResponseInProgress(): void {
-    if (this.responseInProgress) {
+    if (false) {
       console.log(
         `[LaneArbitrator] Resetting response cycle guard ` +
killedBy: Voice Pipeline Integration Error Handling Integration should handle commit failure gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LISTENING"
Received: "B_RESPONDING"

[Killed] BooleanLiteral
src/orchestrator/LaneArbitrator.ts:349:33
         `[LaneArbitrator] Resetting response cycle guard ` +
           `(external trigger - commit likely failed)`,
       );
-      this.responseInProgress = false;
+      this.responseInProgress = true;
       this.clearTimers();
 
killedBy: Voice Pipeline Integration Error Handling Integration should handle commit failure gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/orchestrator/LaneArbitrator.ts:353:11
       this.clearTimers();
 
       // Return to listening if not already there
-      if (this.state === "B_RESPONDING") {
+      if (this.state !== "B_RESPONDING") {
         this.transition("LISTENING", "user_speech_ended");
       }
killedBy: Voice Pipeline Integration Error Handling Integration should handle commit failure gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LISTENING"
Received: "B_RESPONDING"

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:353:42
       this.clearTimers();
 
       // Return to listening if not already there
-      if (this.state === "B_RESPONDING") {
-        this.transition("LISTENING", "user_speech_ended");
-      }
+      if (this.state === "B_RESPONDING") {}
     }
   }
killedBy: Voice Pipeline Integration Error Handling Integration should handle commit failure gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LISTENING"
Received: "B_RESPONDING"

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:362:25
   /**
    * Handle user barge-in - stops any playing audio
    */
-  onUserBargeIn(): void {
-    console.log(`[LaneArbitrator] User barge-in during ${this.state}`);
-
-    this.clearTimers();
-
-    if (this.state === "A_PLAYING") {
-      this.emit("stop_reflex");
-      this.transitionLaneOwner("A", "none", "user_barge_in");
-    } else if (this.state === "B_PLAYING") {
-      this.emit("stop_lane_b");
-      this.transitionLaneOwner("B", "none", "user_barge_in");
-    } else if (this.state === "FALLBACK_PLAYING") {
-      this.emit("stop_fallback");
-      this.transitionLaneOwner("fallback", "none", "user_barge_in");
-    }
-
-    // Clear the response cycle guard - barge-in cancels current cycle
-    this.responseInProgress = false;
-
-    // Return to listening
-    if (this.state !== "IDLE" && this.state !== "ENDED") {
-      this.transition("LISTENING", "user_barge_in");
-    }
-  }
+  onUserBargeIn(): void {}
 
   /**
killedBy: Voice Pipeline Integration User Barge-In Integration should handle barge-in during Lane B playback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:363:17
    * Handle user barge-in - stops any playing audio
    */
   onUserBargeIn(): void {
-    console.log(`[LaneArbitrator] User barge-in during ${this.state}`);
+    console.log(``);
 
     this.clearTimers();

[Killed] EqualityOperator
src/orchestrator/LaneArbitrator.ts:367:9
 
     this.clearTimers();
 
-    if (this.state === "A_PLAYING") {
+    if (this.state !== "A_PLAYING") {
       this.emit("stop_reflex");
       this.transitionLaneOwner("A", "none", "user_barge_in");
killedBy: LaneArbitrator barge-in handling should emit stop_reflex on barge-in during Lane A
statusReason: Error: thrown: "Exceeded timeout of 500 ms for a test while waiting for `done()` to be called.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:367:9
 
     this.clearTimers();
 
-    if (this.state === "A_PLAYING") {
+    if (true) {
       this.emit("stop_reflex");
       this.transitionLaneOwner("A", "none", "user_barge_in");
killedBy: Voice Pipeline Integration User Barge-In Integration should handle barge-in during Lane B playback
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:368:17
     this.clearTimers();
 
     if (this.state === "A_PLAYING") {
-      this.emit("stop_reflex");
+      this.emit("");
       this.transitionLaneOwner("A", "none", "user_barge_in");
     } else if (this.state === "B_PLAYING") {
killedBy: LaneArbitrator barge-in handling should emit stop_reflex on barge-in during Lane A
statusReason: Error: thrown: "Exceeded timeout of 500 ms for a test while waiting for `done()` to be called.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:370:16
     if (this.state === "A_PLAYING") {
       this.emit("stop_reflex");
       this.transitionLaneOwner("A", "none", "user_barge_in");
-    } else if (this.state === "B_PLAYING") {
+    } else if (true) {
       this.emit("stop_lane_b");
       this.transitionLaneOwner("B", "none", "user_barge_in");
killedBy: LaneArbitrator FALLBACK_PLAYING state — barge-in and policy cancel barge-in from FALLBACK_PLAYING emits stop_fallback and returns to LISTENING
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "stop_fallback"
Received array: []

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:370:44
     if (this.state === "A_PLAYING") {
       this.emit("stop_reflex");
       this.transitionLaneOwner("A", "none", "user_barge_in");
-    } else if (this.state === "B_PLAYING") {
-      this.emit("stop_lane_b");
-      this.transitionLaneOwner("B", "none", "user_barge_in");
-    } else if (this.state === "FALLBACK_PLAYING") {
+    } else if (this.state === "B_PLAYING") {} else if (this.state === "FALLBACK_PLAYING") {
       this.emit("stop_fallback");
       this.transitionLaneOwner("fallback", "none", "user_barge_in");
killedBy: LaneArbitrator User Barge-In Handling should stop Lane B on barge-in
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:371:17
       this.emit("stop_reflex");
       this.transitionLaneOwner("A", "none", "user_barge_in");
     } else if (this.state === "B_PLAYING") {
-      this.emit("stop_lane_b");
+      this.emit("");
       this.transitionLaneOwner("B", "none", "user_barge_in");
     } else if (this.state === "FALLBACK_PLAYING") {
killedBy: LaneArbitrator User Barge-In Handling should stop Lane B on barge-in
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:372:32
       this.transitionLaneOwner("A", "none", "user_barge_in");
     } else if (this.state === "B_PLAYING") {
       this.emit("stop_lane_b");
-      this.transitionLaneOwner("B", "none", "user_barge_in");
+      this.transitionLaneOwner("", "none", "user_barge_in");
     } else if (this.state === "FALLBACK_PLAYING") {
       this.emit("stop_fallback");
killedBy: LaneArbitrator User Barge-In Handling should emit owner_change on barge-in
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "B"
Received: ""

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:373:16
     } else if (this.state === "B_PLAYING") {
       this.emit("stop_lane_b");
       this.transitionLaneOwner("B", "none", "user_barge_in");
-    } else if (this.state === "FALLBACK_PLAYING") {
+    } else if (false) {
       this.emit("stop_fallback");
       this.transitionLaneOwner("fallback", "none", "user_barge_in");
killedBy: LaneArbitrator FALLBACK_PLAYING state — barge-in and policy cancel barge-in from FALLBACK_PLAYING emits stop_fallback and returns to LISTENING
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "stop_fallback"
Received array: []

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:373:51
     } else if (this.state === "B_PLAYING") {
       this.emit("stop_lane_b");
       this.transitionLaneOwner("B", "none", "user_barge_in");
-    } else if (this.state === "FALLBACK_PLAYING") {
-      this.emit("stop_fallback");
-      this.transitionLaneOwner("fallback", "none", "user_barge_in");
-    }
+    } else if (this.state === "FALLBACK_PLAYING") {}
 
     // Clear the response cycle guard - barge-in cancels current cycle
killedBy: LaneArbitrator FALLBACK_PLAYING state — barge-in and policy cancel barge-in from FALLBACK_PLAYING emits stop_fallback and returns to LISTENING
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "stop_fallback"
Received array: []

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:374:17
       this.emit("stop_lane_b");
       this.transitionLaneOwner("B", "none", "user_barge_in");
     } else if (this.state === "FALLBACK_PLAYING") {
-      this.emit("stop_fallback");
+      this.emit("");
       this.transitionLaneOwner("fallback", "none", "user_barge_in");
     }
killedBy: LaneArbitrator FALLBACK_PLAYING state — barge-in and policy cancel barge-in from FALLBACK_PLAYING emits stop_fallback and returns to LISTENING
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "stop_fallback"
Received array: []

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:375:32
       this.transitionLaneOwner("B", "none", "user_barge_in");
     } else if (this.state === "FALLBACK_PLAYING") {
       this.emit("stop_fallback");
-      this.transitionLaneOwner("fallback", "none", "user_barge_in");
+      this.transitionLaneOwner("", "none", "user_barge_in");
     }
 

[Killed] BooleanLiteral
src/orchestrator/LaneArbitrator.ts:379:31
     }
 
     // Clear the response cycle guard - barge-in cancels current cycle
-    this.responseInProgress = false;
+    this.responseInProgress = true;
 
     // Return to listening
killedBy: LaneArbitrator Response In-Progress Guard should clear response guard on barge-in
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/orchestrator/LaneArbitrator.ts:382:9
     this.responseInProgress = false;
 
     // Return to listening
-    if (this.state !== "IDLE" && this.state !== "ENDED") {
+    if (this.state === "IDLE" && this.state !== "ENDED") {
       this.transition("LISTENING", "user_barge_in");
     }
killedBy: LaneArbitrator barge-in handling should transition to LISTENING on barge-in from A_PLAYING
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LISTENING"
Received: "A_PLAYING"

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:382:58
     this.responseInProgress = false;
 
     // Return to listening
-    if (this.state !== "IDLE" && this.state !== "ENDED") {
-      this.transition("LISTENING", "user_barge_in");
-    }
+    if (this.state !== "IDLE" && this.state !== "ENDED") {}
   }
 
killedBy: LaneArbitrator barge-in handling should transition to LISTENING on barge-in from A_PLAYING
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LISTENING"
Received: "A_PLAYING"

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:391:17
    * Handle policy cancel - stops any playing audio and triggers fallback.
    */
   onPolicyCancel(): void {
-    console.log(`[LaneArbitrator] Policy cancel during ${this.state}`);
+    console.log(``);
 
     this.clearTimers();

[Survived] BooleanLiteral
src/orchestrator/LaneArbitrator.ts:399:32
       console.log(
         `[LaneArbitrator] Policy cancel ignored - fallback already playing`,
       );
-      this.suppressLaneBDone = true;
+      this.suppressLaneBDone = false;
       this.emit("stop_lane_b");
       return;

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:400:17
         `[LaneArbitrator] Policy cancel ignored - fallback already playing`,
       );
       this.suppressLaneBDone = true;
-      this.emit("stop_lane_b");
+      this.emit("");
       return;
     }

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:406:9
 
     const previousOwner = this.getCurrentOwner();
 
-    if (this.state === "A_PLAYING") {
+    if (false) {
       this.emit("stop_reflex");
     }
killedBy: Lane C Policy Cancel and Fallback Integration when Lane A is playing should stop Lane A, trigger fallback, and log audit events
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "stop_reflex"
Received array: ["play_fallback"]

[Killed] LogicalOperator
src/orchestrator/LaneArbitrator.ts:411:7
     }
 
     if (
-      this.state === "B_PLAYING" ||
-      this.state === "B_RESPONDING" ||
+      this.state === "B_PLAYING" && this.state === "B_RESPONDING" ||
       this.state === "A_PLAYING"
     ) {
killedBy: Lane C Policy Cancel and Fallback Integration when Lane B is playing should stop Lane B, trigger fallback, and log audit events
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "stop_lane_b"
Received array: ["play_fallback"]

[Killed] EqualityOperator
src/orchestrator/LaneArbitrator.ts:411:7
     }
 
     if (
-      this.state === "B_PLAYING" ||
+      this.state !== "B_PLAYING" ||
       this.state === "B_RESPONDING" ||
       this.state === "A_PLAYING"
killedBy: Lane C Policy Cancel and Fallback Integration when Lane B is playing should stop Lane B, trigger fallback, and log audit events
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "stop_lane_b"
Received array: ["play_fallback"]

[Survived] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:412:7
 
     if (
       this.state === "B_PLAYING" ||
-      this.state === "B_RESPONDING" ||
+      false ||
       this.state === "A_PLAYING"
     ) {

[Survived] EqualityOperator
src/orchestrator/LaneArbitrator.ts:412:7
 
     if (
       this.state === "B_PLAYING" ||
-      this.state === "B_RESPONDING" ||
+      this.state !== "B_RESPONDING" ||
       this.state === "A_PLAYING"
     ) {

[Survived] EqualityOperator
src/orchestrator/LaneArbitrator.ts:413:7
     if (
       this.state === "B_PLAYING" ||
       this.state === "B_RESPONDING" ||
-      this.state === "A_PLAYING"
+      this.state !== "A_PLAYING"
     ) {
       this.suppressLaneBDone = true;

[Survived] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:413:7
     if (
       this.state === "B_PLAYING" ||
       this.state === "B_RESPONDING" ||
-      this.state === "A_PLAYING"
+      false
     ) {
       this.suppressLaneBDone = true;

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:414:7
       this.state === "B_PLAYING" ||
       this.state === "B_RESPONDING" ||
       this.state === "A_PLAYING"
-    ) {
-      this.suppressLaneBDone = true;
-      this.emit("stop_lane_b");
-    }
+    ) {}
 
     // Move to fallback playback
killedBy: Lane C Policy Cancel and Fallback Integration when Lane B is playing should stop Lane B, trigger fallback, and log audit events
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "stop_lane_b"
Received array: ["play_fallback"]

[Survived] BooleanLiteral
src/orchestrator/LaneArbitrator.ts:415:32
       this.state === "B_RESPONDING" ||
       this.state === "A_PLAYING"
     ) {
-      this.suppressLaneBDone = true;
+      this.suppressLaneBDone = false;
       this.emit("stop_lane_b");
     }

[Killed] EqualityOperator
src/orchestrator/LaneArbitrator.ts:420:34
     }
 
     // Move to fallback playback
-    if (this.state !== "IDLE" && this.state !== "ENDED") {
+    if (this.state !== "IDLE" && this.state === "ENDED") {
       this.transitionLaneOwner(previousOwner, "fallback", "policy_cancel");
       this.transition("FALLBACK_PLAYING", "policy_cancel");
killedBy: LaneArbitrator FALLBACK_PLAYING state — barge-in and policy cancel barge-in from FALLBACK_PLAYING emits stop_fallback and returns to LISTENING
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FALLBACK_PLAYING"
Received: "B_PLAYING"

[Killed] EqualityOperator
src/orchestrator/LaneArbitrator.ts:420:9
     }
 
     // Move to fallback playback
-    if (this.state !== "IDLE" && this.state !== "ENDED") {
+    if (this.state === "IDLE" && this.state !== "ENDED") {
       this.transitionLaneOwner(previousOwner, "fallback", "policy_cancel");
       this.transition("FALLBACK_PLAYING", "policy_cancel");
killedBy: LaneArbitrator FALLBACK_PLAYING state — barge-in and policy cancel barge-in from FALLBACK_PLAYING emits stop_fallback and returns to LISTENING
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FALLBACK_PLAYING"
Received: "B_PLAYING"

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:421:47
 
     // Move to fallback playback
     if (this.state !== "IDLE" && this.state !== "ENDED") {
-      this.transitionLaneOwner(previousOwner, "fallback", "policy_cancel");
+      this.transitionLaneOwner(previousOwner, "", "policy_cancel");
       this.transition("FALLBACK_PLAYING", "policy_cancel");
       this.responseInProgress = true;
killedBy: Lane C Policy Cancel and Fallback Integration when Lane B is playing should stop Lane B, trigger fallback, and log audit events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"payload": ObjectContaining {"from": "B", "to": "fallback", "trigger": "policy_cancel"}, "type": "arbitration.owner.transition"}
Received
       1: {"event_id": "fcc8c624-0539-42b9-bd02-0b961cea43c4", "payload": {"from": "IDLE", "to": "LISTENING", "trigger": "session_start"}, "session_id": "policy-test-session"

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:422:23
     // Move to fallback playback
     if (this.state !== "IDLE" && this.state !== "ENDED") {
       this.transitionLaneOwner(previousOwner, "fallback", "policy_cancel");
-      this.transition("FALLBACK_PLAYING", "policy_cancel");
+      this.transition("", "policy_cancel");
       this.responseInProgress = true;
       this.emit("play_fallback");
killedBy: Lane C Policy Cancel and Fallback Integration when Lane B is playing should stop Lane B, trigger fallback, and log audit events
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FALLBACK_PLAYING"
Received: ""
