[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:422:43
     // Move to fallback playback
     if (this.state !== "IDLE" && this.state !== "ENDED") {
       this.transitionLaneOwner(previousOwner, "fallback", "policy_cancel");
-      this.transition("FALLBACK_PLAYING", "policy_cancel");
+      this.transition("FALLBACK_PLAYING", "");
       this.responseInProgress = true;
       this.emit("play_fallback");
killedBy: Lane C Policy Cancel and Fallback Integration when Lane B is playing should stop Lane B, trigger fallback, and log audit events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"payload": ObjectContaining {"from": "B_PLAYING", "to": "FALLBACK_PLAYING", "trigger": "policy_cancel"}, "type": "arbitration.state.transition"}
Received
       1: {"event_id": "220e3c06-de0e-4760-b20d-4065ae07a948", "payload": {"from": "IDLE", "to": "LISTENING", "trigger": "session_start"}, "session_id": "poli

[Survived] BooleanLiteral
src/orchestrator/LaneArbitrator.ts:423:33
     if (this.state !== "IDLE" && this.state !== "ENDED") {
       this.transitionLaneOwner(previousOwner, "fallback", "policy_cancel");
       this.transition("FALLBACK_PLAYING", "policy_cancel");
-      this.responseInProgress = true;
+      this.responseInProgress = false;
       this.emit("play_fallback");
     }

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:424:17
       this.transitionLaneOwner(previousOwner, "fallback", "policy_cancel");
       this.transition("FALLBACK_PLAYING", "policy_cancel");
       this.responseInProgress = true;
-      this.emit("play_fallback");
+      this.emit("");
     }
   }
killedBy: Lane C Policy Cancel and Fallback Integration when Lane B is playing should stop Lane B, trigger fallback, and log audit events
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "play_fallback"
Received array: ["stop_lane_b"]

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:431:30
   /**
    * Handle fallback completion - return to listening state.
    */
-  onFallbackComplete(): void {
-    console.log(`[LaneArbitrator] Fallback playback complete`);
-
-    if (this.getCurrentOwner() === "fallback") {
-      this.transitionLaneOwner("fallback", "none", "response_done");
-    }
-
-    if (this.state !== "IDLE" && this.state !== "ENDED") {
-      this.transition("LISTENING", "response_done");
-    }
-
-    this.responseInProgress = false;
-    this.suppressLaneBDone = false;
-    this.emit("response_complete");
-  }
+  onFallbackComplete(): void {}
 
   /**
killedBy: Lane C Policy Cancel and Fallback Integration Fallback Execution should transition to LISTENING after fallback completes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LISTENING"
Received: "FALLBACK_PLAYING"

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:432:17
    * Handle fallback completion - return to listening state.
    */
   onFallbackComplete(): void {
-    console.log(`[LaneArbitrator] Fallback playback complete`);
+    console.log(``);
 
     if (this.getCurrentOwner() === "fallback") {

[Survived] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:434:9
   onFallbackComplete(): void {
     console.log(`[LaneArbitrator] Fallback playback complete`);
 
-    if (this.getCurrentOwner() === "fallback") {
+    if (true) {
       this.transitionLaneOwner("fallback", "none", "response_done");
     }

[Survived] BlockStatement
src/orchestrator/LaneArbitrator.ts:434:48
   onFallbackComplete(): void {
     console.log(`[LaneArbitrator] Fallback playback complete`);
 
-    if (this.getCurrentOwner() === "fallback") {
-      this.transitionLaneOwner("fallback", "none", "response_done");
-    }
+    if (this.getCurrentOwner() === "fallback") {}
 
     if (this.state !== "IDLE" && this.state !== "ENDED") {

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:435:32
     console.log(`[LaneArbitrator] Fallback playback complete`);
 
     if (this.getCurrentOwner() === "fallback") {
-      this.transitionLaneOwner("fallback", "none", "response_done");
+      this.transitionLaneOwner("", "none", "response_done");
     }
 

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:435:52
     console.log(`[LaneArbitrator] Fallback playback complete`);
 
     if (this.getCurrentOwner() === "fallback") {
-      this.transitionLaneOwner("fallback", "none", "response_done");
+      this.transitionLaneOwner("fallback", "none", "");
     }
 

[Killed] EqualityOperator
src/orchestrator/LaneArbitrator.ts:438:9
       this.transitionLaneOwner("fallback", "none", "response_done");
     }
 
-    if (this.state !== "IDLE" && this.state !== "ENDED") {
+    if (this.state === "IDLE" && this.state !== "ENDED") {
       this.transition("LISTENING", "response_done");
     }
killedBy: Lane C Policy Cancel and Fallback Integration Fallback Execution should transition to LISTENING after fallback completes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LISTENING"
Received: "FALLBACK_PLAYING"

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:438:9
       this.transitionLaneOwner("fallback", "none", "response_done");
     }
 
-    if (this.state !== "IDLE" && this.state !== "ENDED") {
+    if (false) {
       this.transition("LISTENING", "response_done");
     }
killedBy: Lane C Policy Cancel and Fallback Integration Fallback Execution should transition to LISTENING after fallback completes
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LISTENING"
Received: "FALLBACK_PLAYING"

[Survived] BooleanLiteral
src/orchestrator/LaneArbitrator.ts:442:31
       this.transition("LISTENING", "response_done");
     }
 
-    this.responseInProgress = false;
+    this.responseInProgress = true;
     this.suppressLaneBDone = false;
     this.emit("response_complete");

[Survived] BooleanLiteral
src/orchestrator/LaneArbitrator.ts:443:30
     }
 
     this.responseInProgress = false;
-    this.suppressLaneBDone = false;
+    this.suppressLaneBDone = true;
     this.emit("response_complete");
   }

[Timeout] BlockStatement
src/orchestrator/LaneArbitrator.ts:457:11
       | "session_start"
       | "session_end"
       | "user_speech_ended",
-  ): void {
-    const oldState = this.state;
-    this.state = newState;
-
-    const transition: StateTransition = {
-      from: oldState,
-      to: newState,
-      cause,
-      timestamp: Date.now(),
-    };
-
-    this.stateHistory.push(transition);
-    console.log(
-      `[LaneArbitrator] ${oldState} -> ${newState} (cause: ${cause})`,
-    );
-
-    this.logAuditEvent("arbitration.state.transition", {
-      from: oldState,
-      to: newState,
-      trigger: cause,
-    });
-
-    this.emit("state_change", transition);
-  }
+  ): void {}
 
   /**

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:473:24
       `[LaneArbitrator] ${oldState} -> ${newState} (cause: ${cause})`,
     );
 
-    this.logAuditEvent("arbitration.state.transition", {
+    this.logAuditEvent("", {
       from: oldState,
       to: newState,
killedBy: Lane C Policy Cancel and Fallback Integration when Lane B is playing should stop Lane B, trigger fallback, and log audit events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"payload": ObjectContaining {"from": "B_PLAYING", "to": "FALLBACK_PLAYING", "trigger": "policy_cancel"}, "type": "arbitration.state.transition"}
Received
       1: {"event_id": "bd65e7c0-badc-4eff-aa77-d69e0fd25f16", "payload": {"from": "IDLE", "to": "LISTENING", "trigger": "session_start"}, "session_id": "poli

[Killed] ObjectLiteral
src/orchestrator/LaneArbitrator.ts:473:56
       `[LaneArbitrator] ${oldState} -> ${newState} (cause: ${cause})`,
     );
 
-    this.logAuditEvent("arbitration.state.transition", {
-      from: oldState,
-      to: newState,
-      trigger: cause,
-    });
+    this.logAuditEvent("arbitration.state.transition", {});
 
     this.emit("state_change", transition);
killedBy: Lane C Policy Cancel and Fallback Integration when Lane B is playing should stop Lane B, trigger fallback, and log audit events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"payload": ObjectContaining {"from": "B_PLAYING", "to": "FALLBACK_PLAYING", "trigger": "policy_cancel"}, "type": "arbitration.state.transition"}
Received
       1: {"event_id": "9324a1a8-049b-42d3-b36d-d75cd0de85cc", "payload": {}, "session_id": "policy-test-session", "source": "orchestrator", "t_ms": 177407849

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:489:11
     from: Lane,
     to: Lane,
     cause: LaneTransitionCause,
-  ): void {
-    const event: LaneOwnerChangedEvent = {
-      event_id: uuidv4(),
-      session_id: this.sessionId,
-      t_ms: Date.now(),
-      source: "orchestrator",
-      type: "lane.owner_changed",
-      payload: { from, to, cause },
-    };
-
-    eventBus.emit(event);
-    this.emit("owner_change", { from, to, cause });
-    console.log(`[LaneArbitrator] Lane owner: ${from} -> ${to} (${cause})`);
-
-    this.logAuditEvent("arbitration.owner.transition", {
-      from,
-      to,
-      trigger: cause,
-    });
-  }
+  ): void {}
 
   private logAuditEvent(
killedBy: LaneArbitrator Lane B Preemption should emit owner_change event on preemption
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test while waiting for `done()` to be called.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:495:13
       session_id: this.sessionId,
       t_ms: Date.now(),
       source: "orchestrator",
-      type: "lane.owner_changed",
+      type: "",
       payload: { from, to, cause },
     };

[Killed] ObjectLiteral
src/orchestrator/LaneArbitrator.ts:503:56
     this.emit("owner_change", { from, to, cause });
     console.log(`[LaneArbitrator] Lane owner: ${from} -> ${to} (${cause})`);
 
-    this.logAuditEvent("arbitration.owner.transition", {
-      from,
-      to,
-      trigger: cause,
-    });
+    this.logAuditEvent("arbitration.owner.transition", {});
   }
 
killedBy: Lane C Policy Cancel and Fallback Integration when Lane B is playing should stop Lane B, trigger fallback, and log audit events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"payload": ObjectContaining {"from": "B", "to": "fallback", "trigger": "policy_cancel"}, "type": "arbitration.owner.transition"}
Received
       1: {"event_id": "21a1ac3a-ff76-446c-86c0-361c6e39cdc0", "payload": {"from": "IDLE", "to": "LISTENING", "trigger": "session_start"}, "session_id": "policy-test-session"

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:503:24
     this.emit("owner_change", { from, to, cause });
     console.log(`[LaneArbitrator] Lane owner: ${from} -> ${to} (${cause})`);
 
-    this.logAuditEvent("arbitration.owner.transition", {
+    this.logAuditEvent("", {
       from,
       to,
killedBy: Lane C Policy Cancel and Fallback Integration when Lane B is playing should stop Lane B, trigger fallback, and log audit events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"payload": ObjectContaining {"from": "B", "to": "fallback", "trigger": "policy_cancel"}, "type": "arbitration.owner.transition"}
Received
       1: {"event_id": "88a1ff09-cfc9-44c9-8a92-893a28b76bc7", "payload": {"from": "IDLE", "to": "LISTENING", "trigger": "session_start"}, "session_id": "policy-test-session"

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:513:5
   private logAuditEvent(
     type: "arbitration.state.transition" | "arbitration.owner.transition",
     payload: { from: string; to: string; trigger: string },
-  ) {
-    if (!this.auditTrail) return;
-
-    const event: ArbitratorAuditEvent = {
-      event_id: uuidv4(),
-      session_id: this.sessionId,
-      t_ms: Date.now(),
-      source: "orchestrator",
-      type,
-      payload,
-    };
-    this.auditTrail.log(event);
-  }
+  ) {}
 
   /**
killedBy: Lane C Policy Cancel and Fallback Integration when Lane B is playing should stop Lane B, trigger fallback, and log audit events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"payload": ObjectContaining {"from": "B_PLAYING", "to": "FALLBACK_PLAYING", "trigger": "policy_cancel"}, "type": "arbitration.state.transition"}

Number of calls: 0

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:514:9
     type: "arbitration.state.transition" | "arbitration.owner.transition",
     payload: { from: string; to: string; trigger: string },
   ) {
-    if (!this.auditTrail) return;
+    if (true) return;
 
     const event: ArbitratorAuditEvent = {
killedBy: Lane C Policy Cancel and Fallback Integration when Lane B is playing should stop Lane B, trigger fallback, and log audit events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"payload": ObjectContaining {"from": "B_PLAYING", "to": "FALLBACK_PLAYING", "trigger": "policy_cancel"}, "type": "arbitration.state.transition"}

Number of calls: 0

[Timeout] BooleanLiteral
src/orchestrator/LaneArbitrator.ts:514:9
     type: "arbitration.state.transition" | "arbitration.owner.transition",
     payload: { from: string; to: string; trigger: string },
   ) {
-    if (!this.auditTrail) return;
+    if (this.auditTrail) return;
 
     const event: ArbitratorAuditEvent = {

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:530:31
   /**
    * Clear all pending timers
    */
-  private clearTimers(): void {
-    if (this.reflexTimer) {
-      clearTimeout(this.reflexTimer);
-      this.reflexTimer = null;
-    }
-    if (this.reflexTimeoutTimer) {
-      clearTimeout(this.reflexTimeoutTimer);
-      this.reflexTimeoutTimer = null;
-    }
-  }
+  private clearTimers(): void {}
 
   /**
killedBy: LaneArbitrator Error Recovery: resetResponseInProgress should clear timers on reset
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:531:27
    * Clear all pending timers
    */
   private clearTimers(): void {
-    if (this.reflexTimer) {
-      clearTimeout(this.reflexTimer);
-      this.reflexTimer = null;
-    }
+    if (this.reflexTimer) {}
     if (this.reflexTimeoutTimer) {
       clearTimeout(this.reflexTimeoutTimer);
killedBy: LaneArbitrator Error Recovery: resetResponseInProgress should clear timers on reset
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:531:9
    * Clear all pending timers
    */
   private clearTimers(): void {
-    if (this.reflexTimer) {
+    if (false) {
       clearTimeout(this.reflexTimer);
       this.reflexTimer = null;
killedBy: LaneArbitrator Error Recovery: resetResponseInProgress should clear timers on reset
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:535:34
       clearTimeout(this.reflexTimer);
       this.reflexTimer = null;
     }
-    if (this.reflexTimeoutTimer) {
-      clearTimeout(this.reflexTimeoutTimer);
-      this.reflexTimeoutTimer = null;
-    }
+    if (this.reflexTimeoutTimer) {}
   }
 
killedBy: LaneArbitrator Edge Cases should handle session end while in A_PLAYING
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:535:9
       clearTimeout(this.reflexTimer);
       this.reflexTimer = null;
     }
-    if (this.reflexTimeoutTimer) {
+    if (false) {
       clearTimeout(this.reflexTimeoutTimer);
       this.reflexTimeoutTimer = null;
killedBy: LaneArbitrator Edge Cases should handle session end while in A_PLAYING
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:544:40
   /**
    * Get state history for debugging
    */
-  getStateHistory(): StateTransition[] {
-    return [...this.stateHistory];
-  }
+  getStateHistory(): StateTransition[] {}
 
   /**
killedBy: LaneArbitrator State Transitions should track state history
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:555:5
     speechEndTime: number | null;
     bReadyTime: number | null;
     latencyMs: number | null;
-  } {
-    return {
-      speechEndTime: this.speechEndTime,
-      bReadyTime: this.bReadyTime,
-      latencyMs:
-        this.speechEndTime && this.bReadyTime
-          ? this.bReadyTime - this.speechEndTime
-          : null,
-    };
-  }
+  } {}
 }
 
killedBy: LaneArbitrator Timing Metrics should track speech end time
statusReason: TypeError: Cannot read properties of undefined (reading 'speechEndTime')

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:560:9
       speechEndTime: this.speechEndTime,
       bReadyTime: this.bReadyTime,
       latencyMs:
-        this.speechEndTime && this.bReadyTime
+        false
           ? this.bReadyTime - this.speechEndTime
           : null,
killedBy: Voice Pipeline Integration Timing and Performance should track time-to-first-byte (TTFB)
statusReason: Error: expect(received).toBeGreaterThan(expected)

Matcher error: received value must be a number or bigint

Received has value: null

[Survived] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:560:9
       speechEndTime: this.speechEndTime,
       bReadyTime: this.bReadyTime,
       latencyMs:
-        this.speechEndTime && this.bReadyTime
+        true
           ? this.bReadyTime - this.speechEndTime
           : null,

[Killed] ArithmeticOperator
src/orchestrator/LaneArbitrator.ts:561:13
       bReadyTime: this.bReadyTime,
       latencyMs:
         this.speechEndTime && this.bReadyTime
-          ? this.bReadyTime - this.speechEndTime
+          ? this.bReadyTime + this.speechEndTime
           : null,
     };
killedBy: LaneArbitrator TTFB arithmetic correctness latencyMs is bReadyTime MINUS speechEndTime (not plus)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 350
Received: 3400000000350
