[Survived] ArrayDeclaration
src/insurance/allowed_claims_registry.ts:122:9
     let claims = Array.isArray(this.config.claims) ? this.config.claims : [];
     let disallowedPatterns = Array.isArray(this.config.disallowedPatterns)
       ? this.config.disallowedPatterns
-      : [];
+      : ["Stryker was here"];
 
     if (

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:126:8
 
     if (
       this.config.enableFileLoad &&
-      (claims.length === 0 || disallowedPatterns.length === 0)
+      (claims.length !== 0 || disallowedPatterns.length === 0)
     ) {
       const loaded = loadClaimsCatalog(this.config);
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true merges file disallowed_patterns with injected patterns
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:129:11
       (claims.length === 0 || disallowedPatterns.length === 0)
     ) {
       const loaded = loadClaimsCatalog(this.config);
-      if (claims.length === 0 && loaded.claims.length > 0) {
+      if (claims.length !== 0 && loaded.claims.length > 0) {
         claims = loaded.claims;
       }
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] LogicalOperator
src/insurance/allowed_claims_registry.ts:129:11
       (claims.length === 0 || disallowedPatterns.length === 0)
     ) {
       const loaded = loadClaimsCatalog(this.config);
-      if (claims.length === 0 && loaded.claims.length > 0) {
+      if (claims.length === 0 || loaded.claims.length > 0) {
         claims = loaded.claims;
       }
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true prefers injected claims over file when claims array is non-empty
statusReason: Error: expect(received).not.toBeNull()

Received: null

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:132:49
       if (claims.length === 0 && loaded.claims.length > 0) {
         claims = loaded.claims;
       }
-      if (loaded.disallowedPatterns.length > 0) {
-        disallowedPatterns = Array.from(
-          new Set([...loaded.disallowedPatterns, ...disallowedPatterns]),
-        );
-      }
+      if (loaded.disallowedPatterns.length > 0) {}
     }
 
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads disallowed_patterns from file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:151:9
 
     // Index claims into VectorStore for TF-IDF cosine similarity matching.
     // Replaces the word-overlap heuristic in matchText() Pass 2.
-    if (this.claimTexts.length > 0) {
+    if (this.claimTexts.length <= 0) {
       this.vectorStore.index(
         this.claimTexts.map((c) => ({ id: c.id, text: c.text, metadata: c })),
killedBy: Full Pipeline E2E Smoke Test (N-12 + N-13 + N-14) Alpha tenant — OPA claims allow path (medical) exact registered claim → allow decision
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "refuse"

[Killed] ArrayDeclaration
src/insurance/allowed_claims_registry.ts:170:42
    */
   matchDisallowedPatterns(text: string): DisallowedPatternMatch {
     if (!text) {
-      return { matched: false, patterns: [] };
+      return { matched: false, patterns: ["Stryker was here"] };
     }
 
killedBy: AllowedClaimsRegistry matchDisallowedPatterns should return no match for empty text
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] LogicalOperator
src/insurance/allowed_claims_registry.ts:178:11
 
     for (let i = 0; i < this.disallowedPatternsLower.length; i++) {
       const patternLower = this.disallowedPatternsLower[i];
-      if (patternLower && lowered.includes(patternLower)) {
+      if (patternLower || lowered.includes(patternLower)) {
         matches.push(this.disallowedPatterns[i]);
       }
killedBy: ControlEngine evaluate() with assistant text matching disallowed claim pattern should allow exact-match approved claims for assistant text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "rewrite"

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:183:23
       }
     }
 
-    return { matched: matches.length > 0, patterns: matches };
+    return { matched: matches.length <= 0, patterns: matches };
   }
 
killedBy: ControlEngine evaluate() with assistant text matching disallowed claim pattern should return rewrite for text containing a disallowed pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:197:11
 
     // Pass 1: exact match (normalised)
     for (const claim of this.claimTexts) {
-      if (claim.text.toLowerCase().trim() === normalised) {
+      if (claim.text.toLowerCase().trim() !== normalised) {
         return {
           matched: true,
killedBy: ClaimsCheck exact match should allow text that exactly matches an approved claim
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "rewrite"

[Killed] MethodExpression
src/insurance/allowed_claims_registry.ts:197:11
 
     // Pass 1: exact match (normalised)
     for (const claim of this.claimTexts) {
-      if (claim.text.toLowerCase().trim() === normalised) {
+      if (claim.text.toUpperCase().trim() === normalised) {
         return {
           matched: true,
killedBy: ControlEngine evaluate() with assistant text matching disallowed claim pattern should allow exact-match approved claims for assistant text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "rewrite"

[Killed] Regex
src/insurance/allowed_claims_registry.ts:214:54
 
     for (const claim of this.claimTexts) {
       const claimLower = claim.text.toLowerCase();
-      const proposedWords = new Set(normalised.split(/\s+/));
+      const proposedWords = new Set(normalised.split(/\S+/));
       const claimWords = claimLower.split(/\s+/);
       const overlapCount = claimWords.filter((w) =>
killedBy: ClaimsCheck partial match should rewrite text that partially matches an approved claim
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Survived] Regex
src/insurance/allowed_claims_registry.ts:215:43
     for (const claim of this.claimTexts) {
       const claimLower = claim.text.toLowerCase();
       const proposedWords = new Set(normalised.split(/\s+/));
-      const claimWords = claimLower.split(/\s+/);
+      const claimWords = claimLower.split(/\s/);
       const overlapCount = claimWords.filter((w) =>
         proposedWords.has(w),

[Killed] ArithmeticOperator
src/insurance/allowed_claims_registry.ts:219:45
       const overlapCount = claimWords.filter((w) =>
         proposedWords.has(w),
       ).length;
-      const score = claimWords.length > 0 ? overlapCount / claimWords.length : 0;
+      const score = claimWords.length > 0 ? overlapCount * claimWords.length : 0;
 
       if (score > bestScore) {
killedBy: ClaimsCheck no match (unverified claim) should flag unverified claim when registry is non-empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "rewrite"

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:221:30
       ).length;
       const score = claimWords.length > 0 ? overlapCount / claimWords.length : 0;
 
-      if (score > bestScore) {
-        bestScore = score;
-        bestMatch = claim;
-      }
+      if (score > bestScore) {}
     }
 
killedBy: ClaimsCheck partial match should rewrite text that partially matches an approved claim
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:227:79
       }
     }
 
-    if (bestMatch && bestScore >= (this.config.partialMatchThreshold ?? 0.6)) {
-      return {
-        matched: true,
-        claimId: bestMatch.id,
-        confidence: bestScore,
-        requiredDisclaimerId: bestMatch.requiredDisclaimerId ?? null,
-        matchType: "partial",
-      };
-    }
+    if (bestMatch && bestScore >= (this.config.partialMatchThreshold ?? 0.6)) {}
 
     return {
killedBy: AllowedClaimsRegistry matchText partial match should return partial match when word overlap exceeds threshold
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:227:22
       }
     }
 
-    if (bestMatch && bestScore >= (this.config.partialMatchThreshold ?? 0.6)) {
+    if (bestMatch && true) {
       return {
         matched: true,
killedBy: ClaimsCheck no match (unverified claim) should flag unverified claim when registry is non-empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "rewrite"

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:256:12
   getSimilarityScore(proposedText: string): number {
     if (this.claimTexts.length === 0) return 0;
     const results = this.vectorStore.search(proposedText, 1);
-    return results.length > 0 && results[0] ? results[0].score : 0;
+    return true ? results[0].score : 0;
   }
 
killedBy: AllowedClaimsRegistry — property-based tests (fast-check) P1: getSimilarityScore is always in [0, 1]
statusReason: Error: Property failed after 1 tests
{ seed: 459802707, path: "0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [[{"id":"00000000-0000-1000-8000-000000000000","text":" "}],""]
Shrunk 11 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:286:9
       dtype: "fp32",
     });
 
-    if (this.claimTexts.length > 0) {
+    if (true) {
       const output = await this.embeddingPipeline(
         this.claimTexts.map((c) => c.text),
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should complete initialize() without computing embeddings when registry is empty
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: [], {"normalize": true, "pooling": "mean"}

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:322:7
    */
   async getEmbeddingSimilarityScore(proposedText: string): Promise<number> {
     if (
-      !this.embeddingInitialized ||
-      !this.embeddingPipeline ||
-      this.claimEmbeddings.length === 0
+      true
     ) {
       return this.getSimilarityScore(proposedText);
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Survived] ObjectLiteral
src/insurance/allowed_claims_registry.ts:329:63
       return this.getSimilarityScore(proposedText);
     }
 
-    const output = await this.embeddingPipeline(proposedText, {
-      pooling: "mean",
-      normalize: true,
-    });
+    const output = await this.embeddingPipeline(proposedText, {});
     const embDim = output.dims[1] ?? 0;
     const queryVec = new Float32Array(

[Survived] StringLiteral
src/insurance/allowed_claims_registry.ts:330:16
     }
 
     const output = await this.embeddingPipeline(proposedText, {
-      pooling: "mean",
+      pooling: "",
       normalize: true,
     });

[Killed] BlockStatement
src/insurance/allowed_claims_registry.ts:374:38
   let dot = 0;
   let normA = 0;
   let normB = 0;
-  for (let i = 0; i < a.length; i++) {
-    dot += a[i] * b[i];
-    normA += a[i] * a[i];
-    normB += b[i] * b[i];
-  }
+  for (let i = 0; i < a.length; i++) {}
   if (normA === 0 || normB === 0) return 0;
   return dot / (Math.sqrt(normA) * Math.sqrt(normB));
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:379:22
     normA += a[i] * a[i];
     normB += b[i] * b[i];
   }
-  if (normA === 0 || normB === 0) return 0;
+  if (normA === 0 || normB !== 0) return 0;
   return dot / (Math.sqrt(normA) * Math.sqrt(normB));
 }
killedBy: AllowedClaimsRegistry initialize + getEmbeddingSimilarityScore should score semantically similar text higher than TF-IDF would
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Survived] ArrayDeclaration
src/insurance/allowed_claims_registry.ts:388:46
 ): { claims: ApprovedClaim[]; disallowedPatterns: string[] } {
   const catalogPath = resolveClaimsPath(config);
   if (!catalogPath) {
-    return { claims: [], disallowedPatterns: [] };
+    return { claims: [], disallowedPatterns: ["Stryker was here"] };
   }
 

[Survived] ArrayDeclaration
src/insurance/allowed_claims_registry.ts:398:11
       ? parsed.allowed_claims
       : Array.isArray(parsed.claims)
         ? parsed.claims
-        : [];
+        : ["Stryker was here"];
     const disallowedPatterns = toStringArray(parsed.disallowed_patterns);
 

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:404:11
     const claims: ApprovedClaim[] = [];
     for (const entry of rawClaims) {
       const claim = normalizeClaimEntry(entry);
-      if (claim) {
+      if (true) {
         claims.push(claim);
       }
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true skips invalid entry missing id
statusReason: TypeError: Cannot read properties of null (reading 'id')

[Killed] ObjectLiteral
src/insurance/allowed_claims_registry.ts:412:12
     return { claims, disallowedPatterns };
   } catch (error) {
     console.error("[AllowedClaimsRegistry] Failed to load claims:", error);
-    return { claims: [], disallowedPatterns: [] };
+    return {};
   }
 }
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true returns empty registry on malformed JSON (error path)
statusReason: TypeError: Cannot read properties of undefined (reading 'length')

[Survived] StringLiteral
src/insurance/allowed_claims_registry.ts:431:32
   }
 
   const cwd = process.cwd();
-  candidates.push(resolve(cwd, "knowledge", "allowed_claims.json"));
+  candidates.push(resolve(cwd, "", "allowed_claims.json"));
   candidates.push(resolve(cwd, "..", "knowledge", "allowed_claims.json"));
 

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:457:5
 
   const record = entry as AllowedClaimsCatalogEntry;
   const id =
-    typeof record.id === "string" ? record.id.trim() : undefined;
+    true ? record.id.trim() : undefined;
   const textCandidate =
     typeof record.text === "string"
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true skips invalid entry missing id
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/insurance/allowed_claims_registry.ts:459:5
   const id =
     typeof record.id === "string" ? record.id.trim() : undefined;
   const textCandidate =
-    typeof record.text === "string"
+    true
       ? record.text
       : typeof record.claim === "string"
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true accepts claim entry with claim field instead of text
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Uses claim field"
Received: undefined

[Killed] LogicalOperator
src/insurance/allowed_claims_registry.ts:465:7
         ? record.claim
         : undefined;
 
-  if (!id || !textCandidate || textCandidate.trim().length === 0) {
+  if (!id && !textCandidate || textCandidate.trim().length === 0) {
     console.warn("[AllowedClaimsRegistry] Skipping invalid claim entry", entry);
     return null;
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true skips invalid entry missing id
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] BooleanLiteral
src/insurance/allowed_claims_registry.ts:465:14
         ? record.claim
         : undefined;
 
-  if (!id || !textCandidate || textCandidate.trim().length === 0) {
+  if (!id || textCandidate || textCandidate.trim().length === 0) {
     console.warn("[AllowedClaimsRegistry] Skipping invalid claim entry", entry);
     return null;
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] ConditionalExpression
src/insurance/allowed_claims_registry.ts:480:5
 
   const evidenceIds = toStringArray(record.evidence_ids);
   const approvedBy =
-    typeof record.approved_by === "string" ? record.approved_by : undefined;
+    true ? record.approved_by : undefined;
   const source =
     typeof record.source === "string"

[Survived] ConditionalExpression
src/insurance/allowed_claims_registry.ts:482:5
   const approvedBy =
     typeof record.approved_by === "string" ? record.approved_by : undefined;
   const source =
-    typeof record.source === "string"
+    true
       ? record.source
       : buildSource(evidenceIds, approvedBy);

[Survived] EqualityOperator
src/insurance/allowed_claims_registry.ts:488:9
   const lastVerified =
     typeof record.last_verified === "string"
       ? record.last_verified
-      : typeof record.approved_date === "string"
+      : typeof record.approved_date !== "string"
         ? record.approved_date
         : undefined;

[Survived] EqualityOperator
src/insurance/allowed_claims_registry.ts:492:5
         ? record.approved_date
         : undefined;
   const category =
-    typeof record.category === "string" ? record.category : undefined;
+    typeof record.category !== "string" ? record.category : undefined;
 
   return {

[Killed] ObjectLiteral
src/insurance/allowed_claims_registry.ts:494:10
   const category =
     typeof record.category === "string" ? record.category : undefined;
 
-  return {
-    id,
-    text: textCandidate.trim(),
-    source,
-    category,
-    requiredDisclaimerId: requiredDisclaimerId?.trim() || undefined,
-    requiredDisclaimerIds: disclaimerIds,
-    lastVerified,
-    metadata: {
-      evidence_ids: evidenceIds,
-      approved_by: approvedBy,
-      approved_date: record.approved_date,
-    },
-  };
+  return {};
 }
 
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: TypeError: Cannot read properties of undefined (reading 'toLowerCase')

[Survived] BlockStatement
src/insurance/allowed_claims_registry.ts:515:28
   if (approvedBy && approvedBy.trim().length > 0) {
     tokens.push(approvedBy.trim());
   }
-  if (tokens.length === 0) {
-    return "allowed_claims.json";
-  }
+  if (tokens.length === 0) {}
   return tokens.join(", ");
 }

[Survived] ConditionalExpression
src/insurance/allowed_claims_registry.ts:515:7
   if (approvedBy && approvedBy.trim().length > 0) {
     tokens.push(approvedBy.trim());
   }
-  if (tokens.length === 0) {
+  if (false) {
     return "allowed_claims.json";
   }

[Survived] StringLiteral
src/insurance/allowed_claims_registry.ts:516:12
     tokens.push(approvedBy.trim());
   }
   if (tokens.length === 0) {
-    return "allowed_claims.json";
+    return "";
   }
   return tokens.join(", ");

[Killed] BooleanLiteral
src/insurance/allowed_claims_registry.ts:522:7
 }
 
 function toStringArray(value: unknown): string[] {
-  if (!Array.isArray(value)) {
+  if (Array.isArray(value)) {
     return [];
   }
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads claims from sourcePath using allowed_claims key
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArrowFunction
src/insurance/allowed_claims_registry.ts:526:13
     return [];
   }
   return value
-    .filter((entry): entry is string => typeof entry === "string")
+    .filter(() => undefined)
     .map((entry) => entry.trim())
     .filter((entry) => entry.length > 0);
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads disallowed_patterns from file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/insurance/allowed_claims_registry.ts:528:24
   return value
     .filter((entry): entry is string => typeof entry === "string")
     .map((entry) => entry.trim())
-    .filter((entry) => entry.length > 0);
+    .filter((entry) => entry.length <= 0);
 }
 
killedBy: AllowedClaimsRegistry file loading — enableFileLoad: true loads disallowed_patterns from file
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
