[Killed] StringLiteral
src/insurance/policy_gate.ts:131:21
       pattern.lastIndex = 0;
       if (pattern.test(text)) {
         return {
-          decision: "refuse",
+          decision: "",
           reasonCodes: ["MODERATION_VIOLATION"],
           severity: 4,
killedBy: ControlEngine evaluate() with text matching moderation deny pattern should return refuse for text containing a denied pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "refuse"
Received: "allow"

[Killed] LogicalOperator
src/insurance/policy_gate.ts:167:9
       ...metadataTexts,
     ];
 
-    if (textCandidates.length === 0 && claimIds.length === 0) {
+    if (textCandidates.length === 0 || claimIds.length === 0) {
       return { decision: "allow", reasonCodes: [], severity: 0 };
     }
killedBy: ControlEngine evaluate() with assistant text matching disallowed claim pattern should return rewrite for text containing a disallowed pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] StringLiteral
src/insurance/policy_gate.ts:168:26
     ];
 
     if (textCandidates.length === 0 && claimIds.length === 0) {
-      return { decision: "allow", reasonCodes: [], severity: 0 };
+      return { decision: "", reasonCodes: [], severity: 0 };
     }
 
killedBy: ClaimsCheck metadata claim extraction should allow empty text with no metadata
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: ""

[Killed] ObjectLiteral
src/insurance/policy_gate.ts:197:14
           this.formatDisallowedPattern(pattern),
         ),
       ];
-      return {
-        decision: "rewrite",
-        reasonCodes,
-        severity: 3,
-        safeRewrite: approvedClaim?.text,
-        requiredDisclaimerId: match.requiredDisclaimerId ?? undefined,
-      };
+      return {};
     }
 
killedBy: ControlEngine evaluate() with assistant text matching disallowed claim pattern should return rewrite for text containing a disallowed pattern
statusReason: TypeError: result.reasonCodes is not iterable (cannot read property undefined)

[Killed] EqualityOperator
src/insurance/policy_gate.ts:218:9
       };
     }
 
-    if (match.matchType === "partial") {
+    if (match.matchType !== "partial") {
       // Partial match — rewrite to approved version
       const approvedClaim = match.claimId
killedBy: ClaimsCheck partial match should rewrite text that partially matches an approved claim
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] StringLiteral
src/insurance/policy_gate.ts:226:23
 
       return {
         decision: "rewrite",
-        reasonCodes: ["CLAIMS_RISK"],
+        reasonCodes: [""],
         severity: 2,
         safeRewrite: approvedClaim?.text,
killedBy: ClaimsCheck partial match should rewrite text that partially matches an approved claim
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "CLAIMS_RISK"
Received array: [""]

[NoCoverage] ArrayDeclaration
src/insurance/policy_gate.ts:247:48
 
   private evaluateClaimId(claimId: string): CheckResult {
     if (!claimId) {
-      return { decision: "allow", reasonCodes: [], severity: 0 };
+      return { decision: "allow", reasonCodes: ["Stryker was here"], severity: 0 };
     }
 

[Killed] ArrayDeclaration
src/insurance/policy_gate.ts:263:22
     if (this.registry.size > 0) {
       return {
         decision: "allow",
-        reasonCodes: ["UNVERIFIED_CLAIM_ID"],
+        reasonCodes: [],
         severity: 1,
       };
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Killed] BlockStatement
src/insurance/policy_gate.ts:277:49
     claimIds: string[];
   } {
     const transcriptTexts: string[] = [];
-    if (ctx.text && ctx.text.trim().length > 0) {
-      transcriptTexts.push(ctx.text.trim());
-    }
+    if (ctx.text && ctx.text.trim().length > 0) {}
 
     const metadataTexts: string[] = [];
killedBy: ControlEngine evaluate() with assistant text matching disallowed claim pattern should return rewrite for text containing a disallowed pattern
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] EqualityOperator
src/insurance/policy_gate.ts:284:25
     const metadataTexts: string[] = [];
     const claimIds: string[] = [];
 
-    if (ctx.metadata && typeof ctx.metadata === "object") {
+    if (ctx.metadata && typeof ctx.metadata !== "object") {
       const metadata = ctx.metadata as Record<string, unknown>;
       const sources: unknown[] = [
killedBy: ClaimsCheck metadata claim extraction should flag unverified claim IDs when registry has claims
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "UNVERIFIED_CLAIM_ID"
Received array: []

[Survived] ArrayDeclaration
src/insurance/policy_gate.ts:315:29
     texts: string[];
     ids: string[];
   } {
-    const texts: string[] = [];
+    const texts: string[] = ["Stryker was here"];
     const ids: string[] = [];
 

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:340:9
       return { texts, ids };
     }
 
-    if (source && typeof source === "object") {
+    if (false) {
       const record = source as Record<string, unknown>;
       const id =
killedBy: ClaimsCheck metadata claim extraction should extract claim text from metadata claims
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Survived] Regex
src/insurance/policy_gate.ts:367:12
   }
 
   private looksLikeClaimId(value: string): boolean {
-    return /^CLAIM-\d{3,}$/i.test(value.trim());
+    return /^CLAIM-\d{3,}/i.test(value.trim());
   }
 

[Survived] StringLiteral
src/insurance/policy_gate.ts:374:28
     const normalized = pattern
       .toUpperCase()
       .replace(/[^A-Z0-9]+/g, "_")
-      .replace(/^_+|_+$/g, "");
+      .replace(/^_+|_+$/g, "Stryker was here!");
     return `DISALLOWED_PATTERN:${normalized || "UNKNOWN"}`;
   }

[Survived] ObjectLiteral
src/insurance/policy_gate.ts:383:62
       return { decision: "allow", reasonCodes: [], severity: 0 };
     }
 
-    const decisionPriority: Record<PolicyDecision, number> = {
-      allow: 0,
-      rewrite: 1,
-      refuse: 2,
-      escalate: 3,
-      cancel_output: 4,
-    };
+    const decisionPriority: Record<PolicyDecision, number> = {};
 
     let winningResult: CheckResult = {

[Killed] ArrayDeclaration
src/insurance/policy_gate.ts:397:35
       severity: 0,
     };
 
-    const reasonCodes: string[] = [];
+    const reasonCodes: string[] = ["Stryker was here"];
     let requiredDisclaimerId: string | undefined;
 
killedBy: ClaimsCheck exact match should allow text that exactly matches an approved claim
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 3

- Array []
+ Array [
+   "Stryker was here",

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:403:11
     for (const result of results) {
       reasonCodes.push(...result.reasonCodes);
 
-      if (!requiredDisclaimerId && result.requiredDisclaimerId) {
+      if (false) {
         requiredDisclaimerId = result.requiredDisclaimerId;
       }
killedBy: ClaimsCheck exact match should include requiredDisclaimerId on exact match when present
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "DISC-001"
Received: undefined

[Survived] ConditionalExpression
src/insurance/policy_gate.ts:413:11
       if (
         newPriority > currentPriority ||
         (newPriority === currentPriority &&
-          result.severity > winningResult.severity)
+          true)
       ) {
         winningResult = result;

[Killed] Regex
src/insurance/policy_gate.ts:451:16
     const defaultPatterns = [
       {
         name: "phone_us",
-        regex: /\b\d{3}[-.]?\d{3}[-.]?\d{4}\b/g,
+        regex: /\b\d{3}[-.]?\d{3}[-.]\d{4}\b/g,
         replacement: "[PHONE_REDACTED]",
       },
killedBy: PIIRedactorCheck phone number detection should detect US phone number without separators
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] Regex
src/insurance/policy_gate.ts:461:16
       },
       {
         name: "ssn",
-        regex: /\b\d{3}-\d{2}-\d{4}\b/g,
+        regex: /\b\d{3}-\D{2}-\d{4}\b/g,
         replacement: "[SSN_REDACTED]",
       },
killedBy: ControlEngine evaluate() with PII in text should return rewrite when an SSN is detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] ArrayDeclaration
src/insurance/policy_gate.ts:484:37
    */
   redactText(text: string): PIIRedactionResult {
     let redacted = text;
-    const detectedTypes: string[] = [];
+    const detectedTypes: string[] = ["Stryker was here"];
 
     for (const { name, regex, replacement } of this.patterns) {
killedBy: ControlEngine evaluate() with clean user text should return allow for innocuous user input
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: "rewrite"

[Killed] BlockStatement
src/insurance/policy_gate.ts:512:35
       new Set([...textResult.detectedTypes, ...metadataResult.detectedTypes]),
     );
 
-    if (detectedTypes.length > 0) {
-      const reasonCodes = [
-        "PII_DETECTED",
-        ...detectedTypes.map((t) => `PII_DETECTED:${t.toUpperCase()}`),
-      ];
-      const shouldRedact = this.mode === "redact";
-      return {
-        decision: shouldRedact ? "rewrite" : "allow",
-        reasonCodes,
-        severity: shouldRedact ? 3 : 1,
-        safeRewrite: shouldRedact ? textResult.redactedText : undefined,
-      };
-    }
+    if (detectedTypes.length > 0) {}
 
     return { decision: "allow", reasonCodes: [], severity: 0 };
killedBy: ControlEngine evaluate() with PII in text should return rewrite when a phone number is detected
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:517:28
         "PII_DETECTED",
         ...detectedTypes.map((t) => `PII_DETECTED:${t.toUpperCase()}`),
       ];
-      const shouldRedact = this.mode === "redact";
+      const shouldRedact = true;
       return {
         decision: shouldRedact ? "rewrite" : "allow",
killedBy: ControlEngine evaluate() with PII in text should handle PII in flag-only mode without rewriting
statusReason: Error: expect(received).toBeUndefined()

Received: "My phone number is [PHONE_REDACTED]"

[Killed] StringLiteral
src/insurance/policy_gate.ts:519:46
       ];
       const shouldRedact = this.mode === "redact";
       return {
-        decision: shouldRedact ? "rewrite" : "allow",
+        decision: shouldRedact ? "rewrite" : "",
         reasonCodes,
         severity: shouldRedact ? 3 : 1,
killedBy: PIIRedactorCheck flag mode vs redact mode should return allow decision in flag mode
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "allow"
Received: ""

[Survived] ArrayDeclaration
src/insurance/policy_gate.ts:535:53
     seen: WeakSet<object>,
   ): { redactedValue: unknown; detectedTypes: string[] } {
     if (depth > this.maxMetadataDepth) {
-      return { redactedValue: value, detectedTypes: [] };
+      return { redactedValue: value, detectedTypes: ["Stryker was here"] };
     }
 

[Killed] BlockStatement
src/insurance/policy_gate.ts:538:36
       return { redactedValue: value, detectedTypes: [] };
     }
 
-    if (typeof value === "string") {
-      const result = this.redactText(value);
-      return {
-        redactedValue: this.redactMetadata ? result.redactedText : value,
-        detectedTypes: result.detectedTypes,
-      };
-    }
+    if (typeof value === "string") {}
 
     if (!value || typeof value !== "object") {
killedBy: PIIRedactorCheck metadata scanning should detect PII in metadata string values
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "rewrite"
Received: "allow"

[Killed] ConditionalExpression
src/insurance/policy_gate.ts:546:9
       };
     }
 
-    if (!value || typeof value !== "object") {
+    if (false) {
       return { redactedValue: value, detectedTypes: [] };
     }
killedBy: PIIRedactorCheck phone number detection should detect US phone number with dashes
statusReason: TypeError: Invalid value used in weak set

[Killed] ArrayDeclaration
src/insurance/policy_gate.ts:632:39
   private checks: PolicyCheck[];
   private opaEvaluator?: OpaEvaluator;
 
-  constructor(checks: PolicyCheck[] = [], opaEvaluator?: OpaEvaluator) {
+  constructor(checks: PolicyCheck[] = ["Stryker was here"], opaEvaluator?: OpaEvaluator) {
     this.checks = checks;
     this.opaEvaluator = opaEvaluator;
killedBy: PolicyGate should return allow when no checks are configured
statusReason: TypeError: check.evaluate is not a function

[Killed] ObjectLiteral
src/insurance/policy_gate.ts:664:33
       const result = await check.evaluate(ctx);
 
       allReasonCodes.push(...result.reasonCodes);
-      completedCheckInputs.push({
-        name: check.name,
-        decision: result.decision,
-        reasonCodes: result.reasonCodes,
-        severity: result.severity,
-        safeRewrite: result.safeRewrite,
-        requiredDisclaimerId: result.requiredDisclaimerId,
-      });
+      completedCheckInputs.push({});
 
       // Higher-priority decision wins; break ties by severity
killedBy: PolicyGate + OpaEvaluator integration short-circuit still limits checks passed to OPA
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "first"
Received: undefined

[Killed] EqualityOperator
src/insurance/policy_gate.ts:688:9
       // Short-circuit: no check can override cancel_output, and critical
       // refuse/escalate will be upgraded to cancel_output by OverrideController
       if (
-        winningResult.decision === "cancel_output" ||
+        winningResult.decision !== "cancel_output" ||
         (winningResult.severity >= 4 &&
           (winningResult.decision === "refuse" ||
killedBy: ControlEngine evaluate() with clean user text should return allow for innocuous user input
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "moderator"
Received array: ["pii_redactor"]

[Killed] EqualityOperator
src/insurance/policy_gate.ts:689:10
       // refuse/escalate will be upgraded to cancel_output by OverrideController
       if (
         winningResult.decision === "cancel_output" ||
-        (winningResult.severity >= 4 &&
+        (winningResult.severity < 4 &&
           (winningResult.decision === "refuse" ||
             winningResult.decision === "escalate"))
killedBy: ControlEngine evaluate() with text matching moderation deny pattern should short-circuit and skip claims_checker after critical refuse
statusReason: Error: expect(received).not.toContain(expected) // indexOf

Expected value: not "claims_checker"
Received array:     ["pii_redactor", "moderator", "claims_checker"]
