[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:102:16
       case "A_PLAYING":
         return "A";
       case "B_PLAYING":
-        return "B";
+        return "";
       case "FALLBACK_PLAYING":
         return "fallback";
killedBy: Lane C Policy Cancel and Fallback Integration when Lane B is playing should stop Lane B, trigger fallback, and log audit events
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"payload": ObjectContaining {"from": "B", "to": "fallback", "trigger": "policy_cancel"}, "type": "arbitration.owner.transition"}
Received
       1: {"event_id": "a53634a9-535c-421a-9426-8577f36b783b", "payload": {"from": "IDLE", "to": "LISTENING", "trigger": "session_start"}, "session_id": "policy-test-session"

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:106:16
       case "FALLBACK_PLAYING":
         return "fallback";
       default:
-        return "none";
+        return "";
     }
   }
killedBy: LaneArbitrator Initialization should have no current owner initially
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "none"
Received: ""

[Timeout] StringLiteral
src/orchestrator/LaneArbitrator.ts:121:21
    * Start the session (transition to LISTENING)
    */
   startSession(): void {
-    this.transition("LISTENING", "session_start");
+    this.transition("", "session_start");
     console.log(`[LaneArbitrator] Session started: ${this.sessionId}`);
   }

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:121:34
    * Start the session (transition to LISTENING)
    */
   startSession(): void {
-    this.transition("LISTENING", "session_start");
+    this.transition("LISTENING", "");
     console.log(`[LaneArbitrator] Session started: ${this.sessionId}`);
   }

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:132:9
     this.clearTimers();
     this.responseInProgress = false;
 
-    if (this.state === "FALLBACK_PLAYING") {
+    if (false) {
       this.emit("stop_fallback");
     }
killedBy: LaneArbitrator endSession() from FALLBACK_PLAYING emits stop_fallback (line 131) stop_fallback is emitted when endSession called from FALLBACK_PLAYING
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:136:21
       this.emit("stop_fallback");
     }
 
-    this.transition("ENDED", "session_end");
+    this.transition("", "session_end");
     console.log(`[LaneArbitrator] Session ended: ${this.sessionId}`);
   }
killedBy: LaneArbitrator State Transitions should transition ENDED on endSession
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ENDED"
Received: ""

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:137:17
     }
 
     this.transition("ENDED", "session_end");
-    console.log(`[LaneArbitrator] Session ended: ${this.sessionId}`);
+    console.log(``);
   }
 

[Survived] BlockStatement
src/orchestrator/LaneArbitrator.ts:145:34
    */
   onUserSpeechEnded(): void {
     // Guard against overlapping response cycles
-    if (this.responseInProgress) {
-      console.log(
-        `[LaneArbitrator] Ignoring speech end: response already in progress`,
-      );
-      return;
-    }
+    if (this.responseInProgress) {}
 
     if (this.state !== "LISTENING") {

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:147:9
     // Guard against overlapping response cycles
     if (this.responseInProgress) {
       console.log(
-        `[LaneArbitrator] Ignoring speech end: response already in progress`,
+        ``,
       );
       return;

[Timeout] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:152:9
       return;
     }
 
-    if (this.state !== "LISTENING") {
+    if (true) {
       console.warn(
         `[LaneArbitrator] Unexpected speech end in state: ${this.state}`,

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:168:9
     this.transition("B_RESPONDING", "user_speech_ended");
 
     // If Lane A is enabled, schedule reflex after min delay
-    if (this.config.laneAEnabled) {
+    if (true) {
       this.reflexTimer = setTimeout(() => {
         this.triggerLaneA();
killedBy: LaneArbitrator Lane A Reflex Triggering should skip Lane A if disabled in config
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: called with 0 arguments

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:190:7
     // Transition to A_PLAYING
     this.transitionLaneOwner(
       "none",
-      "A",
+      "",
       "user_speech_ended" as LaneTransitionCause,
     );

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:197:17
 
     // Emit event to trigger reflex audio
     this.emit("play_reflex");
-    console.log(`[LaneArbitrator] Lane A reflex triggered`);
+    console.log(``);
 
     // Set timeout to auto-cancel Lane A if B takes too long

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:201:39
 
     // Set timeout to auto-cancel Lane A if B takes too long
     this.reflexTimeoutTimer = setTimeout(() => {
-      if (this.state === "A_PLAYING") {
-        console.log(`[LaneArbitrator] Lane A timeout - auto-canceling`);
-        this.emit("stop_reflex");
-      }
+      if (this.state === "A_PLAYING") {}
     }, this.config.maxReflexDurationMs);
   }
killedBy: LaneArbitrator Lane A Reflex Triggering should auto-cancel Lane A after maxReflexDurationMs
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:240:34
 
       // Small gap to avoid audio click
       setTimeout(() => {
-        this.transitionLaneOwner("A", "B", "b_first_audio_ready");
+        this.transitionLaneOwner("", "B", "b_first_audio_ready");
         this.transition("B_PLAYING", "b_first_audio_ready");
         this.emit("play_lane_b");
killedBy: LaneArbitrator Lane B Preemption should emit owner_change event on preemption
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test while waiting for `done()` to be called.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:241:25
       // Small gap to avoid audio click
       setTimeout(() => {
         this.transitionLaneOwner("A", "B", "b_first_audio_ready");
-        this.transition("B_PLAYING", "b_first_audio_ready");
+        this.transition("", "b_first_audio_ready");
         this.emit("play_lane_b");
       }, this.config.transitionGapMs);
killedBy: LaneArbitrator Lane B Preemption should preempt Lane A when Lane B ready
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "B_PLAYING"
Received: ""

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:242:19
       setTimeout(() => {
         this.transitionLaneOwner("A", "B", "b_first_audio_ready");
         this.transition("B_PLAYING", "b_first_audio_ready");
-        this.emit("play_lane_b");
+        this.emit("");
       }, this.config.transitionGapMs);
     } else if (this.state === "B_RESPONDING") {
killedBy: Voice Pipeline Integration Complete Voice Interaction Flow should handle Lane A → Lane B preemption
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:247:23
     } else if (this.state === "B_RESPONDING") {
       // Lane A wasn't triggered or skipped - go straight to B
       this.transitionLaneOwner("none", "B", "b_first_audio_ready");
-      this.transition("B_PLAYING", "b_first_audio_ready");
+      this.transition("", "b_first_audio_ready");
       this.emit("play_lane_b");
     }
killedBy: LaneArbitrator Lane B ready flow should transition to B_PLAYING when Lane B is ready
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "B_PLAYING"
Received: ""

[Survived] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:262:9
         `(state: ${this.state}, responseInProgress: ${this.responseInProgress})`,
     );
 
-    if (this.suppressLaneBDone) {
+    if (false) {
       console.log(
         `[LaneArbitrator] Lane B done suppressed after policy cancel`,

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:281:36
     if (this.state === "B_PLAYING") {
       console.log(`[LaneArbitrator] Lane B response complete (normal flow)`);
       this.transitionLaneOwner("B", "none", "response_done");
-      this.transition("LISTENING", "response_done");
+      this.transition("LISTENING", "");
       this.responseInProgress = false;
       this.emit("response_complete");

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:290:9
     // Case 2: Response completed before audio started playing
     // This happens when: buffer commit failed → no state transition →
     // but OpenAI sent response anyway (error recovery)
-    if (this.state === "LISTENING" || this.state === "B_RESPONDING") {
+    if (true) {
       console.log(
         `[LaneArbitrator] Lane B done in ${this.state} ` +
killedBy: LaneArbitrator onLaneBDone - Case 3: Response Completes During A_PLAYING should stop Lane A when Lane B done before preemption
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] EqualityOperator
src/orchestrator/LaneArbitrator.ts:297:11
       );
 
       // Ensure we're in LISTENING state
-      if (this.state === "B_RESPONDING") {
+      if (this.state !== "B_RESPONDING") {
         this.transition("LISTENING", "response_done");
       }
killedBy: LaneArbitrator onLaneBDone - Case 2: Commit Failed / Fast Response should handle response complete in B_RESPONDING (fast response)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LISTENING"
Received: "B_RESPONDING"

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:312:9
     // Case 3: Got done in A_PLAYING (B never took over)
     if (this.state === "A_PLAYING") {
       console.log(
-        `[LaneArbitrator] Lane B done while A playing ` +
+        `` +
           `(B completed before preempting A - unusual but valid)`,
       );

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:313:11
     if (this.state === "A_PLAYING") {
       console.log(
         `[LaneArbitrator] Lane B done while A playing ` +
-          `(B completed before preempting A - unusual but valid)`,
+          ``,
       );
 

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:318:45
 
       // Stop Lane A since B is done
       this.emit("stop_reflex");
-      this.transitionLaneOwner("A", "none", "response_done");
+      this.transitionLaneOwner("A", "none", "");
       this.transition("LISTENING", "response_done");
       this.responseInProgress = false;

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:318:37
 
       // Stop Lane A since B is done
       this.emit("stop_reflex");
-      this.transitionLaneOwner("A", "none", "response_done");
+      this.transitionLaneOwner("A", "", "response_done");
       this.transition("LISTENING", "response_done");
       this.responseInProgress = false;

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:333:34
 
     // Force state to safe ground
     this.clearTimers();
-    if (this.state !== "IDLE" && this.state !== "ENDED") {
+    if (this.state !== "IDLE" && true) {
       this.transition("LISTENING", "response_done");
     }
killedBy: LaneArbitrator onLaneBDone - Case 4: Defensive Reset should NOT reset ENDED state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ENDED"
Received: "LISTENING"

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:354:11
       this.clearTimers();
 
       // Return to listening if not already there
-      if (this.state === "B_RESPONDING") {
+      if (false) {
         this.transition("LISTENING", "user_speech_ended");
       }
killedBy: Voice Pipeline Integration Error Handling Integration should handle commit failure gracefully
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LISTENING"
Received: "B_RESPONDING"

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:355:38
 
       // Return to listening if not already there
       if (this.state === "B_RESPONDING") {
-        this.transition("LISTENING", "user_speech_ended");
+        this.transition("LISTENING", "");
       }
     }

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:368:37
 
     this.clearTimers();
 
-    if (this.state === "A_PLAYING") {
-      this.emit("stop_reflex");
-      this.transitionLaneOwner("A", "none", "user_barge_in");
-    } else if (this.state === "B_PLAYING") {
+    if (this.state === "A_PLAYING") {} else if (this.state === "B_PLAYING") {
       this.emit("stop_lane_b");
       this.transitionLaneOwner("B", "none", "user_barge_in");
killedBy: LaneArbitrator barge-in handling should emit stop_reflex on barge-in during Lane A
statusReason: Error: thrown: "Exceeded timeout of 500 ms for a test while waiting for `done()` to be called.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:370:32
 
     if (this.state === "A_PLAYING") {
       this.emit("stop_reflex");
-      this.transitionLaneOwner("A", "none", "user_barge_in");
+      this.transitionLaneOwner("", "none", "user_barge_in");
     } else if (this.state === "B_PLAYING") {
       this.emit("stop_lane_b");

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:370:45
 
     if (this.state === "A_PLAYING") {
       this.emit("stop_reflex");
-      this.transitionLaneOwner("A", "none", "user_barge_in");
+      this.transitionLaneOwner("A", "none", "");
     } else if (this.state === "B_PLAYING") {
       this.emit("stop_lane_b");

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:373:45
       this.transitionLaneOwner("A", "none", "user_barge_in");
     } else if (this.state === "B_PLAYING") {
       this.emit("stop_lane_b");
-      this.transitionLaneOwner("B", "none", "user_barge_in");
+      this.transitionLaneOwner("B", "none", "");
     } else if (this.state === "FALLBACK_PLAYING") {
       this.emit("stop_fallback");
killedBy: LaneArbitrator User Barge-In Handling should emit owner_change on barge-in
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test while waiting for `done()` to be called.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] EqualityOperator
src/orchestrator/LaneArbitrator.ts:374:16
     } else if (this.state === "B_PLAYING") {
       this.emit("stop_lane_b");
       this.transitionLaneOwner("B", "none", "user_barge_in");
-    } else if (this.state === "FALLBACK_PLAYING") {
+    } else if (this.state !== "FALLBACK_PLAYING") {
       this.emit("stop_fallback");
       this.transitionLaneOwner("fallback", "none", "user_barge_in");
killedBy: LaneArbitrator FALLBACK_PLAYING state — barge-in and policy cancel barge-in from FALLBACK_PLAYING emits stop_fallback and returns to LISTENING
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected value: "stop_fallback"
Received array: []

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:376:44
       this.transitionLaneOwner("B", "none", "user_barge_in");
     } else if (this.state === "FALLBACK_PLAYING") {
       this.emit("stop_fallback");
-      this.transitionLaneOwner("fallback", "none", "user_barge_in");
+      this.transitionLaneOwner("fallback", "", "user_barge_in");
     }
 

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:383:9
     this.responseInProgress = false;
 
     // Return to listening
-    if (this.state !== "IDLE" && this.state !== "ENDED") {
+    if (true) {
       this.transition("LISTENING", "user_barge_in");
     }
killedBy: LaneArbitrator ENDED state guards — barge-in and policy cancel no-op barge-in from ENDED does not change state
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "ENDED"
Received: "LISTENING"

[Killed] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:383:9
     this.responseInProgress = false;
 
     // Return to listening
-    if (this.state !== "IDLE" && this.state !== "ENDED") {
+    if (false) {
       this.transition("LISTENING", "user_barge_in");
     }
killedBy: LaneArbitrator User Barge-In Handling should stop Lane A on barge-in
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "LISTENING"
Received: "A_PLAYING"

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:421:58
     }
 
     // Move to fallback playback
-    if (this.state !== "IDLE" && this.state !== "ENDED") {
-      this.transitionLaneOwner(previousOwner, "fallback", "policy_cancel");
-      this.transition("FALLBACK_PLAYING", "policy_cancel");
-      this.responseInProgress = true;
-      this.emit("play_fallback");
-    }
+    if (this.state !== "IDLE" && this.state !== "ENDED") {}
   }
 
killedBy: LaneArbitrator FALLBACK_PLAYING state — barge-in and policy cancel barge-in from FALLBACK_PLAYING emits stop_fallback and returns to LISTENING
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "FALLBACK_PLAYING"
Received: "B_PLAYING"

[Survived] EqualityOperator
src/orchestrator/LaneArbitrator.ts:435:9
   onFallbackComplete(): void {
     console.log(`[LaneArbitrator] Fallback playback complete`);
 
-    if (this.getCurrentOwner() === "fallback") {
+    if (this.getCurrentOwner() !== "fallback") {
       this.transitionLaneOwner("fallback", "none", "response_done");
     }

[Survived] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:435:9
   onFallbackComplete(): void {
     console.log(`[LaneArbitrator] Fallback playback complete`);
 
-    if (this.getCurrentOwner() === "fallback") {
+    if (false) {
       this.transitionLaneOwner("fallback", "none", "response_done");
     }

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:436:44
     console.log(`[LaneArbitrator] Fallback playback complete`);
 
     if (this.getCurrentOwner() === "fallback") {
-      this.transitionLaneOwner("fallback", "none", "response_done");
+      this.transitionLaneOwner("fallback", "", "response_done");
     }
 

[Killed] BlockStatement
src/orchestrator/LaneArbitrator.ts:439:58
       this.transitionLaneOwner("fallback", "none", "response_done");
     }
 
-    if (this.state !== "IDLE" && this.state !== "ENDED") {
-      this.transition("LISTENING", "response_done");
-    }
+    if (this.state !== "IDLE" && this.state !== "ENDED") {}
 
     this.responseInProgress = false;
killedBy: LaneArbitrator onFallbackComplete() owner and state guards (lines 434, 438) getCurrentOwner() returns 'none' after onFallbackComplete from FALLBACK_PLAYING (line 434)
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "none"
Received: "fallback"

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:445:15
 
     this.responseInProgress = false;
     this.suppressLaneBDone = false;
-    this.emit("response_complete");
+    this.emit("");
   }
 

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:471:7
 
     this.stateHistory.push(transition);
     console.log(
-      `[LaneArbitrator] ${oldState} -> ${newState} (cause: ${cause})`,
+      ``,
     );
 

[Killed] StringLiteral
src/orchestrator/LaneArbitrator.ts:480:15
       trigger: cause,
     });
 
-    this.emit("state_change", transition);
+    this.emit("", transition);
   }
 
killedBy: LaneArbitrator session lifecycle should emit state_change events
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "LISTENING",
-   "ENDED",

[Survived] StringLiteral
src/orchestrator/LaneArbitrator.ts:495:15
       event_id: uuidv4(),
       session_id: this.sessionId,
       t_ms: Date.now(),
-      source: "orchestrator",
+      source: "",
       type: "lane.owner_changed",
       payload: { from, to, cause },

[Survived] ObjectLiteral
src/orchestrator/LaneArbitrator.ts:497:16
       t_ms: Date.now(),
       source: "orchestrator",
       type: "lane.owner_changed",
-      payload: { from, to, cause },
+      payload: {},
     };
 

[Timeout] ConditionalExpression
src/orchestrator/LaneArbitrator.ts:515:9
     type: "arbitration.state.transition" | "arbitration.owner.transition",
     payload: { from: string; to: string; trigger: string },
   ) {
-    if (!this.auditTrail) return;
+    if (false) return;
 
     const event: ArbitratorAuditEvent = {

[Killed] ArrayDeclaration
src/orchestrator/LaneArbitrator.ts:546:12
    * Get state history for debugging
    */
   getStateHistory(): StateTransition[] {
-    return [...this.stateHistory];
+    return [];
   }
 
killedBy: LaneArbitrator State Transitions should track state history
statusReason: Error: expect(received).toBeGreaterThan(expected)

Expected: > 0
Received:   0

[Killed] ObjectLiteral
src/orchestrator/LaneArbitrator.ts:557:12
     bReadyTime: number | null;
     latencyMs: number | null;
   } {
-    return {
-      speechEndTime: this.speechEndTime,
-      bReadyTime: this.bReadyTime,
-      latencyMs:
-        this.speechEndTime && this.bReadyTime
-          ? this.bReadyTime - this.speechEndTime
-          : null,
-    };
+    return {};
   }
 }
killedBy: LaneArbitrator Timing Metrics should track speech end time
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Matcher error: received value must be a number or bigint

Received has value: undefined

[Killed] LogicalOperator
src/orchestrator/LaneArbitrator.ts:561:9
       speechEndTime: this.speechEndTime,
       bReadyTime: this.bReadyTime,
       latencyMs:
-        this.speechEndTime && this.bReadyTime
+        this.speechEndTime || this.bReadyTime
           ? this.bReadyTime - this.speechEndTime
           : null,
killedBy: LaneArbitrator TTFB arithmetic correctness latencyMs is null when only speechEndTime is set (bReadyTime not yet recorded)
statusReason: Error: expect(received).toBeNull()

Received: -1777939172617
